{
  "Deep Thoughts - Overview": "Tiefgründige Gedanken - Übersicht",
  "Some aspects of creating a blog are really easy, and some are extremely difficul.997EB56977F5D63B1118": "Einige Aspekte bei der Erstellung eines Blogs sind wirklich einfach, und einige sind extrem schwierig!",
  "A beginner friendly introduction with some swear words on how to start writing y.BE312646252BC9A86726": "Eine anfängerfreundliche Einführung mit einigen Schimpfwörtern, wie man beginnt, seinen eigenen Blogbeitrag zu schreiben.",
  "<p>Talk a little bit about how one can become better (not master by any means, n.8C69E4E4A592E67958BE": "<p>Sprechen Sie ein wenig darüber, wie man besser werden kann (nicht unbedingt ein Meister, niemand ist perfekt) im Schreiben eines Blogbeitrags. Dies sind nur meine Gedanken, nachdem zwei großartige Leute aus der <a href=\"https://astro.build/chat\">Astro Community</a> (<a class=\"gh-badge\" href=\"https://github.com/jdtjenkins\"><img src=\"https://github.com/jdtjenkins.png\" alt=\"jdtjenkins\" />Jacob</a> und <a class=\"gh-badge\" href=\"https://github.com/louisescher\"><img src=\"https://github.com/louisescher.png\" alt=\"louisescher\" />Lou</a>) beschlossen haben, Blogs darüber zu schreiben, wie schwer und einfach es ist, Blogbeiträge zu schreiben.</p><p>Bitte lesen Sie zuerst ihre Beiträge, da dies die Fortsetzung beider ist:</p><ol><li><a href=\"https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/\">\"Warum ist es so schwer, Blogbeiträge zu schreiben?\" - Jacob Jenkins</a></li><li><a href=\"https://lou.gg/blog/why-writing-blogs-isnt-hard\">\"Warum Bloggen nicht schwer ist\" - Louis Escher</a></li><li><a href=\"/blog/writing-blogs-is-hard-and-easy/\">\"Einige Aspekte bei der Erstellung eines Blogs sind wirklich einfach, und einige sind extrem schwierig!\" - Felix Schneider</a></li></ol><p>Danach haben Sie diese großartige Trilogie von Blogbeiträgen über das Bloggen erfolgreich abgeschlossen.</p>",
  "After a very interesting discussion in the [Astro](https://github.com/withastro).48AFE0BF2E41079C33DD": "Nach einer sehr interessanten Diskussion im [Astro](https://github.com/withastro) [Discord](https://astro.build/chat) – gestartet von keinem Geringeren als dem Core-Maintainer [Alex](https://github.com/alexanderniebuhr) selbst (übrigens Glückwunsch zu diesem kürzlichen Erfolg 🎉) – witzelte ich herum, dass jemand einen Blog darüber schreiben könnte, warum es für viele Menschen so schwierig ist, nicht nur zu schreiben, sondern auch einen Blog als Ganzes zu pflegen.",
  "The man who nominated me as an Astro Support Squad - [Jacob](https://github.com/.47D0DB043E57D3E7660B": "Der Mann, der mich als Astro Support Squad nominierte – [Jacob](https://github.com/jdtjenkins) (übrigens vielen Dank, dass du mich in dieser großartigen Community bemerkt hast 😍) – nahm das ziemlich wörtlich und schrieb einen Blog darüber. Kein Witz. Schauen Sie sich das an: [https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/](https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/) Übrigens, das ist sein allererster Blog (und hoffentlich nicht sein letzter, denn ich habe seinen Stil wirklich genossen).",
  "Our beloved everywhere-helper, Blogger, Designer and StudioCMSer - [Lou](https:/.00B9B777867DC593B708": "Unser geliebter Allround-Helfer, Blogger, Designer und StudioCMSer – [Lou](https://github.com/louisescher/) (übrigens vielen Dank, dass du mir vorab ein paar Blog-Schreibtipps gegeben hast, damit ich mit mehr Selbstvertrauen schreiben kann 🤩) – sprang sofort auf diesen großartigen Hype-Train auf (wie Twitch-Nutzer es nennen würden) und veröffentlichte [seinen Folgebeitrag](https://lou.gg/blog/why-writing-blogs-isnt-hard) innerhalb von verdammten 12 Stunden!!! Glauben Sie mir, ich habe die Commits überprüft, Lou hat buchstäblich innerhalb von 4 Minuten zur 12-Stunden-Marke gepusht.",
  "As I will include many references to both of their blogs, it's best if you read .2E1FCF6AB78B43DC2069": "Da ich viele Verweise auf beide ihrer Blogs einfügen werde, ist es das Beste, wenn Sie zuerst ihre lesen. Und dann meinen. Oder vielleicht ist es besser, wenn Sie einfach ihre lesen; ich bin mir noch nicht sicher, wie sich meiner entwickeln wird.",
  "But what I can ~~say~~ write, is that mine will fully focus on just the writing .FC4D0CF3F6082890E1EC": "Aber was ich ~~sagen~~ schreiben kann, ist, dass sich mein Blog vollständig auf die Schreibfähigkeiten konzentrieren wird.",
  "How to setup a blog (technical challenges)": "Wie man einen Blog einrichtet (technische Herausforderungen)",
  "Whilst this blog doesn't focus on how to build a blog, deploy it and all this te.460F9C9970BD9D6ED53F": "Auch wenn sich dieser Blog nicht darauf konzentriert, wie man einen Blog baut, ihn bereitstellt und all diese technischen Dinge erledigt, möchte ich erwähnen, dass es jeder schaffen kann. Wie Lou sagte, kann man als technisch nicht versierte Person immer einfach ein Konto auf [Medium](https://medium.com/) oder ähnlichen Alternativen erstellen. Wenn Sie ein wenig Programmierkenntnisse haben, können Sie Ihrer Kreativität ein wenig mehr Raum geben, und dank des großartigen [Starlight Blog](https://starlight-blog-docs.vercel.app/) Projekts von [HiDeoo](https://github.com/HiDeoo) benötigen Sie nicht viel Wissen, um Ihre eigene Website bereitzustellen. Heutzutage, wo es auch PaaS (Platform as a Service)-Anbieter wie [Netlify](https://www.netlify.com/) gibt, die das Bereitstellen zu einem Klick-Abenteuer machen, gibt es keine Entschuldigung mehr dafür, dass technische Schwierigkeiten Sie daran hindern könnten, Ihren Blog zu veröffentlichen.",
  "Okay, jokes aside, now: Writing skills": "Okay, Scherz beiseite, nun: Schreibfähigkeiten",
  "But this blog should focus on mainly on the \"Writing Skill\" as I said, so let's .809BFECD79628A7D6401": "Aber dieser Blog sollte sich hauptsächlich auf die \"Schreibfähigkeit\" konzentrieren, wie ich sagte, also lassen Sie uns dort weitermachen. Da ich selbst anfangs Schwierigkeiten hatte, Blogs zu schreiben, stimme ich Jacob voll und ganz zu, dass der Einstieg schwer ist. Es ist nicht wie das Durchlesen der [Astro „Getting Started“-Anleitung](https://docs.astro.build/en/install-and-setup/), bei der Sie nur den Anweisungen folgen müssen und dann im Discord fragen, was ein `InvalidContentEntryDataError` bedeutet <sub>bitte verwenden Sie den `#support`-Thread, wenn Sie das tun 🫶</sub> ([Falls Sie sich immer noch wundern](https://docs.astro.build/en/reference/errors/invalid-content-entry-data-error/)).",
  "On the other hand, the goal seems so close and doable. Just write some words. Wh.D4B7EBAB98F3D78C25CA": "Auf der anderen Seite scheint das Ziel so nah und machbar. Einfach ein paar Wörter schreiben. Was ist so schwer daran, diese verdammten Wörter zu schreiben? Tatsächlich weiß ich es selbst nicht. Warum fragen Sie mich? Das Einzige, das mir geholfen hat, aus der Spirale \"Du-willst-schreiben-aber-jedes-Mal-wenn-du-den-blinkenden-Cursor-ansiehst-wird-dein-Gehirn-taub\" (lassen Sie uns das zum Hashtag der Woche machen) auszubrechen, war Lous Tipp, nicht so viel von sich selbst in seinen ersten Blog legen zu wollen. Warum wollen Sie einen perfekten Blog zu Beginn? Wegen Ihres Rufes? Damit die Leute nichts Falsches von Ihnen denken? Sich enttäuscht fühlen? Ehrlich gesagt: Das ist Blödsinn! Nicht nur, weil Ihr erster Blog höchstwahrscheinlich von niemandem gelesen wird (mit Ausnahme von Jacobs außergewöhnlichem Blog), sondern auch, weil Sie es sich nur schwerer machen. Meine persönliche mentale Mauer war, dass ich dachte, ich müsse mindestens 500 Wörter schreiben, um anzufangen. Aber wer sagt das? Um ehrlich zu sein, wenn ich jetzt zurückblicke, denke ich manchmal: \"Mann, es wäre so einzigartig und cool gewesen, wenn mein erster Blog wie ein regulärer Tweet gewesen wäre\", oder noch extremer: Ein. Wort. Niemand wird Sie davon abhalten, diesen Blog zu veröffentlichen:",
  "Hello 👋": "Hallo 👋",
  "(Sorry if I now took your awesome idea,\\\nand included your whole blog post in he.2C4E38E676160D62D299": "(Entschuldigung, falls ich Ihnen jetzt Ihre großartige Idee gestohlen habe,\\\nund Ihren gesamten Blogbeitrag hier aufgenommen habe\\\n– wow, das reimt sich sogar)",
  "See? I can do whatever I want, even being a fricking poet (typical German behavi.CA4561FAF77C16255B02": "Sehen Sie? Ich kann tun, was ich will, sogar ein verdammter Dichter sein (typisches deutsches Verhalten), und niemand wird mich verurteilen. Okay, vielleicht wird jemand diesen Blog hassen, weil er ein \"Zeitverschwendung, ohne Bedeutung in all diesem nutzlosen Inhalt\" ist, aber wen interessiert's? Es ist *Ihr* Blog, <span id=\"comment-reference\" class=\"fragment-highlight\">niemand fragt nach deren Meinungen (es sei denn, Sie haben eine Kommentarsektion unter Ihrem Blog 🙄 *hust* [Lou](https://lou.gg/blog/why-writing-blogs-isnt-hard#chapter-five-its-the-8th-of-july)</span>). Also denken Sie nicht darüber nach, was andere über Ihren Schreibstil, den Inhalt, die Sprache oder selbst über Ihre Grammatikfehler denken könnten. All diese Dinge machen Sie menschlich, und alles perfekt zu machen, ist nicht nur völlig unnötig, es ist auch [hcat](https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/#chapter-1---i-want-it-now).",
  "Another part of writing blogs is not just getting started, but the difficulty of.784B95527E097077F971": "Ein weiterer Teil des Blogschreibens ist nicht nur der Einstieg, sondern die Schwierigkeit, einen Fluss, eine Gedankenlinie zu bewahren, wenn Sie so wollen. Als Zuhörer gut geschriebener Reden bemerken Sie unbewusst, dass sie gut waren, erfüllend, erhaben. Und genau das liebe ich an solchen Blogs oder Reden. Sie fühlen sich einfach irgendwie richtig an. Aber ich selbst habe akzeptiert, dass ich solche Leistungen in meiner eigenen kreativen Arbeit nicht erreichen kann. Und mit dieser Akzeptanz geht es mir viel besser. Denn der Vorteil, Unvollkommenheit zu akzeptieren, ist, Dinge fertigzubringen. Nicht nur 50 %, nicht nur 90 %. Fertig. Abgeschlossen, 100 %. Und das ist etwas, womit viele Menschen Schwierigkeiten haben, mich selbst eingeschlossen – eigentlich nur mich selbst eingeschlossen.",
  "But as Lou mentions, there are other easy methods to keep a common thread in the.18BEED3C4E5876FC95F2": "Aber wie Lou sagt, gibt es andere einfache Methoden, einen roten Faden im gesamten Beitrag beizubehalten, an der Geschichte festzuhalten, während die Gedanken in Ihrem eigenen Gehirn herumschweifen könnten. All diese Gedanken auf Papier oder in diesem Fall auf die Tastatur zu bringen, kann herausfordernd sein, besonders wenn Sie gerade anfangen zu schreiben. Aber es gibt einen Grund, warum wir solche Fähigkeiten in der Schule lernen: Sie verbessern massiv unsere kognitive Gesundheit und Entwicklung. Das ist auch der Grund, warum ich Lou voll und ganz zustimme, wenn er sagt, dass KI niemals im Schreibprozess verwendet werden sollte. Es hat einfach keine Vorteile, weder für den Leser noch für Sie.",
  "So I don't want to repeat what Lou says, but bullet points have helped me out a .964F132C02AED6CE1634": "Ich möchte nicht wiederholen, was Lou sagt, aber Stichpunkte haben mir in der Vergangenheit sehr geholfen. Sie geben mir einfach das Gefühl von konstanter Struktur, während mein Geist mit unterschiedlichen Gedanken und Theorien spielen kann. Das stellt sicher, dass Sie immer wieder zu dem zurückkehren, was Sie ursprünglich in Ihrem Beitrag einfügen wollten. \"Und wenn Sie keine Stichpunkte finden können?\", könnten Sie fragen. Dann brauchen Sie vielleicht weitere Brainstormings oder einfach Duschen.",
  "In the end, these are some tips I can give you along the way:": "Am Ende sind dies einige Tipps, die ich Ihnen mit auf den Weg geben kann:",
  "Develop your own writing style, not by training, but just writing. Sooner or lat.F84CA1A98AD5E28A3F69": "Entwickle deinen eigenen Schreibstil, nicht durch Training, sondern einfach durchs Schreiben. Früher oder später wirst du bemerken, welche Arten dir gefallen könnten, einige Dinge, die du von anderen Bloggern übernehmen möchtest, aber summa summarum wird das, was du schreibst, immer deins sein. Du teilst es einfach mit der Welt. Es liegt an dir, ob du hier und da einen Doppelpunkt oder Bindestrich verwenden möchtest, mehr Punkte, die Vergangenheitsform, den Imperativ, Schimpfwörter oder den formelleren Stil. All diese Dinge fügen sich automatisch zusammen und definieren dich als einzigartigen Blogger. Und deine Leser werden diese Einzigartigkeit mehr schätzen, als du denkst.",
  "Don't take on too much. Might sound easy, but everyone falls regularly into this.F956D1FB960DB4CD026C": "Nimm dir nicht zu viel vor. Klingt vielleicht einfach, aber jeder tappt regelmäßig in diese Falle. Oder vielleicht nur Leute wie ich, mit einer Mischung aus Autismus und Perfektionismus – idk.",
  "Although it always sounds stupid: Start writing. And if it doesn't work, start w.0018355B94E38C7B923C": "Auch wenn es immer dumm klingt: Fang an zu schreiben. Und wenn es nicht funktioniert, fang mit dem Mittelteil an. Denn ich weiß, Anfang und Ende sind immer schwierig, aber meiner Meinung nach geht der Mittelteil wie Butter runter.",
  "Blogs have easy and hard sides: This is what the title says, but know that I wro.7F0E147D238C38B4B86A": "Blogs haben einfache und schwierige Seiten: Das sagt der Titel, aber wusstet ihr, dass ich geschrieben habe, ohne diese Frage überhaupt beantwortet zu haben... Gott sei Dank hat Jacob am Ende dieses Vorschlags kein Fragezeichen getippt. 🙏",
  "Yeah, I guess that's it. If you want to share you thoughts, leave them in [Lou's.D2EA8444C7BDC5361790": "Ja, ich denke, das war's. Wenn du deine Gedanken teilen möchtest, hinterlasse sie in [Lous Kommentaren](https://lou.gg/blog/why-writing-blogs-isnt-hard), denn ich habe keine.",
  "How I Built a GitHub Profile README That Shouldn’t Exist (But It Does)": "Wie ich ein GitHub-Profil-README erstellt habe, das nicht existieren sollte (es aber tut)",
  "A deep dive into the technical challenges and solutions behind my GitHub profile.8493E1B06B7E9BE16E95": "Ein tiefer Einblick in die technischen Herausforderungen und Lösungen hinter meinem GitHub-Profil-README mit SVG-Manipulation, Automatisierung und einem dynamischen Bento-Grid.",
  "Creating a standout <a class=\"gh-badge\" href=\"https://github.com/github\"><img sr.EC7EC3169C3D5076914B": "Ein auffälliges <a class=\"gh-badge\" href=\"https://github.com/github\"><img src=\"https://github.com/github.png\" alt=\"github\" />GitHub</a>-Profil-README zu erstellen, bedeutet nicht nur, ein paar Badges hinzuzufügen – es geht darum, technische Grenzen auszuloten. In diesem tiefgehenden Einblick untersuche ich niedrigstufige SVG-Manipulation, HTML-zu-SVG-Konvertierung, Inline-Animationen und vollständige Automatisierung mit GitHub Actions, um das zu erstellen, was ich für eines der technisch fortschrittlichsten GitHub-READMEs halte. Von einem dynamischen Bento-Grid, das sich alle 5 Minuten aktualisiert, bis hin zur Einbettung von Live-SVGs ohne externe Anfragen hat dieses Projekt mein Profil in eine lebendige, sich selbst aktualisierende Sammlung meiner Arbeit verwandelt. Möchten Sie wissen, wie ich das gemacht habe? Lass es uns aufschlüsseln. 🚀",
  "Read the more formal story [here](https://trueberryless.org/work/github-profile-.5BCD9DBA0F2103014075": "Lesen Sie hier die formellere Geschichte [hier](https://trueberryless.org/work/github-profile-readme/)",
  "The Beginning: A README That Looked Like a Wikipedia Dump": "Der Anfang: Ein README, das wie ein Wikipedia-Dump aussah",
  "Every great story starts with a problem, and mine was simple: my [GitHub profile.3713BD43F2A1A91BFB7E": "Jede großartige Geschichte beginnt mit einem Problem, und meines war einfach: Mein [GitHub-Profil](https://github.com/trueberryless)-README war ein komplettes Chaos. Es war lang. Es hatte zu viel Text. Es war überflutet mit Badges – so viele, dass es aussah, als würde ich jede mögliche Internet-Trophäe horten. Hackathons, GitHub-Beiträge, Astro, roadmap.sh – wenn es ein Badge gab, hatte ich es.",
  "At first, I thought this was fine. It showed everything about me, right? But one.117F546C86637DB0B6DF": "Am Anfang dachte ich, das sei in Ordnung. Es zeigte schließlich alles über mich, oder? Aber eines Tages sah ich es an und erkannte:",
  "This is not stylish. This is a cluttered disaster.": "Das ist nicht stilvoll. Das ist eine überladene Katastrophe.",
  "I needed something new. Something clean. Something visually striking. I wanted a.C82835C3D13A6981B63B": "Ich brauchte etwas Neues. Etwas Sauberes. Etwas Visuell Beeindruckendes. Ich wollte ein **Bento-Grid**, das die Leute dazu bringt, innezuhalten und es zu bewundern, statt verwirrt daran vorbeizuscrollen. Ein Design, so gut ausgeführt, dass jeder, der es sieht, sofort eines für sich selbst haben möchte.",
  "That was the dream. Now I just had to make it real.": "Das war der Traum. Jetzt musste ich ihn nur noch verwirklichen.",
  "Phase 1: The HTML Dream (and Markdown Nightmare)": "Phase 1: Der HTML-Traum (und Markdown-Albtraum)",
  "The first step was simple: mock up my perfect profile in HTML and CSS. And let m.EEFE6C2742301B518D46": "Der erste Schritt war einfach: mein perfektes Profil in HTML und CSS entwerfen. Und lassen Sie mich sagen, es sah fantastisch aus. Es hatte das perfekte Layout, geschmeidige Animationen und genau das richtige Gleichgewicht zwischen Inhalt und Raum. Dann traf mich die Realität. Das musste innerhalb von *GitHub-flavored Markdown* funktionieren. Kein Problem, oder? Markdown unterstützt HTML! Also kopierte ich mein wunderschönes HTML in mein README und klickte auf Speichern.",
  "[GitHub](https://github.com/github): *Absolutely not.*": "[GitHub](https://github.com/github): *Auf keinen Fall.*",
  "GitHub’s Markdown [strips out a not a huge number of HTML tags, but important on.8ADCE02DB7CC7739FAD2": "Markdown von GitHub [entfernt nicht eine riesige Anzahl von HTML-Tags, aber wichtige](https://github.github.com/gfm/#disallowed-raw-html-extension). Natürlich aus Sicherheitsgründen (und ich respektiere das völlig, GitHub, wirklich ❤️), aber das bedeutete, dass mein perfektes Design völlig **unbrauchbar** war.",
  "I tried tweaking it. Replacing unsupported tags with ones that worked. Maybe I c.14452FE82B6AC0DB8958": "Ich versuchte, daran zu feilen. Nicht unterstützte Tags mit solchen zu ersetzen, die funktionierten. Vielleicht könnte ich einige davon retten? *Nein.* Die Beschränkungen von Markdown machten mein Traumlayout unmöglich.",
  "Phase 2: The \"Just Use a Python Script\" Cope": "Phase 2: Das \"Einfach ein Python-Skript nutzen\"-Zuflucht",
  "When in doubt, automate. If I couldn’t get my HTML in directly, maybe I could ge.FD6C9ADF71816E0E5B49": "Wenn man zweifelt, automatisiere. Wenn ich mein HTML nicht direkt einfügen konnte, konnte ich vielleicht etwas Dynamisches mit einem Skript generieren? Also bastelte ich ein Python-Skript, das mein neuestes GitHub-Repository abruft und in mein README einfügt. Ich lasse nur diese zufälligen Bytes hier, die von einigen als Python-Code bezeichnet werden:",
  "This seemed like a step in the right direction. It was automated. It was functio.D20A833F97288BD3E73B": "Das schien ein Schritt in die richtige Richtung zu sein. Es war automatisiert. Es war funktional. Aber das löste mein eigentliches Problem nicht. 😢",
  "This wasn’t about dynamic content — it was about *design*. And no amount of Pyth.8C914CE49CA59FC373EC": "Es ging nicht um dynamischen Inhalt – es ging um *Design*. Und keine Menge an Python-Skripten würde Markdown schön machen.",
  "Phase 3: \"Fine, I'll Just Use a Screenshot\" (Rock Bottom)": "Phase 3: \"Okay, ich nehme einfach einen Screenshot\" (Tiefpunkt)",
  "At this point, I was desperate. I considered the unthinkable: *just take a scree.A573BC6FDCB7D404B86F": "An diesem Punkt war ich verzweifelt. Ich erwog das Unvorstellbare: *einfach einen Screenshot des HTMLs machen und ihn als Bild in mein README einfügen.* Es war ein Ansatz mit Gewalt. Es war faul. Es war... effektiv?",
  "For a moment, I actually thought about doing it. But I knew deep down that I wou.F11BA1015DB80A5D8D2D": "Für einen Moment dachte ich tatsächlich darüber nach, es zu tun. Aber ich wusste tief im Inneren, dass ich mir selbst niemals vergeben würde, wenn ich dies als meine endgültige Lösung akzeptieren würde.",
  "Just for the reference, I would have used [Puppeteer](https://www.npmjs.com/pack.7C033B35BC935C314B6E": "Nur der Vollständigkeit halber: Ich hätte [Puppeteer](https://www.npmjs.com/package/puppeteer) und [FFmpeg](https://www.ffmpeg.org/) verwendet – keine Ahnung, was diese Tools sind.",
  "Phase 4: Enter SVG (The Light at the End of the Tunnel)": "Phase 4: Der Einsatz von SVGs (Das Licht am Ende des Tunnels)",
  "I abandoned the cursed screenshot plan and looked for something more flexible.": "Ich gab den verfluchten Screenshot-Plan auf und suchte nach etwas Flexiblerem.",
  "SVGs.": "SVGs.",
  "SVGs could scale, they supported both text and images, and — most importantly — .F259141963EA4A11F694": "SVGs konnten skalieren, sie unterstützten sowohl Text als auch Bilder, und – am wichtigsten – sie konnten **HTML in ihnen einbetten**.",
  "So I tried something like this:": "Also versuchte ich etwas wie das hier:",
  "Promising! This could actually work!": "Vielversprechend! Das könnte tatsächlich funktionieren!",
  "Then I got busy with other things, forgot to debug it, and never returned to thi.9BEE5D08ED4C8C9B33DD": "Dann wurde ich mit anderen Dingen beschäftigt, vergaß, den Fehler zu beheben, und kehrte nie zu dieser Idee zurück.",
  "Phase 5: SVGs Within SVGs Within SVGs (Inception Level 100)": "Phase 5: SVGs in SVGs in SVGs (Inception-Level 100)",
  "When I came back to the project, I was **determined** to make it work.": "Als ich zum Projekt zurückkehrte, war ich entschlossen, es zum Laufen zu bringen.",
  "I realized that if I couldn’t directly embed HTML into Markdown, I could fake it.BBFCB5C084B31AC3AAAC": "Mir wurde klar, dass, wenn ich HTML nicht direkt in Markdown einbetten konnte, ich es vortäuschen könnte, indem ich verschachtelte SVGs benutze. (Übrigens ist dies massiv vereinfacht; der eigentliche Prozess dauerte Tage, die sich wie Wochen oder sogar Monate anfühlten, aber ich weiß, dass ihr das sowieso nicht alles lesen würdet, also egal.)",
  "And then, after hours of research, I stumbled across a life-changing Stack Overf.B19E66FB6CDC38EB7F45": "Und dann, nach stundenlanger Recherche, stieß ich auf eine lebensverändernde Stack Overflow-Antwort:",
  "This lead me to the current solution:": "Das führte mich zur aktuellen Lösung:",
  "Convert my HTML layout to SVG.": "Mein HTML-Layout in SVG umwandeln.",
  "Encode all images in **Base64** (because GitHub Markdown won’t load external ima.6BA37AFF26936D15AD36": "Alle Bilder in **Base64** codieren (da GitHub Markdown externe Bilder in einem SVG mit HTML darin nicht lädt).",
  "Inline dynamic SVGs (like my GitHub stats, Spotify status, etc.).": "Dynamische SVGs inline einfügen (wie meine GitHub-Statistiken, Spotify-Status usw.).",
  "Automate everything with **GitHub Actions**.": "Alles mit **GitHub Actions** automatisieren.",
  "The Grand Finale: The Ultimate GitHub Profile README": "Das große Finale: Das ultimative GitHub-Profil-README",
  "A sleek Bento Grid layout, perfectly structured in SVG.": "Ein elegantes Bento-Grid-Layout, perfekt in SVG strukturiert.",
  "A live-updating Spotify status, inlined as an SVG.": "Ein Live-aktualisierender Spotify-Status, als SVG eingebettet.",
  "GitHub stats, dynamically inserted via automation.": "GitHub-Statistiken, dynamisch per Automatisierung eingefügt.",
  "Fully responsive, fully scalable, and fully insane to build.": "Vollständig responsiv, vollständig skalierbar und vollständig wahnsinnig, es zu bauen.",
  "It updates itself every 5 minutes, runs completely on GitHub Actions, and doesn’.D6DD34ED3B85DAE2F120": "Es aktualisiert sich alle 5 Minuten, läuft vollständig auf GitHub Actions und ist nicht auf externe Dienste angewiesen. Es ist wunderschön. Es ist effizient. Und vor allem ist es technisch absurd – im besten Sinne.",
  "Take a look at a specific example of the final results at some point back in tim.096EC0AF4A7E3D30CE29": "Sehen Sie sich ein konkretes Beispiel aus der Vergangenheit für die Endergebnisse an.",
  "Isn't that bad compared to the [old README.md](https://github.com/trueberryless/.E3E5E0072DF705843179": "Das ist im Vergleich zum [alten README.md](https://github.com/trueberryless/trueberryless/blob/5dce4ad0033b00829f8ec3756827057017447a65/README.md) gar nicht so schlecht. Und kommentieren Sie nicht, warum ich K-Pop höre! Es ist besser, als Sie denken, glauben Sie mir.",
  "Check out the live version on my GitHub [trueberryless](https://github.com/trueb.4FFADA956CF12B9EFE9F": "Schauen Sie sich die Live-Version auf meinem GitHub an [trueberryless](https://github.com/trueberryless) – falls ich sie behalten habe... – und lassen Sie ein Follow da, wenn Sie schon dort sind, falls Ihnen das Lesen gefallen hat! ❤️",
  "Final Thoughts: Was It Worth It?": "Abschließende Gedanken: Hat es sich gelohnt?",
  "Absolutely.": "Absolut.",
  "This journey was frustrating, time-consuming, and filled with more roadblocks th.9E6BE12D4EDD580594EA": "Diese Reise war frustrierend, zeitaufwändig und voller mehr Hindernisse, als ich jemals erwartet hätte. Aber ich habe so viel über SVGs, Markdown-Beschränkungen, GitHub Actions und Automatisierung gelernt.",
  "Would I do it again? Definitely.": "Würde ich es wieder tun? Definitiv.",
  "Would I recommend it? Only if you have way too much patience. 😅": "Würde ich es empfehlen? Nur wenn Sie viel Geduld haben. 😅",
  "But in the end, I created a [GitHub](https://github.com/github) profile README t.2B7EC6933681A24E2F33": "Aber am Ende habe ich ein [GitHub](https://github.com/github)-Profil-README erstellt, das *nicht existieren sollte* — aber es tut es. Und ich liebe es.",
  "A short history of Starlight Sidebar Topics plugins": "Eine kurze Geschichte der Starlight Sidebar Topics Plugins",
  "In this blog post, I'll show you the evolution of Starlight plugins with a case .4AA6D9FADD1A6BE13985": "In diesem Blogbeitrag zeige ich Ihnen die Entwicklung der Starlight-Plugins anhand einer Fallstudie des Starlight Sidebar Topics Plugins.",
  "In this post, I'll show you the evolution of <a class=\"gh-badge\" href=\"https://g.995EB19ECCFE1867C83C": "In diesem Beitrag zeige ich Ihnen die Entwicklung von <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" />Starlight</a>-Plugins anhand einer Fallstudie des [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar-topics) Plugins. Bereiten Sie sich darauf vor, beeindruckende Fakten über Menschen und Code rund um Starlight zu entdecken.",
  "Maybe you have heard about this cool documentation framework before. I talk abou.5A104B8E7F80C4B25128": "Vielleicht haben Sie schon von diesem coolen Dokumentations-Framework gehört. Ich spreche oft darüber und nutze es regelmäßig. Nicht nur, weil ich ein aktiver Mitwirkender bin, sondern auch, weil [Starlight](https://starlight.astro.build) mir einfach ans Herz gewachsen ist. Seine Merkmale: Einfachheit und Minimalismus, aber alles, was man braucht. Seine Leistung: [Schneller als 98 % aller anderen Websites](https://www.websitecarbon.com/website/starlight-astro-build-getting-started/). Seine Barrierefreiheit: Keine Frage!",
  "The Creation": "Die Entstehung",
  "However, one thing that's objectively missing in my opinion is a granular way of.77A7287A955230B54D96": "Eine Sache, die meiner Meinung nach objektiv fehlt, ist eine granularere Möglichkeit, breite Themen innerhalb Ihrer Dokumentation zu trennen. Und ich bin nicht allein mit dieser subjektiv allgemein akzeptierten Meinung. [HiDeoo](https://github.com/HiDeoo) ist nicht nur einer der aktivsten Maintainer des Projekts, sondern auch der Autor der meisten und meiner Meinung nach besten Plugins, die man für Starlight finden kann. Und auch sie haben diese fehlende Nischenfunktionalität in Bezug auf Themen bemerkt. Aus diesem Grund haben sie sich entschieden, das [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar-topics) Plugin bereits im Oktober 2024 zu erstellen, mit dem man eine Seitenleiste mit Themen erstellen kann. Lesen Sie mehr über die Funktionen des Plugins in [seiner Dokumentation](https://starlight-sidebar-topics.netlify.app/).",
  "The one thing that bothered me personally in the early days of the plugin was th.6F5F49BB9B5B06675F60": "Die eine Sache, die mich in den frühen Tagen des Plugins persönlich störte, war die Art und Weise, wie Themen in der Seitenleiste angezeigt wurden. Denn es verwendet nicht - wie ich mir eine Lösung vorgestellt habe - eine Art Dropdown-Menü zum Wechseln zwischen Themen, sondern zeigt stattdessen immer alle Themen an. Diese Designentscheidung war, wie [HiDeoo es klar betont](https://github.com/HiDeoo/starlight-sidebar-topics/issues/2#issuecomment-2410196392), sehr bewusst und nicht ohne Grund: Alle Themen sollten auf einmal sichtbar sein. Bewiesen durch die [Astro](https://github.com/withastro)-Dokumentation selbst ([Chris Swithinbank](https://github.com/delucis) implementierte die [\"Tabbed Sidebar\"](https://github.com/withastro/docs/pull/9890) für die Astro v5-Dokumentation später im selben Monat), hat dieser Ansatz definitiv viele Vorteile gegenüber einem Dropdown-Menü. Trotzdem war ich immer noch unzufrieden mit diesem Design und erstellte deshalb meine eigene Version.",
  "Copying and pasting was my strength when it came to building a new Starlight plu.860638CCB2BA61F003E9": "Kopieren und Einfügen war meine Stärke, wenn es darum ging, ein neues Starlight-Plugin für die Community zu erstellen. Und so tat ich genau das. Ich nahm das Starlight Sidebar Topics Plugin als Ausgangspunkt und musste nur die Komponente `Topics.astro` anpassen, die das HTML für die Darstellung der Themen in der Seitenleiste umfasst. Nach einiger Zeit des Kampfes mit der Implementierung eines zufriedenstellenden Dropdown-Menüs, das reines HTML + CSS war, aber auch sauber aussah (entschuldigen Sie die Eigenlob, ich bin einfach stolz auf mich), fand ich schließlich eine Lösung, mit der ich sehr zufrieden bin, und veröffentlichte dieses neue Plugin unter dem Namen [Starlight Sidebar Topics Dropdown](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown) - wie originell.",
  "The Adaptation": "Die Anpassung",
  "You might think that this story is now over because everyone could just use the .B22BDA5C191E4AEC54CE": "Man könnte denken, dass diese Geschichte hier endet, weil jeder einfach die Variante verwenden könnte, die er möchte, und alle glücklich wären. Aber Starlight hat sich weiterentwickelt und verbessert sich ständig. Etwa drei Monate später, am 15. Februar, fast wie ein verspätetes [Geburtstagsgeschenk](https://trueberryless.org/work/20th-birthday/) für mich, kam die sehnlich erwartete Ergänzung von Routen-Daten in Starlight mit der Veröffentlichung von [v0.32](https://github.com/withastro/starlight/releases/tag/@astrojs/starlight@0.32.0). Diese scheinbar kleine Ergänzung eröffnete so viele Möglichkeiten, die ich selbst nie erwartet hätte. HiDeoo war einmal mehr die führende Inspiration für Plugin-Autoren und nutzte diese neue Funktionalität bis an ihre Grenzen aus. Es dauerte nur zwei Tage, bis sie [über 11 Plugins an die neueste Starlight-Version anpassten](https://bsky.app/profile/hideoo.dev/post/3liffpudc5c2b), und später verbesserten und überarbeiteten sie viel vom Code, um noch mehr aus diesem mächtigen Feature herauszuholen.",
  "And so comes the day when HiDeoo contacts me to tell me that the Starlight Sideb.CB4E9F542FB4DC96204E": "Und so kommt der Tag, an dem HiDeoo mich kontaktiert, um mir zu sagen, dass das Starlight Sidebar Topics Plugin nun Starlights neue Route-Datenfunktion nutzt. Zuerst verstand ich nicht ganz, welche Vorteile diese Implementierungsänderungen mit sich bringen würden, aber dann nahm sich HiDeoo die Zeit, mir zu erklären, dass ich nun das Starlight Sidebar Topics Dropdown Plugin in eine einfache Komponente umwandeln könnte, die die Route-Daten seines Plugins nutzt. Intuitiv war ich gegen diese clevere Idee, weil es sich anfühlte, als würde mein einziges Plugin, das ein wenig Popularität erlangt hatte, in eine nutzlose Komponente verwandelt. Ich hätte nicht falscher liegen können.",
  "The Union": "Die Vereinigung",
  "Eventually, I decided to refactor my plugin into a component - this refactoring .4324540ABE36305F27C5": "Schließlich entschied ich mich, mein Plugin in eine Komponente umzuwandeln - diese Umstrukturierung eliminierte beiläufig genau [1210 Codezeilen und fügte 68 Zeilen Changelog hinzu](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown/pull/40) - und ich bemerkte, wie wenig Code es jetzt benötigte, um aus der `Topics.astro`-Liste ein Dropdown zu machen, aus der Sicht eines Benutzers. Ich war überzeugt, dass dies wirklich die richtige Richtung für die ~~Plugin~~-Komponente war. Und so aktualisierte ich die gesamte Dokumentation - mehr wie: löschte über 200 Textzeilen (fühlt sich gut an) - und veröffentlichte die neue [Version 0.5](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown/releases/tag/starlight-sidebar-topics-dropdown%400.5.0).",
  "Now you might wonder how such mature plugins could still improve over time. To b.8F9AABD213A178EFB11C": "Nun fragen Sie sich vielleicht, wie solche ausgereiften Plugins sich noch weiter verbessern könnten. Um ehrlich zu sein, war ich selbst sehr überrascht, als HiDeoo ganz nebenbei eine Bombe in meine Discord-DMs fallen ließ. Seine Idee war und ist genial. Andernfalls würde ich mich gar nicht mehr mit diesem *Thema* beschäftigen. Aber hier bin ich, schreibe satte 800 Worte, nur um Sie auf das vorzubereiten, was kommt. Trommelwirbel, bitte! Schnallen Sie sich an! Diese Aussage von HiDeoo wird Sie umhauen:",
  "\"One could have something like the default built-in list on a desktop view, and .D9D8BC0B8C5FADE63015": "\"Man könnte so etwas wie die standardmäßige eingebaute Liste auf einer Desktop-Ansicht haben und auf Mobilgeräten Ihre Komponente verwenden, oder so etwas in der Art 🧠\" — HiDeoo, 21/03/2025 09:54",
  "Profound. Timeless. Golden.": "Tiefgründig. Zeitlos. Gold wert.",
  "And that single, beautiful spark of an idea? It’s precisely what I’ll guide you .D5B772B8E2ED479D7F54": "Und dieser einzige, wunderschöne Funke einer Idee? Genau darum wird es im Beitrag [„Starlight Topics Dropdown und Liste zusammen“](/blog/starlight-dropdown-and-list-together/) gehen.",
  "How to make your Starlight sidebar items look better": "Wie Sie Ihre Starlight-Sidebar-Elemente optisch verbessern",
  "In this blog post, we'll take a look at how small changes can make a big differe.0F8A5DB341E8924485CC": "In diesem Blogbeitrag werfen wir einen Blick darauf, wie kleine Änderungen bei Leerzeichen, Schriftgrößen, -gewichten und -farben in Ihrer Starlight-Sidebar einen großen Unterschied machen können.",
  "In this blog post, we'll take a look at how small changes can make a big differe.91CB4D1869F959776162": "In diesem Blogbeitrag werfen wir einen Blick darauf, wie kleine Änderungen bei Leerzeichen in Ihrer <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" />Starlight</a>-Sidebar einen großen Unterschied machen können.",
  "Have you ever wondered why your [Starlight][starlight] sidebar doesn't look that.D9C0942A7112C024E581": "Haben Sie sich jemals gefragt, warum Ihre [Starlight][starlight]-Sidebar nicht so ansprechend aussieht? Wussten Sie, wie wichtig der Abstand zwischen den Elementen in Ihrer Sidebar unbewusst ist? Die Schriftgröße, das Gewicht und kleine Farbunterschiede? In diesem Leitfaden zeigen wir Ihnen, wie Sie das Erscheinungsbild Ihrer Starlight-Sidebar mit einigen schnellen und einfachen Schritten anpassen können.",
  "Prerequisites": "Voraussetzungen",
  "First, you need to [set up your Starlight site][starlight-getting-started]. Afte.DF558576AB082588D034": "Zuerst müssen Sie Ihre [Starlight-Website einrichten][starlight-getting-started]. Danach bietet Starlight eine [Anleitung zur Anpassung von Stilen, die auf Ihre Starlight-Website angewendet werden][starlight-css], welche wir in diesem Beitrag verwenden werden.",
  "As described in [this guide][starlight-css-custom], you need to create a `.css` .0CD83940C89F2D1185A1": "Wie in [dieser Anleitung][starlight-css-custom] beschrieben, müssen Sie eine `.css`-Datei irgendwo in Ihrem `src/`-Verzeichnis erstellen, in der Sie Ihre CSS-Stile definieren können. Vergessen Sie nicht, den Pfad zu dieser `.css`-Datei im `customCss`-Array von Starlight’s `astro.config.mjs` hinzuzufügen:",
  "After completing these preparation steps, you are ready to try out some nice adj.DE7E5B1DE51E76B69982": "Nach Abschluss dieser Vorbereitungsschritte sind Sie bereit, einige schöne Anpassungen am Design der Starlight-Sidebar auszuprobieren.",
  "Customizations": "Anpassungen",
  "There are endless different possibilities that you can play around with just wit.315492DDFA6948DAD882": "Es gibt endlose verschiedene Möglichkeiten, die Sie allein mit Ihrem benutzerdefinierten CSS ausprobieren können. Ich gebe Ihnen einige Ideen, die ich selbst beim Experimentieren mit dem Sidebar-Design als sehr hilfreich empfand. Während einige dieser Ideen für Sie vielleicht albern wirken, verspreche ich Ihnen, dass die Kombination einiger von ihnen Ihre Starlight-Sidebar noch besser aussehen lassen wird.",
  "One thing to note though is that in this blog post the focus lies on adjusting t.157A7D5F675513D49CA2": "Ein Hinweis: In diesem Blogbeitrag liegt der Fokus auf der Anpassung des Stils von **Elementen auf der obersten Ebene** (denjenigen ohne Kinder) in der Sidebar.",
  "But before I do that, I'll show you how the default styling of the Starlight sid.935D4EBD7A75949003B6": "Bevor ich das jedoch mache, zeige ich Ihnen, wie das Standarddesign der Starlight-Sidebar derzeit aussieht:",
  "Manipulate the whitespaces between sidebar items": "Leerraum zwischen Sidebar-Elementen anpassen",
  "On the root level of your Starlight sidebar, there are two different types of el.44095ABCBC3AC9DE4022": "In der obersten Ebene Ihrer Starlight-Sidebar gibt es zwei verschiedene Arten von Elementen: **Seiten** und **Gruppen**. Während das Standarddesign ziemlich anständig ist, empfand ich die Leerzeichen – das ist der Rand zwischen Elementen, der selbst keinen Inhalt enthält – als etwas zu groß, besonders zwischen Elementen auf oberster Ebene. Mit diesem Beispiel für benutzerdefiniertes CSS unten habe ich den Rand zwischen Elementen auf oberster Ebene verkleinert, während der Rand zwischen Gruppen gleich blieb. Das wichtige CSS-Design ist im Codeblock hervorgehoben.",
  "Perhaps, this will not be as useful to you because you don't use root-level page.31533AC4A173BE6AA7E5": "Vielleicht wird dies für Sie nicht so nützlich sein, weil Sie keine Seiten auf oberster Ebene in Ihrer Sidebar verwenden, sodass dieser Effekt für Sie nicht sichtbar ist. Aber falls doch, probieren Sie es aus.",
  "Adjust the font weight of sidebar items": "Schriftgewicht der Sidebar-Elemente anpassen",
  "[Imho][imho] the one thing that triggers me the most about Starlight's root-leve.BC0D0A5B6F41C0B208BF": "[Meiner Meinung nach][imho] ist das, was mich am meisten an den Starlight-Elementen auf oberster Ebene in der Sidebar stört, ihre Fettigkeit. Das ist wahrscheinlich eine sehr subjektive Meinung, aber wenn Sie mich fragen, kann eine einzige Seite nicht so wichtig sein wie eine ganze Gruppe von Seiten in Ihrer Dokumentation. Daher habe ich das Schriftgewicht der Elemente auf oberster Ebene dünner gemacht, wie Sie im folgenden Codeblock sehen können.",
  "Adjust the color of sidebar items": "Farbe der Sidebar-Elemente anpassen",
  "A small but subtle change: I made unselected root-level items appear dimmer in t.487CF0E6076E81E13BB4": "Eine kleine, aber subtile Änderung: Ich habe die nicht ausgewählten Elemente auf oberster Ebene weniger auffällig dargestellt, wie Sie im folgenden Codeblock sehen können.",
  "If you choose to use this design as well, I recommend that you only apply the se.C425BF4402932D0E21FC": "Wenn Sie sich auch für dieses Design entscheiden, empfehle ich, dass Sie nur die zweite CSS-Anpassung anwenden, da die erste lediglich zeigt, wie Sie das Styling von ausgewählten Elementen auf oberster Ebene anpassen könnten – diese Regel gilt auch für die anderen Codeblöcke in diesem Blog, wenn sie als `default value` markiert sind.",
  "Adjust the font size of sidebar items": "Schriftgröße der Sidebar-Elemente anpassen",
  "Although I don't recommend it, you can also adjust the font size of sidebar item.5B666452173153740723": "Obwohl ich es nicht empfehle, können Sie auch die Schriftgröße der Sidebar-Elemente anpassen. In diesem Beispiel für benutzerdefiniertes CSS unten habe ich die Schriftgröße der Elemente auf oberster Ebene verkleinert.",
  "Recommendations": "Empfehlungen",
  "Summing everything up, I recommend that you apply some mix of the above customiz.01EDE8C6353CC9B29A42": "Zusammenfassend empfehle ich, eine Mischung aus den oben genannten Anpassungsoptionen anzuwenden, die Sie bequem in einer einzigen `.css`-Datei sehen können.",
  "Note that I also use [Cascade Layers][starlight-css-cascade-layers], supported s.26DC0EFB0948E47CFD73": "Beachten Sie, dass ich auch [Cascading Layers][starlight-css-cascade-layers] verwende, die seit [Starlight 0.34.0][starlight-0-34] unterstützt werden, und empfehle, sie zu verwenden, um die Reihenfolge festzulegen, in der CSS-Stile angewendet werden.",
  "How to create a horizontal progress indicator for your Starlight site": "Wie Sie einen horizontalen Fortschrittsanzeiger für Ihre Starlight-Seite erstellen",
  "Learn how to create a horizontal progress indicator for your Starlight site.": "Erfahren Sie, wie Sie einen horizontalen Fortschrittsanzeiger für Ihre Starlight-Seite erstellen.",
  "Learn how to create a horizontal progress indicator for your <a class=\"gh-badge\".E525FE811A5499114EFE": "Erfahren Sie, wie Sie einen horizontalen Fortschrittsanzeiger für Ihre <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" />Starlight</a>-Seite erstellen.",
  "In this post, we would like to show you how [FrostyBee](https://github.com/frost.E8FB1C6C96EF64C97121": "In diesem Beitrag möchten wir Ihnen zeigen, wie [FrostyBee](https://github.com/frostybee) einen einfachen horizontalen Fortschrittsanzeiger für Starlight-Seiten erstellt hat.",
  "You will need to have an existing Starlight website.": "Sie benötigen eine bestehende Starlight-Website.",
  "Create the progress indicator component": "Erstellen Sie die Fortschrittsanzeiger-Komponente",
  "Let's create a new component called `ProgressIndicator.astro` in the `src/compon.3AF2A56DBB850F8660D1": "Lassen Sie uns eine neue Komponente namens `ProgressIndicator.astro` im Verzeichnis `src/components/` erstellen. Diese Komponente ist für die Darstellung des Fortschrittsanzeigers verantwortlich.",
  "We create a container which spans across the whole width with the progress bar `.BF53914FAF1D12F4D39C": "Wir erstellen einen Container, der die gesamte Breite einnimmt, mit der Fortschrittsleiste `<div>` darin. Die Breite des inneren `<div>` wird aktualisiert, wann immer der Benutzer scrollt (und wenn die Seite lädt), um die aktuelle Scroll-Position widerzuspiegeln.",
  "In the hidden lines is the styling which makes sure that the progress bar looks .D3205B85D528FA0A2D8A": "In den ausgeblendeten Zeilen befindet sich das Styling, das sicherstellt, dass die Fortschrittsleiste wie eine typische Fortschrittsleiste aussieht. Sie ist auch an Starlight angepasst, da die Leiste automatisch ausgeblendet wird, wenn die Website keine Seitenleiste und Inhaltsübersicht hat, aber ein Hero-Element wie die meisten Landingpages besitzt.",
  "One thing to point out is what the global CSS (line 45) does: It pushes the mobi.9D93B4CCEB69834E52E2": "Ein wichtiger Punkt ist, was das globale CSS (Zeile 45) bewirkt: Es schiebt das Dropdown-Menü der mobilen Inhaltsübersicht nach unten, um mehr Leerraum für die Fortschrittsleiste zu schaffen. Dies ist eine persönliche Präferenz, und Sie können es entfernen, wenn Sie möchten.",
  "Starlight Override": "Starlight-Override",
  "Now we can use this component in a [Starlight override](https://starlight.astro..BD7A14DF6609C76376D6": "Nun können wir diese Komponente in einem [Starlight-Override](https://starlight.astro.build/guides/overriding-components/) verwenden. In diesem Fall ergibt es Sinn, die [`Header.astro`-Komponente](https://starlight.astro.build/reference/overrides/#header-1) wie folgt zu überschreiben:",
  "Do not forget to add this component override to your `astro.config.mjs` file:": "Vergessen Sie nicht, diesen Komponenten-Override in Ihrer `astro.config.mjs`-Datei hinzuzufügen:",
  "Source Code": "Quellcode",
  "You can find the whole project code on [GitHub](https://github.com/trueberryless.F650372F9DC07B1F43E8": "Den gesamten Projektcode finden Sie auf [GitHub](https://github.com/trueberryless/starlight-progress-indicator) und in diesem [Stackblitz-Beispiel](https://stackblitz.com/github/trueberryless/starlight-progress-indicator?file=src%2Fcomponents%2FProgressIndicator.astro).",
  "Conclusion": "Fazit",
  "With this setup, the progress indicator will be displayed on every page (except .14DF840C82B37252652E": "Mit dieser Konfiguration wird der Fortschrittsanzeiger auf jeder Seite (außer Landingpages) Ihrer Starlight-Seite angezeigt. 🥳",
  "Starlight Topics Dropdown and List together": "Starlight-Themen Dropdown und Liste zusammen",
  "Learn how to combine a desktop list and mobile dropdown for your Starlight sideb.E44A5587DB1652DE8801": "Erfahren Sie, wie Sie eine Desktop-Liste und ein mobiles Dropdown-Menü für Ihre Starlight-Sidebar-Themen kombinieren.",
  "Combine two <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><i.F2B401A419A027863D20": "Kombinieren Sie zwei <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" />Starlight</a>-Sidebar-Topics-Plugins, um eine Liste von Themen auf dem Desktop und ein Dropdown-Menü in der mobilen Sidebar anzuzeigen.",
  "Using the [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar.7183C62B96DBF9A43128": "Durch die Verwendung des [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar-topics)-Plugins zusammen mit der [Starlight Sidebar Topics Dropdown](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown)-Komponente können Sie eine Website erstellen, die auf dem Desktop eine Themenliste und im mobilen Bereich ein Dropdown-Menü anzeigt.",
  "Install the packages": "Installieren Sie die Pakete",
  "First, install the `starlight-sidebar-topics` plugin and also the `starlight-sid.6A32241A1C081FF4DD1C": "Zuerst installieren Sie das Plugin `starlight-sidebar-topics` und die Komponente `starlight-sidebar-topics-dropdown`:",
  "Afterwards, follow the setup guides from [Starlight Sidebar Topics](https://star.754B56EA2499006C8169": "Anschließend folgen Sie den Setup-Anleitungen von [Starlight Sidebar Topics](https://starlight-sidebar-topics.netlify.app/docs/getting-started/#installation) und [Starlight Sidebar Topics Dropdown](https://starlight-sidebar-topics-dropdown.trueberryless.org/docs/getting-started/#installation).",
  "Modify the Sidebar component": "Ändern Sie die Sidebar-Komponente",
  "In the setup guide from the dropdown component, you have created a sidebar compo.BD6B58F9BEEFEE582749": "In der Setup-Anleitung der Dropdown-Komponente haben Sie eine Sidebar-Komponente erstellt, die nur das Dropdown-Menü rendert. Jetzt müssen Sie diese Komponente so ändern, dass sie auch die standardmäßige Sidebar rendert, wenn der Benutzer einen Desktop verwendet.",
  "Result": "Ergebnis",
  "If you follow these steps, your sidebar will look like this:": "Wenn Sie diese Schritte befolgen, sieht Ihre Sidebar folgendermaßen aus:",
  "You can find the complete source code of this guide in this [StackBlitz example].B731F1E66F12B002F90D": "Sie finden den vollständigen Quellcode dieses Guides in diesem [StackBlitz-Beispiel](https://stackblitz.com/edit/withastro-starlight-qgraahmp?file=astro.config.mjs).",
  "Endless possibilities": "Unendliche Möglichkeiten",
  "You could also do it the other way around (list on mobile, dropdown on desktop) .6BA6A2F32E24F0FB3A00": "Sie könnten es auch umgekehrt machen (Liste auf Mobilgeräten, Dropdown auf Desktops), indem Sie die Eigenschaften `display: block` und `display: none` im CSS vertauschen.",
  "Moreover, you could also create your own display component, which uses the route.40B5CA2AA37239989091": "Außerdem könnten Sie auch Ihre eigene Anzeige-Komponente erstellen, die die Routendaten aus dem Starlight Sidebar Topics-Plugin verwendet und die Themen auf eine benutzerdefinierte Weise rendert. Dies ist etwas fortgeschrittener, aber Sie finden weitere Informationen dazu in der Dokumentation [\"Benutzerdefinierte Themenliste\"](https://starlight-sidebar-topics.netlify.app/docs/guides/custom-topic-list/).",
  "Setting up Kubernetes with Cilium and Cloudflare": "Einrichtung von Kubernetes mit Cilium und Cloudflare",
  "Today we'll take a look at how to set up a Kubernetes cluster with K3s and Ciliu.651207C3314901C11632": "Heute werfen wir einen Blick darauf, wie ein Kubernetes-Cluster mit K3s und Cilium eingerichtet wird.",
  "This blog posts describes the process of setting up a <a class=\"gh-badge\" href=\".E82478488BD3E7D9E2C2": "Dieser Blogbeitrag beschreibt den Prozess der Einrichtung eines <a class=\"gh-badge\" href=\"https://github.com/kubernetes\"><img src=\"https://github.com/kubernetes.png\" alt=\"Kubernetes\" />Kubernetes</a>-Clusters mit <a class=\"gh-badge\" href=\"https://github.com/k3s-io\"><img src=\"https://github.com/k3s-io.png\" alt=\"k3s\" />k3s</a> und <a class=\"gh-badge\" href=\"https://github.com/cilium\"><img src=\"https://github.com/cilium.png\" alt=\"Cilium\" />Cilium</a>. Wir verwenden <a class=\"gh-badge\" href=\"https://github.com/helm\"><img src=\"https://github.com/helm.png\" alt=\"Helm\" />Helm</a> als Paketmanager und <a class=\"gh-badge\" href=\"https://github.com/cloudflare\"><img src=\"https://github.com/cloudflare.png\" alt=\"Cloudflare\" />Cloudflare</a> als Zertifikatsanbieter. Wir haben die Tipps und Tricks von Vegard S. Hagen aus [seinem Artikel](https://blog.stonegarden.dev/articles/2024/02/bootstrapping-k3s-with-cilium/) genutzt. Im Wesentlichen erklärt dieser Blog, wie alle trueberryless.org-Websites bereitgestellt werden (nicht mehr aktuell).",
  "Working with [Docker](https://github.com/docker) Containers can be hard. However.1CC6942704DAE062A463": "Die Arbeit mit [Docker](https://github.com/docker)-Containern kann schwierig sein. Es gibt jedoch Tools, die das Management von Containern verbessern, wie z.B. [Kubernetes](https://github.com/kubernetes). Tatsächlich ist Kubernetes das einzige mir bekannte Tool, das als Verwaltungssoftware für Docker-Container fungiert. Kubernetes ist in fast allen Cloud-Anbietern, wie Google Cloud, Azure und AWS, gut integriert. Dadurch bietet es eine standardisierte `yaml`-Syntax, die für kleine Entwickler großartig ist, da sie mit geringem Aufwand zwischen den `Big Three` wechseln können.",
  "tl;dr": "tl;dr",
  "Install everything and then apply cert-manager. ez": "Installieren Sie alles und wenden Sie dann den Cert-Manager an. Einfach.",
  "Install k3s": "Installiere k3s",
  "As Hagen explains in [his article](https://blog.stonegarden.dev/articles/2024/02.D5EDD5BC9C49780444EF": "Wie Hagen in [seinem Artikel](https://blog.stonegarden.dev/articles/2024/02/bootstrapping-k3s-with-cilium/) erklärt, wollen wir `k3s` ohne Konfigurationen und mit deaktivierten Komponenten installieren. Er beschreibt im Detail, welche Komponenten nicht installiert werden.",
  "After the installation, there should be some pods running (3). Don't be shocked .56BB9C3C1CCEDAFADEDB": "Nach der Installation sollten einige Pods laufen (3). Erschrecken Sie nicht, wenn sich die Pods im Zustand `ContainerCreating` oder `Pending` befinden. Dies liegt daran, dass die Pods nicht miteinander kommunizieren können, da wir das CNI (`--flannel-backend=none`) deaktiviert haben. Später werden wir [Cilium](https://github.com/cilium) installieren, das das Flannel-CNI ersetzen wird.",
  "Install Helm": "Installiere Helm",
  "Helm is the package manager for [Kubernetes](https://github.com/kubernetes), so .B3313537E64D4FFE6667": "Helm ist der Paketmanager für [Kubernetes](https://github.com/kubernetes), daher sollten Sie es entweder direkt installieren (folgen Sie den [Helm-Dokumentationen](https://helm.sh/docs/intro/install/)) oder Teile von Helm verwenden, die mit Cilium geliefert werden. Wir haben uns entschieden, Helm direkt zu installieren, was mit diesem Befehl problemlos möglich ist:",
  "Install Cilium": "Installiere Cilium",
  "[Cilium](https://github.com/cilium) is a networking and security software for Ku.F7DC9A96105A082EC9DB": "[Cilium](https://github.com/cilium) ist eine Netzwerk- und Sicherheitssoftware für Kubernetes. Cilium ist sehr schnell, skalierbar und sicher, da es auf eBPF basiert — eine revolutionäre Technologie, die sandboxed Programme im Linux-Kernel ausführen kann, ohne den Kernel neu zu kompilieren oder Kernel-Module zu laden.",
  "We could install Cilium with Helm like shown here:": "Wir könnten Cilium mit Helm wie hier gezeigt installieren:",
  "However, we wanted to install with their CLI and this is how you can do it. Firs.551EA48947BA4759E483": "Wir wollten jedoch die Installation mit ihrem CLI durchführen, und so geht es. Installieren Sie zunächst das Cilium-CLI, indem Sie diesen Code-Schnipsel ausführen:",
  "Then you can install Cilium with your Server IP-Address:": "Dann können Sie Cilium mit Ihrer Server-IP-Adresse installieren:",
  "Now we wait until Cilium says, everything is `OK` or `disabled`:": "Jetzt warten wir, bis Cilium meldet, dass alles `OK` oder `disabled` ist:",
  "After a while, all pods should be `Running`.": "Nach einer Weile sollten alle Pods den Status `Running` haben.",
  "Last but not least, you can apply some resources for Cilium:": "Zu guter Letzt können Sie einige Ressourcen für Cilium anwenden:",
  "Additionally you should upgrade the cilium config. In order to do that with the .B2C737654644F532072A": "Außerdem sollten Sie die Cilium-Konfiguration aktualisieren. Um dies mit den richtigen Werten zu tun, erstellen Sie zunächst diese Datei im Root-Verzeichnis, in dem Sie den k3s-Cluster verwalten möchten. Später könnten Sie auch einige hubble- und prometheus-bezogene Eigenschaften anwenden, wenn Sie [Grafana](https://github.com/Grafana) oder ähnliches verwenden wollen (öffnen Sie die ausgeblendeten Zeilen, wenn Sie unsere Konfiguration ebenfalls verwenden möchten).",
  "Run this command to upgrade:": "Führen Sie diesen Befehl aus, um ein Upgrade durchzuführen:",
  "Setup Certificate Manager with Cloudflare": "Richte den Zertifikatsmanager mit Cloudflare ein",
  "In order to be able to create certificates for each subdomain, it is important t.412EB3BCACB9EA434592": "Um Zertifikate für jede Subdomain erstellen zu können, ist es wichtig, einen Zertifikatsanbieter anzuwenden, der Zertifikatsanfragen bearbeitet und diese bei einem Anbieter auflöst. Wir haben [Cloudflare](https://github.com/cloudflare) als unseren Anbieter gewählt, und hier ist die Konfiguration, die Sie auf Ihren Kubernetes-Cluster anwenden müssen. Weitere Informationen finden Sie in den [Dokumentationen zum Cert-Manager](https://cert-manager.io/docs/configuration/acme/dns01/cloudflare/).",
  "But first, we need to install the cert-manager by running the following command:.2C3AE967A1D1E33B0CFD": "Aber zuerst müssen wir den cert-manager installieren, indem wir den folgenden Befehl ausführen:",
  "You can apply a file to the [Kubernetes](https://github.com/kubernetes) cluster,.7C198D3247CB04A61DD9": "Sie können eine Datei auf den [Kubernetes](https://github.com/kubernetes)-Cluster anwenden, indem Sie diesen k8s- (oder k3s-)Befehl ausführen:",
  "If you want to delete the resource in the Kubernetes cluster, the command is pre.13785BDE8535FD743BB9": "Wenn Sie die Ressource im Kubernetes-Cluster löschen möchten, ist der Befehl ziemlich einfach:",
  "As you may have spotted above, we also need a secret for the API token which aut.EED50E553247233483D4": "Wie Sie oben vielleicht bemerkt haben, benötigen wir auch ein Geheimnis für das API-Token, das authentifiziert, dass dieser Aussteller berechtigt ist, Zertifikate anzufordern. Daher erstellen wir ein Geheimnis mit einem unverschlüsselten `API Token` von Cloudflare.",
  "Nowadays we create a token by going to your [Cloudflare](https://github.com/clou.29311654A42391586C43": "Heutzutage erstellen wir ein Token, indem wir zum [Cloudflare](https://github.com/cloudflare)-Dashboard gehen, dann auf Ihr Profil klicken und die Registerkarte `API Tokens` auswählen. Hier können Sie ein spezifisches Token für Ihren Aussteller generieren oder den globalen API-Schlüssel verwenden (nicht mehr empfohlen). Die empfohlene Lösung ist, ein API-Token mit zwei Berechtigungen (benutzerdefiniertes Token) zu erstellen:",
  "Zone - DNS - Edit": "Zone - DNS - Bearbeiten",
  "Zone - Zone - Read": "Zone - Zone - Lesen",
  "A more detailed description about the tokens, can be found in the [Cloudflare do.1F2C806B3988F77EF2CC": "Eine detailliertere Beschreibung der Tokens finden Sie in den [Cloudflare-Dokumenten](https://developers.cloudflare.com/fundamentals/api/get-started/create-token/).",
  "After applying this secret to Kubernetes, the issuer should be ready to resolve .6908E4EC999AC0DCA147": "Nach der Anwendung dieses Geheimnisses auf Kubernetes sollte der Aussteller bereit sein, ein paar unerwünschte Anfragen zu lösen!",
  "You can now use this issuer by applying this file which will hopefully create a .7987E8195B3DBB4AB6A9": "Sie können diesen Aussteller nun verwenden, indem Sie diese Datei anwenden, die hoffentlich ein Zertifikat erstellt:",
  "It usually takes around 90 seconds to authenticate the request once applied. You.523D684039CD86DF5B8E": "In der Regel dauert es etwa 90 Sekunden, bis der Antrag nach der Anwendung authentifiziert ist. Sie können den aktuellen Status der Anfrage überprüfen, indem Sie diesen Kubernetes-Befehl ausführen. Falls es länger als 2 Minuten dauert, können möglicherweise einige Tipps unter [#Fehlerbehebung](#no-cloudflare-certificate-approval) helfen.",
  "The `-n` option stands for namespace.": "Die Option `-n` steht für Namespace.",
  "## Example app [`mutanuq`](https://mutanuq.trueberryless.org)": "Beispiel-Anwendung [`mutanuq`](https://mutanuq.trueberryless.org)",
  "Then you can use this certificate in your Ingress controller:": "Dann können Sie dieses Zertifikat in Ihrem Ingress-Controller verwenden:",
  "Setup Keel": "Keel einrichten",
  "We always wanted a clean Continuous Integration (CI) and Continuous Delivery (CD.5A7C877EE9C3CC7E2E7A": "Wir wollten schon immer eine saubere Continuous Integration (CI)- und Continuous Delivery (CD)-Lösung für unsere Websites. Das bedeutet, dass eine bestimmte Commit-Nachricht einen automatisierten Prozess über [GitHub](https://github.com/github), Docker Hub und unseren Server auslösen sollte, der am Ende die entsprechende Website nach etwa zwei Minuten aktualisiert.",
  "Keel is a robust software tool which enables this feature for Kubernetes. We use.782AFBD621B2DB555C2D": "Keel ist ein robustes Software-Tool, das diese Funktion für Kubernetes ermöglicht. Wir haben Keel verwendet, um neue Docker-Images von Docker Hub abzufragen und diese alle paar Minuten zu aktualisieren. Außerdem bietet Keel ein schönes Dashboard, mit dem Sie die Abfragen steuern können.",
  "In order to set up Keel with the admin dashboard, we created those files:": "Um Keel mit dem Admin-Dashboard einzurichten, haben wir diese Dateien erstellt:",
  "`secret-dashboard.yaml` for the Admin Username and Password (not everyone should.BC266314D27DCB36F4CB": "`secret-dashboard.yaml` für den Admin-Benutzernamen und das Passwort (nicht jeder sollte Zugriff auf das Dashboard haben)",
  "`keel.yaml` for the actual k3s configs (copied and adapted from [KeelHQ](https:/.F8A38C5FC9A4505AF62C": "`keel.yaml` für die eigentlichen k3s-Konfigurationen (kopiert und angepasst von [KeelHQ](https://github.com/keel-hq/keel/blob/9f0a7160bbdc3a107ad148933a4269f30e4e479c/deployment/deployment-template.yaml))",
  "After applying both files and managing the additional certificate for `keel.true.30388E288EFFF1AD00F9": "Nach der Anwendung beider Dateien und der Verwaltung des zusätzlichen Zertifikats für `keel.trueberryless.org` funktioniert das Keel-Dashboard perfekt. Außerdem kann jede Kubernetes `Deployment`-Ressource durch Setzen einiger Annotationen für automatisiertes Docker-Hub-Polling aktiviert werden:",
  "Celebrate with a Coffee!": "Mit einem Kaffee feiern!",
  "Congratulations, you've successfully set up [Kubernetes](https://github.com/kube.C26D3423275F0054D782": "Herzlichen Glückwunsch, Sie haben erfolgreich [Kubernetes](https://github.com/kubernetes) mit [Cilium](https://github.com/cilium) und [Cloudflare](https://github.com/cloudflare) eingerichtet! Sie haben sich eine Kaffeepause verdient. Genießen Sie eine wohlverdiente Tasse, und wenn Sie gerne einen virtuellen Kaffee mit mir teilen möchten, unterstützen Sie mich gerne auf [Ko-fi](https://ko-fi.com/trueberryless). Vielen Dank!",
  "Troubleshooting": "Fehlerbehebung",
  "Cilium-ingress has no External-IP": "Cilium-Ingress hat keine External-IP",
  "Make sure that the `ip-pool` includes the address specified by the annotations i.4E44377E5C9AC3845ED3": "Stellen Sie sicher, dass der `ip-pool` die Adresse enthält, die in den Anmerkungen der Datei `config.yaml` angegeben ist.",
  "Also in some cases, other ingress controllers get the annotated address before t.16FB14B27C64B47E0869": "In einigen Fällen erhalten andere Ingress-Controller die annotierte Adresse, bevor der Cilium-IC darauf zugreifen kann, sodass sie weiterhin im Wartezustand bleibt...",
  "If you don't deploy locally but on one of `The Big Three`, please check out some.4CF2A8E1AE1127E8E9D5": "Wenn Sie nicht lokal, sondern auf einer der \"Großen Drei\" bereitstellen, prüfen Sie bitte andere Dokumentationen, warum die External-IP noch aussteht. Es ist hauptsächlich deren Verpflichtung, Ihnen eine Adresse bereitzustellen.",
  "No Cloudflare Certificate Approval": "Keine Cloudflare-Zertifikatsgenehmigung",
  "There can be some problem when the certificate won't get approved by Cloudflare..21242D4E500A87FE26A2": "Es kann ein Problem auftreten, wenn das Zertifikat von Cloudflare nicht genehmigt wird.",
  "Wrong API token": "Falscher API-Token",
  "First make sure that the Cloudflare API token is correct. To make 100 percent su.BE3E293E05F70A765669": "Stellen Sie zunächst sicher, dass der Cloudflare-API-Token korrekt ist. Um 100-prozentige Sicherheit zu haben, erstellen Sie einen neuen und legen Sie ihn (nicht Base64-kodiert) in dieser Datei ab:",
  "Max auth failures reached": "Maximale Authentifizierungsfehler erreicht",
  "We once ran into the error `Error: 9109: Max auth failures reached, please check.661EAA2B42757CBB4C1D": "Wir sind einmal auf den Fehler `Error: 9109: Max auth failures reached, please check your Authorization header.` gestoßen. Warten Sie einfach ein paar Stunden, löschen Sie die Ressource und wenden Sie sie erneut an:",
  "Hopefully, you're now good to go!": "Hoffentlich ist jetzt alles in Ordnung!",
  "Setting up Continuous deployment in a GitHub repository": "Einrichten von Continuous Deployment in einem GitHub-Repository",
  "Today we'll take a look at how to set up a GitHub repository which will be deplo.210AF277FD26683FD09E": "Heute schauen wir uns an, wie man ein GitHub-Repository einrichtet, das über Argo CD in einem k3s-Cluster bereitgestellt wird.",
  "Today we'll take a look at how to set up a <a class=\"gh-badge\" href=\"https://git.A040D5A396CEA3FE8E47": "Heute schauen wir uns an, wie man ein <a class=\"gh-badge\" href=\"https://github.com/github\"><img src=\"https://github.com/github.png\" alt=\"github\" />GitHub</a>-Repository einrichtet, das über Argo CD in einem k3s-Cluster bereitgestellt wird. Zusammenfassend wird der Artikel Workflow-Dateien, Dockerfile, Manifeste (Deployment) und <a class=\"gh-badge\" href=\"https://github.com/docker\"><img src=\"https://github.com/docker.png\" alt=\"Docker Hub\" />Docker Hub</a>-Repositories umfassen. Bitte schauen Sie sich auch unseren [Argo CD Blog](./setup-argocd-for-kubernetes) an, da dies eine Fortsetzung des anderen Beitrags ist.",
  "In today's post, we'll take a quick look at how to set up continuous deployment .837E00D0E73247CB97BC": "In diesem Beitrag werfen wir einen kurzen Blick darauf, wie man Continuous Deployment in einem [GitHub](https://github.com/github)-Repository einrichtet. Wir sind uns ziemlich sicher, dass diese Einrichtung auch für andere Git-Registries funktioniert. Falls Sie jedoch eine andere verwenden, beachten Sie, dass dieser Beitrag speziell für GitHub konzipiert ist.",
  "This post also assumes that you use [GitHub](https://github.com/github) Actions .5387D30E9AFCFCF33E71": "Dieser Beitrag geht außerdem davon aus, dass Sie [GitHub](https://github.com/github) Actions in Kombination mit Argo CD zur Bereitstellung Ihrer Anwendungen auf einem Kubernetes-Cluster verwenden. Weitere Anleitungen zur Einrichtung beider Technologien auf Ihrem persönlichen Server finden Sie in unseren anderen [Deployment-Beiträgen](/blog/tags/deployment).",
  "Preparations": "Vorbereitungen",
  "We recommend creating a [Docker Hub](https://hub.docker.com/) account or choose .D653C06B296243188634": "Wir empfehlen, ein [Docker Hub](https://hub.docker.com/)-Konto zu erstellen oder, falls bevorzugt, ein anderes Docker-Registry zu verwenden.",
  "Your GitHub repository must fulfil these conditions:": "Ihr GitHub-Repository muss folgende Bedingungen erfüllen:",
  "Has a Dockerfile (ideally in the root folder)": "An einem Dockerfile vorhanden (idealerweise im Root-Ordner)",
  "Has two GitHub Secrets ([create GitHub Secret](https://docs.github.com/en/action.5E18F567EA5B8452C4B3": "Zwei GitHub Secrets besitzen ([GitHub Secret erstellen](https://docs.github.com/en/actions/security-guides/using-secrets-in-github-actions#creating-secrets-for-a-repository)):",
  "DOCKER_USERNAME: Your docker username": "DOCKER\\_USERNAME: Ihr Docker-Benutzername",
  "DOCKER\\_PASSWORD: Your docker password (or [access token](https://docs.docker.co.09AD66E199369AC9AC74": "DOCKER\\_PASSWORD: Ihr Docker-Passwort (oder [Access Token](https://docs.docker.com/security/for-developers/access-tokens/))",
  "Create workflow file(s)": "Workflow-Datei(en) erstellen",
  "GitHub Actions are special jobs in GitHub which mostly run on Linux servers and .E52CA8DEA2F2414C53E4": "GitHub Actions sind spezielle Jobs in GitHub, die meist auf Linux-Servern laufen und durch das Erstellen von `yaml`-Dateien im Verzeichnis `.github/workflows` gesteuert werden können. Diese speziellen Dateien legen fest, nach welchen Ereignissen die Jobs ausgeführt werden sollen, und bieten viel Freiheit. Als regelmäßiger GitHub-Action-Nutzer kann ich Ihnen sagen: Sie werden oft Ihre `yaml`-Dateien umschreiben, da viele Details oft übersehen werden. Aber ohne Umschweife: Schauen wir uns an, wie man eine passende `deployment.yaml`-Datei erstellt, die folgende Aufgaben für uns übernimmt:",
  "Push a new docker image to Docker Hub (with the newest version).": "Ein neues Docker-Image in Docker Hub hochladen (mit der neuesten Version).",
  "Update the `manifest/deployment.yaml` file, so Argo CD gets notified about the n.745ACECEA48EBB0BD214": "Die Datei `manifest/deployment.yaml` aktualisieren, sodass Argo CD über das neue getaggte Image informiert wird.",
  "(optional) Create a new release on GitHub, so the times of releases are document.5A45740CFC388A713228": "(optional) Einen neuen Release auf GitHub erstellen, damit die Release-Zeiten dokumentiert sind, wo sie hingehören.",
  "Here you have an obsolete `docker-hub.yaml` which we used to use because it has .ACD068BBAB645A580B40": "Hier sehen Sie eine veraltete `docker-hub.yaml`, die wir früher verwendet haben, da sie über praktische Versionierungsstrategien verfügt:",
  "After copying the contents of our `deployment.yaml` file and creating the new fi.BA0B84DE711F10368BA7": "Nachdem Sie den Inhalt unserer `deployment.yaml`-Datei kopiert und die neue Datei im Ordner `.github/workflows` erstellt haben, müssen Sie einige sehr **wichtige Anpassungen** vornehmen:",
  "Change the `IMAGE_NAME` to your personal Docker Hub repository. The image name c.70E854B465ED70C76952": "Ändere den `IMAGE_NAME` zu deinem persönlichen Docker Hub-Repository. Der Image-Name besteht aus deinem Konto-Namen und dem Repository-Namen. Wenn du dir nicht sicher bist, wie dein Image-Name lautet, kannst du die URL des Docker Hub-Repositories ansehen; dort sollte er irgendwo zu finden sein.",
  "Now you should be good to go to add the keyword `deploy` into any commit message.BBFBDF3655BEA5A69ED1": "Jetzt kannst du das Schlüsselwort `deploy` in jede Commit-Nachricht des Main-Branches deines Repositories hinzufügen, und es sollte automatisch ein Docker-Image zu Docker Hub pushen und das Manifest für Argo CD aktualisieren.",
  "Congratulations, you've successfully set up Argo CD with k3s and [Cilium](https:.F5382A81A78FA5565691": "Herzlichen Glückwunsch, du hast erfolgreich Argo CD mit k3s und [Cilium](https://github.com/cilium) eingerichtet! Du hast dir eine Kaffeepause verdient. Genieße eine wohlverdiente Tasse, und wenn du mir einen virtuellen Kaffee spendieren möchtest, kannst du gerne meine Arbeit auf [Ko-fi](https://ko-fi.com/trueberryless) unterstützen. Vielen Dank!",
  "Setting up Argo CD in a k3s cluster": "Einrichten von Argo CD in einem k3s-Cluster",
  "Today we'll take a look at how to set up Argo CD in a k3s cluster.": "Heute werfen wir einen Blick darauf, wie man Argo CD in einem k3s-Cluster einrichtet.",
  "Continuing to improve our k3s cluster and especially the CI/CD workflow, we now .A2E0EE988FAFFFAD6A42": "Um unser k3s-Cluster und insbesondere den CI/CD-Workflow weiter zu verbessern, schauen wir uns nun das GitOps-Tool <a class=\"gh-badge\" href=\"https://github.com/argoproj\"><img src=\"https://github.com/argoproj.png\" alt=\"Argo CD\" />Argo CD</a> an und wie wir es in unser Cluster integrieren können. Unser Technologiestack für die Bereitstellung umfasst folgende Dienste&#58; k3s, Helm, Cilium & nach diesem Tutorial auch Argo CD.",
  "Having read Vegard S. Hagen's article “[Argo CD Kustomize with Helm](https://blo.A0B58D0615DC386245A0": "Nachdem wir Vegard S. Hagens Artikel “[Argo CD Kustomize with Helm](https://blog.stonegarden.dev/articles/2023/09/argocd-kustomize-with-helm/)” gelesen und entschieden haben, dass ihre Lösung nicht für unser Cluster geeignet ist, haben wir uns direkt in den Argo CD-Standardleitfaden “[Getting started](https://argo-cd.readthedocs.io/en/stable/getting_started/)” gestürzt. Jetzt führen wir Euch durch den Einrichtungsvorgang von [Argo CD](https://github.com/argoproj) auf [k3s](https://github.com/k3s-io) und [Cilium](https://github.com/cilium), ausgehend vom Kapitel “[Setup Certificate Manager with Cloudflare](/blog/setup-kubernetes-with-cilium-and-cloudflare#setup-certificate-manager-with-cloudflare)” unseres neuesten Beitrags “[Setting up Kubernetes with Cilium and Cloudflare](/blog/setup-kubernetes-with-cilium-and-cloudflare)”. In genau diesem kürzlichen Beitrag haben wir auch [Keel](https://github.com/keel-hq) am Ende aufgesetzt, aber dieser Schritt wird jetzt überflüssig, da wir Argo CD verwenden, um den neuesten Stand der Technik aus jedem [GitHub](https://github.com/github)-Repository zu beziehen. Viel Spaß beim Lesen!",
  "We assume that you followed [our other blog post](/blog/setup-kubernetes-with-ci.35443F83A3EBC402F568": "Wir gehen davon aus, dass Ihr [unseren anderen Blogbeitrag](/blog/setup-kubernetes-with-cilium-and-cloudflare) befolgt habt.",
  "Requirements": "Anforderungen",
  "Before we can start, we need to make sure we have `kubectl` installed, a kubecon.AF18D970264C891E62E6": "Bevor wir beginnen können, müssen wir sicherstellen, dass `kubectl` installiert ist, wir eine Kubeconfig-Datei haben (k3s speichert diese Datei hier:",
  ") and CoreDNS (check if you have CoreDNS by running this": ") und CoreDNS (überprüft, ob CoreDNS vorhanden ist, indem Ihr diesen",
  "command).": "Befehl ausführt).",
  "Installation": "Installation",
  "First, let's apply all the necessary services, deployments and many other differ.3968A495D46DF328E51D": "Zuerst wenden wir alle notwendigen Dienste, Deployments und viele andere verschiedene Kubernetes-Ressourcen an, indem wir Folgendes ausführen:",
  "Certificate": "Zertifikat",
  "Additionally, we'll need a certificate:": "Zusätzlich benötigen wir ein Zertifikat:",
  "Apply this resource by running `kubectl apply -f certificate.yaml`.": "Wendet diese Ressource an, indem Ihr `kubectl apply -f certificate.yaml` ausführt.",
  "Ingress Controller": "Ingress-Controller",
  "And we'll need a ingress controller which is managed by Cilium:": "Außerdem benötigen wir einen Ingress-Controller, der von Cilium verwaltet wird:",
  "Apply this resource by running `kubectl apply -f argocd-ingress.yaml`.": "Wendet diese Ressource an, indem Ihr `kubectl apply -f argocd-ingress.yaml` ausführt.",
  "Deactivate TSL within Argo CD": "Deaktivieren von TSL in Argo CD",
  "With the certificate the connection between the client and server is secured. Ho.198C7766F41D2E4927DA": "Mit dem Zertifikat ist die Verbindung zwischen dem Client und dem Server gesichert. Allerdings gibt es immer noch ein selbstsigniertes Zertifikat innerhalb der [Argo CD](https://github.com/argoproj)-Dienste, das wir nicht unbedingt benötigen. Wir können daher die Sicherheit des Argo CD-Servers deaktivieren, indem wir die Eigenschaft `server.insecure` bearbeiten.",
  "In order to do that, we first run this command:": "Um dies zu tun, führen wir zuerst diesen Befehl aus:",
  "which will hopefully open a file in vim or neovim (otherwise would be cringe if .8B321BBC80D980EFA538": "der hoffentlich eine Datei in vim oder neovim öffnet (alles andere wäre aus unserer Sicht unangenehm, LOL). Die Datei sollte wie folgt aussehen:",
  "The last two lines will probably be not there at first, but this is exactly the .00E15DF17F5D9A9B4B22": "Die letzten beiden Zeilen werden wahrscheinlich zunächst nicht vorhanden sein, aber genau diese Einstellung möchten wir erreichen. Fügt diese beiden Zeilen (oben markiert) hinzu und speichert die Datei (`Esc` → `:wq`, wenn Ihr cool seid).",
  "Restart the Argo CD Server by running and waiting till the rollout is completed:.CDC77B3806BBA44885A8": "Startet den Argo CD-Server neu, indem Ihr diesen Befehl ausführt, und wartet, bis der Rollout abgeschlossen ist:",
  "After all those steps, we should now see the UI under [`https://argo-cd.trueberr.89BC34AD1ECDBC06B87E": "Nach all diesen Schritten sollten wir die Benutzeroberfläche unter [`https://argo-cd.trueberryless.org`](https://argo-cd.trueberryless.org) sehen (passwortgeschützt).",
  "The credentials of Argo CD UI consist of a user and a password. The user is alwa.BE74F043F4C1B4E5AB9E": "Die Anmeldedaten der Argo CD-Benutzeroberfläche bestehen aus einem Benutzer und einem Passwort. Der Benutzer ist immer `admin`, und Ihr könnt Euer Passwort abrufen, indem Ihr Folgendes ausführt:",
  "Add manifest to repository": "Manifest zum Repository hinzufügen",
  "Now in order to create a new application in [Argo CD](https://github.com/argopro.B153A0B7CA8710DB4FF2": "Um in [Argo CD](https://github.com/argoproj) eine neue Anwendung zu erstellen (entweder über die Benutzeroberfläche oder die CLI — wir verwenden die Benutzeroberfläche, da wir die CLI nicht eingerichtet haben), müssen wir das Git-Repository vorbereiten. Weil das Repository die einzige Quelle der Wahrheit ist, definieren wir hier auch alle Kubernetes-Ressourcen, die von Argo CD erstellt werden sollen.",
  "We recommend creating a new folder in the git repository called something like `.505C369206406EFB86A4": "Wir empfehlen, einen neuen Ordner im Git-Repository zu erstellen, der etwas wie `manifest` heißt. In diesem Ordner legen wir ein paar Dateien an:",
  "`certificate.yaml`:": "`certificate.yaml`:",
  "`deployment.yaml`:": "`deployment.yaml`:",
  "`service.yaml`:": "`service.yaml`:",
  "`ingress.yaml`:": "`ingress.yaml`:",
  "These files are basically the exact same files mentioned in the [other post](/bl.A6639A930D5E316FA4EB": "Diese Dateien sind im Grunde die gleichen Dateien, die im [anderen Beitrag](/blog/setup-kubernetes-with-cilium-and-cloudflare#example-app-mutanuq) erwähnt wurden, jedoch in vier Dateien aufgeteilt, da dies uns den Vorteil gibt, das Manifest von [GitHub](https://github.com/github) Actions aus zu manipulieren. Aber der Reihe nach, im [nächsten Beitrag](/blog/setup-continuous-integration-github-repository) erfahrt Ihr, wie Ihr das Manifest mit GitHub Actions einrichtet.",
  "Create new application in Argo CD UI": "Neue Anwendung in der Argo CD-Benutzeroberfläche erstellen",
  "You'll probably see the big `NEW APP` button in the UI of [Argo CD](https://gith.8C955D38A27D41B77691": "Ihr werdet wahrscheinlich den großen `NEW APP`-Button in der Benutzeroberfläche von [Argo CD](https://github.com/argoproj) sehen. Klickt darauf und erstellt eine neue Anwendung mit den folgenden angepassten Eigenschaften:",
  "Application Name: `mutanuq`": "Anwendungsname: `mutanuq`",
  "Project Name: `default`": "Projektname: `default`",
  "Sync Policy: Find out more in [this post](/blog/setup-continuous-integration-git.049A9447DEA81CE1B5DD": "Sync-Policy: Mehr darüber erfahrt Ihr in [diesem Beitrag](/blog/setup-continuous-integration-github-repository) / lasst es vorerst auf `Manuell`",
  "Repository URL: `https://github.com/trueberryless-org/mutanuq`": "Repository-URL: `https://github.com/trueberryless-org/mutanuq`",
  "Revision: `HEAD`": "Revision: `HEAD`",
  "Path: `manifest`": "Pfad: `manifest`",
  "Cluster URL: `https://kubernetes.default.svc`": "Cluster-URL: `https://kubernetes.default.svc`",
  "Namespace: `mutanuq`": "Namespace: `mutanuq`",
  "Optionally — if you have [the CLI installed](https://argo-cd.readthedocs.io/en/s.4F9EF0A15884AE51DE02": "Optional — wenn Ihr [die CLI installiert habt](https://argo-cd.readthedocs.io/en/stable/cli_installation/) — könnt Ihr diesen Befehl für denselben Output ausführen:",
  "Now you can hopefully see your website being deployed in the UI. This process ca.9A72C473303559E3BDC1": "Nun sollten Sie hoffentlich sehen, dass Ihre Website in der Benutzeroberfläche bereitgestellt wird. Dieser Vorgang kann einige Zeit in Anspruch nehmen, da beispielsweise die Zertifikatsanforderung genehmigt werden muss. Eine gesunde Anwendung sollte in etwa so aussehen:",
  "Congratulations, you've successfully set up [Argo CD](https://github.com/argopro.99A2D6F9095CF50BC9D2": "Herzlichen Glückwunsch, Sie haben [Argo CD](https://github.com/argoproj) erfolgreich auf einem [k3s](https://github.com/k3s-io)-Cluster eingerichtet! Sie haben sich eine Kaffeepause verdient. Genießen Sie eine wohlverdiente Tasse, und wenn Sie mir virtuell einen Kaffee ausgeben möchten, können Sie gerne meine Arbeit auf [Ko-fi](https://ko-fi.com/trueberryless) unterstützen. Vielen Dank!",
  "Continuation": "Fortsetzung",
  "Be continued for our [next blog](/blog/setup-continuous-integration-github-repos.C6E6C542B1FAA026061D": "Bleiben Sie dran für unseren [nächsten Blog](/blog/setup-continuous-integration-github-repository), in dem beschrieben wird, wie Sie ein [GitHub](https://github.com/github)-Repository einrichten, das anschließend über Argo CD bereitgestellt werden kann.",
  "How to create a Rehype plugin that turns GitHub links into beautiful badges": "Wie man ein Rehype-Plugin erstellt, das GitHub-Links in schöne Badges umwandelt",
  "Learn how to build a simple yet delightful Rehype plugin that automatically tran.1DBFD32D56C53FC8C2C2": "Erfahren Sie, wie Sie ein einfaches, aber ansprechendes Rehype-Plugin erstellen, das GitHub-Profillinks automatisch in stilvolle, badge-ähnliche Links mit Profilbildern verwandelt – perfekt, um Ihrem Blog oder Ihren Dokumenten Persönlichkeit zu verleihen.",
  "Discover how a tiny Rehype plugin can give your GitHub links a big visual upgrad.95CD8D7DFB0C962AE484": "Entdecken Sie, wie ein kleines Rehype-Plugin Ihren GitHub-Links ein großes visuelles Upgrade verleihen kann. Mit nur wenigen Zeilen Code wandeln wir normale Profillinks in elegante Badges mit Avataren um, inspiriert von Antfus Website und unterstützt von Astro + Starlight.",
  "Recently, I added a very little neat feature to this blog, which you might have .31ECBA06CD87D5CFEC39": "Kürzlich habe ich diesem Blog eine kleine, aber feine Funktion hinzugefügt, die Ihnen möglicherweise als regelmäßiger Leser aufgefallen ist. Es ist nichts Großes, aber es verleiht jedem Blog diese kleine, liebevolle Note, nach der ich mich schon lange gesehnt habe. Ich spreche, pardon, schreibe über all diese grünen Badges mit Profilbildern, die Sie in diesem Blog sehen können.",
  "The inspiration to create them was taken from none other than [Antfu](https://gi.F44018DA56F114106E55": "Die Inspiration, sie zu erstellen, kam von niemand Geringerem als [Antfu](https://github.com/antfu) selbst, da er diese Badges überall auf seiner Website hat (zum Zeitpunkt der Erstellung dieses Artikels).",
  "Initially I thought they would require some long and tedious programming session.65C4EC1C8DE4A47731E5": "Anfangs dachte ich, dass es eine lange und mühsame Programmier-Session erfordern würde, um dieselbe visuelle Schönheit zu erreichen. Aber nach einer Runde „Vibe Coding“ – wie [Andrej Karpathy den Begriff geprägt hat](https://x.com/karpathy/status/1886192184808149383) – wurde mir schnell klar, dass diese Badges nur ein kleines [rehype](https://github.com/rehypejs) Plugin entfernt von der Existenz waren.",
  "This is the whole code behind the rehype plugin:": "Hier ist der gesamte Code des Rehype-Plugins:",
  "Basically all this plugin does, is walking through the HTML, looking for links w.713A33AB7C816E7ADAF6": "Im Grunde durchsucht dieses Plugin das HTML nach Links, die auf ein GitHub-Profil verweisen. Wenn das Plugin einen solchen Link findet, fügt es ein `<img>`-Tag vor dem Textinhalt mit dem Profilbild des GitHub-Benutzers oder der Organisation ein. Dies ist dank der GitHub-Funktion, das Bild als Ressource hinter dem Profillink mit der Endung `.png` bereitzustellen, sehr konsistent möglich. Lesen Sie mehr über diese Funktion in [diesem großartigen Artikel auf `dev.to`](https://dev.to/10xlearner/how-to-get-the-profile-picture-of-a-github-account-1d82).",
  "With a little bit of additional styling it looks really cute in my opinion. Plea.3CF02F394DFC8ECF3E94": "Mit ein wenig zusätzlichem Styling sieht es meiner Meinung nach wirklich niedlich aus. Bitte beachten Sie, dass ich, da dies eine <StarlightBadgeLink />-Seite ist, verfügbare CSS-Variablen verwende, wie in Zeile vier:",
  "Now to put everything together, let's say for example in an Astro site, you just.9BE9659FCADE76D6467F": "Um nun alles zusammenzufügen, müssen Sie beispielsweise nur das Rehype-Plugin in die Konfiguration Ihrer Astro-Site einfügen, wie hier gezeigt:",
  "Read more about the injection of rehype plugins in Astro in [their configuration.D3124728AFCD14A1CEE8": "Lesen Sie mehr über die Integration von Rehype-Plugins in Astro in [deren Konfigurationsreferenz](https://docs.astro.build/en/reference/configuration-reference/#markdownrehypeplugins).",
  "Do not forget to add the CSS in a similar way depending on your framework - in S.8376354E6C8822949CB6": "Vergessen Sie nicht, das CSS ähnlich je nach Framework hinzuzufügen – in Starlight können Sie benutzerdefinierte globale CSS-Stile konfigurieren, indem Sie [diese Anleitung](https://docs.astro.build/en/guides/styling/#scoped-styles) befolgen – und schon können Sie Ihre eigenen Badge-Links bewundern. Teilen Sie diesen Beitrag gerne mit jedem, den Sie überzeugen möchten, diese Features ebenfalls zu nutzen.",
  "✨ Bones point": "✨ Bonus-Tipp",
  "If you want to use such a badge for other links too, I recommend that you craft .E4245F963D0ACC5A33AD": "Wenn Sie solche Badges auch für andere Links verwenden möchten, empfehle ich Ihnen, ein kleines Astro-Komponenten wie diese hier zu erstellen:",
  "Just make sure that the CSS is globally (or [scope](https://docs.astro.build/en/.4FF4BAAF51A54FE15B11": "Achten Sie einfach darauf, dass das CSS global ist (oder [scopen](https://docs.astro.build/en/guides/styling/#scoped-styles) Sie es in der obigen Komponente), und es ist bereit zur Verwendung:",
  "Accelerating translations with continuous integration": "Beschleunigung von Übersetzungen durch kontinuierliche Integration",
  "The story of how my journey of contributions to action-continuous-translation st.539B68E34D18B54F07FE": "Die Geschichte, wie meine Reise der Beiträge zu action-continuous-translation begann.",
  "<p>I have been working in OSS on <a class=\"gh-badge\" href=\"https://github.com/gi.8F9A527414094F26EF41": "<p>Ich arbeite nun schon seit über einem Jahr im OSS-Bereich auf <a class=\"gh-badge\" href=\"https://github.com/github\"><img src=\"https://github.com/github.png\" alt=\"github\" />GitHub</a>, und obwohl ich dachte, ich hätte alles gefunden, zu dem ich beitragen möchte, habe ich vor Kurzem <a class=\"gh-badge\" href=\"https://github.com/pelikhan\"><img src=\"https://github.com/pelikhan.png\" alt=\"pelikhan\" />Pelis</a> persönliches Projekt <a href=\"https://github.com/pelikhan/action-continuous-translation\">action-continuous-translation</a> entdeckt. Ich bin sehr froh, dass ich dort regelmäßige Beiträge leiste und jetzt Teil der kleinen Community bin.</p>",
  "For the last year, I have been working a lot in various Open Source Communities .D0EE1E8417F371E1353F": "Im letzten Jahr habe ich in meiner Freizeit viel in verschiedenen Open-Source-Communities auf GitHub gearbeitet und diese irgendwie entspannenden Beiträge genossen, da sie mir täglich helfen, neues Wissen zu erwerben.",
  "After some time contributing I also got to know how kind and welcoming communiti.6B14A5E726DED7FDE5C1": "Mit der Zeit habe ich auch erfahren, wie freundlich und einladend die Communities hinter diesen Projekten sind. Diese Menschen haben eines mit dir gemeinsam: Sie wollen in ihrer Freizeit großartige Dinge schaffen. Besonders die [Astro](https://github.com/withastro)-Community ist die einzige, in der ich mich am meisten wohlgefühlt habe, da sie gleichzeitig am lohnendsten und freundlichsten ist. Nicht alle Communities können einen solchen großartigen Status im OSS-Bereich erreichen.",
  "Recently, I discovered another evolving project founded by [pelikhan](https://gi.90E9DCA5FB8FA470B7FE": "Kürzlich habe ich ein weiteres sich entwickelndes Projekt entdeckt, das von [pelikhan](https://github.com/pelikhan) gegründet wurde und das Ziel hat, mithilfe von KI automatisch alle Ihre Dokumentationen, Blogs oder Shopseiten zu übersetzen, sobald sich etwas ändert. Obwohl ich anfangs skeptisch war, hat mich das Lesen der README.md des Projekts gepackt.",
  "The approach of strictly guiding AI into only translating little chunks - mostly.EFA08DBC1CAAB5CE6D3C": "Der Ansatz, die KI streng anzuweisen, nur kleine Stücke - meist Sätze oder Absätze - mit perfektionistischen Anweisungen zu übersetzen, ließ mich glauben, dass dies wirklich funktionieren könnte. Also habe ich es in meinem eigenen Projekt, meinem Blog, ausprobiert. Und zu meiner Überraschung waren diese Übersetzungen viel besser als erwartet. Natürlich merkt man, dass sie von KI übersetzt wurden – handgemachte Arbeit wird hoffentlich niemals vollständig ersetzt – aber wenn man fairerweise erwähnt, dass man KI verwendet, ist dies für Menschen weit zugänglicher als nichts.",
  "So I took a closer look at the actual code of the project. After noticing some l.04C2097BA41406300A39": "Also warf ich einen genaueren Blick auf den tatsächlichen Code des Projekts. Nachdem ich einige kleine Inkonsistenzen, Verbesserungsmöglichkeiten und hier und da fehlende, aber sehr coole Funktionen bemerkt hatte, begann ich ebenfalls, dort beizutragen. Ich meine, nach einem Jahr der Beiträge zu größeren Projekten waren PRs für mich nichts Neues.",
  "You have to know that this was a Friday evening - almost night in my timezone - .F07D43687D090B7997ED": "Sie müssen wissen, dass dies ein Freitagabend war – fast Nacht in meiner Zeitzone – und [Peli](https://github.com/pelikhan) war gerade online und machte Commit nach Commit für das Projekt. Ich bemerkte schnell, dass Peli im Gegensatz zu den anderen Projekten, an denen ich beteiligt bin, keine Zeit mit dem Zusammenführen von PRs verschwendete. Es fühlte sich an diesem Abend sehr lohnend an, da ich einfach bis 1 Uhr morgens weitermachte und Peli schneller zusammenführte, als ich Funktionen, Dokumentationen und Fehlerbehebungen verbessern konnte. Ein weiterer Aspekt, der großartig war, war, dass Peli, da dies ein junges Projekt war, nicht zögerte, einfach zusammenzuführen, es lokal auszuprobieren und dann kleine Fehler zu beheben, die ich übersehen hatte.",
  "Fast-forward three days and I am now an official contributor to the project, mak.3479DA18B6C4E8D9A8EE": "Drei Tage später bin ich nun ein offizieller Mitwirkender des Projekts, das ich nahezu täglich größer und größer mache, hauptsächlich mit dem Fokus auf die Dokumentation und die Unterstützung für mein Herzensprojekt: Starlight – wie Sie vielleicht schon aus [meinen Blogs](/blog/tags/starlight/) erraten haben.",
  "Peli and I have our virtual productivity sessions between 4pm and 8pm UTC, exten.51E309B378285EAEEA84": "Peli und ich haben unsere virtuellen Produktivitätssitzungen zwischen 16:00 und 20:00 UTC, die an Wochenenden länger dauern. Wenn Sie also Interesse haben, sich uns als einer der Frühaufsteher des Projekts anzuschließen oder es zu nutzen, schauen Sie gerne auf [GitHub](https://github.com/github) vorbei: [https://github.com/pelikhan/action-continuous-translation](https://github.com/pelikhan/action-continuous-translation)",
  "Earworms and the message hidden within the pattern": "Ohrwürmer und die Botschaft, die im Muster verborgen ist",
  "Some random thoughts about earworms and their message hidden within the pattern..9902F83DCFE33FCF2F42": "Einige zufällige Gedanken über Ohrwürmer und ihre Botschaft, die im Muster verborgen liegt.",
  "Yes, this title is a small nod to the excellent Netflix series \"Arcane\", but tha.13B50605E73E31D148F1": "Ja, dieser Titel ist eine kleine Hommage an die ausgezeichnete Netflix-Serie \"Arcane\", aber darum geht es in diesem Beitrag nicht.",
  "Today, I want to share some thoughts about earworms, a term that originated in G.6A8601A7B3560A913F2E": "Heute möchte ich ein paar Gedanken zu Ohrwürmern teilen, einem Begriff, der ursprünglich aus dem Deutschen („Ohrwurm“) stammt und später wörtlich ins Englische übernommen wurde. Die Bedeutung hinter diesem eher abstrakten Begriff sind eingängige Melodien—*klebrige Musik*, wie Wikipedia es nennt. Dieses Phänomen tritt oft unvorhersehbar auf, besonders wenn unsere Gedanken von der Gegenwart abdriften.",
  "While many of my blog-post ideas strike on train rides, while lying in bed, or w.25AB9868BD26D2664DE1": "Während mir viele Ideen für Blogbeiträge beim Zugfahren, im Bett liegend oder beim Nachdenken über das Leben kommen, kam mir die Inspiration für diesen Beitrag buchstäblich unter der Dusche, wie es bei den guten alten *Dusche-Gedanken* gedacht ist. Der Grund – wie Sie aus dem Thema vielleicht erraten können – war ein Ohrwurm von einer Melodie, bei der ich schwören könnte, sie seit langem nicht mehr gehört zu haben, etwa 4–5 Wochen.",
  "And this always seems to be the confusing parts about earworms: Nobody really kn.02E8F977B7963E92DD1D": "Und dies scheint immer der verwirrende Teil an Ohrwürmern zu sein: Niemand weiß wirklich, wer entscheidet, wann sie abgespielt werden. Ist es das Gehirn, das „Play“ drückt, wenn es leicht benommen ist? Sie wissen schon, jene Momente, in denen man nicht wirklich weiß, worüber man gerade nachdenkt, und man nicht darüber nachdenken muss, worüber man nachdenken soll, sondern einfach den Moment genießt. Dazu gibt es eine weitere österreichische Redewendung für genau dieses Szenario: \"ins Narrenkastl schauen\", was so viel bedeutet wie *ins Leere starren*. Und ich denke, genau diese geistesabwesenden Momente sind der Ursprung und der Grund, warum Ohrwürmer auftreten.",
  "But this still leaves the question: Who decides what to play in someone's head w.869DDF0A56F11A495705": "Aber das lässt dennoch die Frage offen: Wer entscheidet, was in jemandes Kopf abgespielt wird, wenn es passiert? Wer ist der DJ? Aus meiner eigenen Erfahrung habe ich ein sich wiederholendes Muster bemerkt, besonders wenn man in der letzten halben Stunde gerade Musik gehört hat. Mein Gehirn zum Beispiel mag es, Teile des **vorletzten Liedes** zu wiederholen, also des Liedes, das vor dem letzten gespielt wurde. Diese Theorie funktioniert sogar noch besser, wenn das letzte Lied in der Mitte pausiert oder nicht perfekt bis zum Ende abgespielt wurde.",
  "The exact reason for that is completely unknown to me, but if I had to guess, I .A798D76B65D60FBFC400": "Der genaue Grund dafür ist mir völlig unbekannt, aber wenn ich raten müsste, würde ich sagen, dass die Rhythmen des abgeschlossenen Liedes (des vorletzten) noch irgendwo im Kopf nachklingen, da das Lied selbst vielleicht eines dieser \"Ich-blende-meine-Lautstärke-aus-um-zu-end\"-Lieder war, was nicht meine Lieblingsart des Musikabschlusses ist, aber das Gehirn dazu anregt, weiterzumachen.",
  "At least that's what I think. I would be very interested if you have experienced.2A5110405B0386450071": "Zumindest ist das meine Theorie. Ich wäre sehr interessiert, ob Sie ähnliche Muster erlebt haben, also zögern Sie nicht, Ihren eigenen Blogbeitrag darüber zu schreiben oder teilen Sie einfach diesen mit Freunden, damit Sie mit ihnen darüber diskutieren können!",
  "Vibe-coding a VS Code Extension for Terraform projects": "Vibe-Coding: Eine VS Code-Erweiterung für Terraform-Projekte",
  "How I created an extension for Visual Studio Code which adds inline resolutions .94295B1957CBEE7AD731": "Wie ich eine Erweiterung für Visual Studio Code entwickelt habe, die Inline-Auflösungen für Variablen in Terraform-Projekten hinzufügt.",
  "Today, I want to talk about a small VS Code extension that I vibe-coded in a sin.6C43E09851571E31F19E": "Heute möchte ich über eine kleine VS-Code-Erweiterung sprechen, die ich an einem einzigen Tag „Vibe-Code“ entwickelt habe, um die Arbeit mit Terraform zu erleichtern. Zunächst erkläre ich, was Terraform ist, und gehe dann direkt auf die Funktionalität und die Gründe für diese Erweiterung ein. Fühlen Sie sich frei, den ersten Abschnitt zu überspringen, wenn Sie bereits mit Terraform vertraut sind.",
  "What is Terraform?": "Was ist Terraform?",
  "Terraform is an infrastructure-as-code (IaC) tool that lets you define your enti.C1E19D8A95C63B18257A": "Terraform ist ein Infrastructure-as-Code- (IaC) Tool, mit dem Sie Ihre gesamte Cloud- oder On-Prem-Infrastruktur als Code definieren können. Die von [HashiCorp](https://github.com/hashicorp) entwickelte Konfigurationssprache HCL (HashiCorp Configuration Language) zeichnet sich durch eine intuitive, menschenlesbare Syntax aus. Die *native Syntax* hat den Vorteil, dass die Lernkurve niedrig ist, sie einheitlich für alle Anbieter ist und angenehm für Menschen zu lesen und zu schreiben ist, während die JSON-basierte Variante für Maschinen einfacher zu generieren und zu parsen ist.",
  "What makes Terraform very powerful are two basic features: **variables** and **m.F29F6CFC8D18A39724FE": "Was Terraform sehr leistungsfähig macht, sind zwei grundlegende Funktionen: **Variablen** und **Module**. Variablen ermöglichen es Ihnen, Ressourcen zu erstellen, bei denen die tatsächlichen Werte von irgendwo anders eingefügt werden können, und Module gruppieren eine beliebige Anzahl von Ressourcen, was den Vorteil der Wiederverwendbarkeit und Verschachtelung bietet. Während beide Funktionen sehr grundlegend klingen, machen sie in Kombination ein Dream-Team aus. Denn die Offenheit von Terraform ermöglicht Ihnen, Eingabevariablen für jedes Modul zu definieren und Variablen auch über Ausgabenexporte bereitzustellen.",
  "A simple module is therefore structured like this:": "Ein einfaches Modul ist daher folgendermaßen strukturiert:",
  "azure-resource-group/": "azure-resource-group/",
  "main.tf": "main.tf",
  "variables.tf": "variables.tf",
  "outputs.tf": "outputs.tf",
  "README.md": "README.md",
  "All files except `main.tf` are optional (the `README.md` isn’t Terraform-specifi.C0AA6A4205B65B850BDC": "Alle Dateien außer `main.tf` sind optional (das `README.md` ist nicht Terraform-spezifisch), aber ich bevorzuge es, Best Practices zu folgen, daher enthält das Beispiel diese.",
  "Let's look at a simple example. Imagine we want to manage a resource group in Az.C7130E93293C5F3835FA": "Schauen wir uns ein einfaches Beispiel an. Angenommen, wir möchten eine Ressourcengruppe in Azure mit Terraform verwalten. In der Datei `variables.tf` definieren wir, welche Eingaben wir innerhalb des Moduls erwarten. Jeder der beiden Blöcke repräsentiert die Variable und Eigenschaften der Variablen wie die `description` oder den `type`:",
  "You might have noticed that the `location` variable also has a `default` propert.98D282B5427579CFCDE8": "Vielleicht ist Ihnen aufgefallen, dass die Variable `location` auch eine `default`-Eigenschaft hat, die die Variable optional macht und einen Standardwert bereitstellt, falls keiner angegeben ist. Diese Variablen können dann in der Datei `main.tf` verwendet werden. Hier definieren wir die eigentlichen Ressourcen, die wir generieren möchten:",
  "In this case, we just define our simple resource group, which you can think of a.549C08D1FEC998D18486": "In diesem Fall definieren wir einfach unsere Ressourcen-Gruppe, die Sie sich wie einen Ordner in Azure vorstellen können – eine sehr laienhafte Erklärung. Nun ist der letzte Teil, den wir implementieren können, die Datei `outputs.tf`:",
  "This is very useful if we want to use information like the ID of the resource gr.EB0A3E52AB5C3982D204": "Dies ist sehr nützlich, wenn wir Informationen wie die ID der Ressourcengruppe später in anderen Teilen unseres Terraform-Projekts verwenden möchten.",
  "As I already wrote, the `README.md` is not actually part of the Terraform defini.E6BDEA6D28A17F85099B": "Wie ich bereits geschrieben habe, ist die Datei `README.md` tatsächlich kein Teil der Terraform-Definitionen, hilft jedoch, den Zweck des Moduls zu verstehen:",
  "As the `README.md` already suggests, we can now use this module to create an Azu.A94748FE0C01D4120745": "Wie das `README.md` bereits andeutet, können wir dieses Modul nun verwenden, um überall in unserem Projekt eine Azure-Ressourcengruppe zu erstellen. Wir müssen nur sicherstellen, dass der Pfad zum Modulordner korrekt ist und Terraform weiß, wie die Dateien `main.tf`, `variables.tf` und `outputs.tf` zu interpretieren sind. In diesem Fall wird die Variable `location` auf `\"westeurope\"` gesetzt, da wir sie nicht explizit angeben.",
  "I hope this section gave you a better basic understanding of what Terraform is a.8558BAB715B916ACA2AE": "Ich hoffe, dieser Abschnitt hat Ihnen ein besseres grundlegendes Verständnis dafür vermittelt, was Terraform ist und was Sie damit tun können.",
  "The tedious task of Terraform": "Die mühsame Aufgabe von Terraform",
  "You might have noticed that the `source` field of a module creates an awesome fl.8E968461FC7650C53259": "Vielleicht haben Sie bemerkt, dass das `source`-Feld eines Moduls eine großartige Flexibilität für das gesamte Projekt schafft, da Sie Module überall definieren und überall innerhalb des Projekts verwenden können.",
  "However, this feature also has a huge drawback when it comes to maintainability:.648C608F44A24AAF64E1": "Diese Funktion hat jedoch einen großen Nachteil in Bezug auf die Wartbarkeit: Das Auflösen der tatsächlichen Werte hinter Variablen kann sehr mühsam sein. Während dies in diesem einfachen Beispiel leicht zu handhaben scheint, wird es umso schwieriger und zeitaufwändiger, je größer das Projekt wird, je verschachtelter es ist, und je mehr Terraform-Code es zu verstehen und anzupassen gibt. Daher habe ich eine Erweiterung erstellt.",
  "**What should the extension do?** The main goal of the extension is to provide t.8B7ACE467BC6CBF2D8B5": "**Was sollte die Erweiterung tun?** Das Hauptziel der Erweiterung ist es, die tatsächlichen Werte der Variablen überall bereitzustellen, wo Sie sie verwenden. Wenn ein Modul von mehreren Stellen oder einfach mehrmals aufgerufen wird, sollten die Informationen anzeigen, welcher Anwendungsfall die Variable auf welchen Wert setzt. Wenn Module tief verschachtelt werden, sollten die Werte aufgelöst werden, bis wir die `.tfvars`-Dateien erreichen. Dies sind die Dateien, in denen Sie die fest codierten Werte für Variablen definieren können.",
  "How to start a VS Code extension": "Wie startet man eine VS Code-Erweiterung",
  "Creating the basic template project for a VS Code extension is as easy as runnin.6F4EB3BBD45F5DF0A520": "Das Erstellen des grundlegenden Template-Projekts für eine VS Code-Erweiterung ist so einfach wie das Ausführen dieses Befehls, wenn Sie [Node](https://github.com/nodejs) installiert haben:",
  "This command temporarily installs the Yeoman (a generator software), and enters .5FDA5DDC43BF09081006": "Dieser Befehl installiert vorübergehend Yeoman (eine Generator-Software) und startet einen interaktiven Modus, in dem einige Fragen beantwortet werden müssen, wie der Projektname, der Typ und die Beschreibung. Im folgenden Block sehen Sie alle Fragen und Standardantworten:",
  "For further information regarding VS Code extensions I want to link to [the offi.B0448C131D881366A635": "Für weitere Informationen zu VS Code-Erweiterungen möchte ich auf [die offizielle Dokumentation](https://code.visualstudio.com/api/get-started/your-first-extension) verlinken, da sie im Gegensatz zu meinen Erklärungen hier immer aktuell ist.",
  "3… 2… 1… Vibe-Coding!": "3... 2... 1... Vibe-Coding!",
  "I like to start new projects by asking [ChatGPT](https://github.com/openai) for .FD250EAE4277C6E99E2B": "Ich beginne gerne neue Projekte, indem ich [ChatGPT](https://github.com/openai) allgemeine technische Fragen stelle wie:",
  "How would you suggest achieving such a project?": "Wie würden Sie vorschlagen, ein solches Projekt zu realisieren?",
  "How long do you estimate it will take me?": "Wie lange schätzen Sie, dass es dauern wird?",
  "How difficult will it be?": "Wie schwierig wird es sein?",
  "Brainstorming with AI bots seems like a very sensible way to get a better overvi.59F0199CCC0E7F65A0D7": "Das Brainstorming mit KI-Bots erscheint mir als eine sehr sinnvolle Möglichkeit, einen besseren Überblick über neue Projekte zu erhalten, insbesondere wenn man in völlig neue Gewässer eintaucht.\nDas Erstellen einer VS Code-Erweiterung war genau ein solcher Anwendungsfall, da ich noch nie etwas für VS Code oder eine andere IDE erstellt hatte.\nNach dieser ersten Brainstorming-Phase bevorzuge ich es, [Claude](https://github.com/anthropics) zu verwenden, um alle für eine solche Erweiterung erforderlichen Dateien zu programmieren, da dieser KI-Bot aus meiner Erfahrung wirklich die Fähigkeit besitzt, den Code zu treffen. Ich bin kaum auf Bugs oder Laufzeitprobleme mit Claude-Code gestoßen, daher nutze ich ihn genau für solche Anwendungsfälle – als Ausgangspunkt. Der Nachteil von Claude ist sein sehr begrenztes kostenloses Kontingent, weshalb ich immer vorsichtig bin, wie ich meine Worte wähle, und versuche, im Voraus so viele mögliche Fehler zu bedenken, die die KI machen könnte.\nSo hat es begonnen: Ich habe mir Zeit genommen, mein genaues Szenario und meine Wünsche in die begrenzten Kontextfenster einer zufälligen Wortmaschine namens Claude zu formulieren und erhielt sofort eine umfangreiche `extension.ts`-Implementierung. Natürlich gab es offensichtliche Unterschiede zwischen meiner Vision und der Kommunikation mit diesem LLM, weshalb ich es ein weiteres Mal darauf hinweisen musste, welche wichtigen Überlegungen zu berücksichtigen waren. Um mehr Code erhalten zu können, habe ich außerdem meinen magischen Trick angewandt: \"Wenn dies für eine Datei zu groß ist, geben Sie mir die gesamte `extension.ts` einfach in mehreren Dateien aus, das sollte natürlich funktionieren.\"",
  "Claude then went on a long journey.": "Claude begann dann eine lange Reise.",
  "After some struggling to keep it going my tokens were all used and I had to figu.C934BA4A6CDB48B1D692": "Nachdem ich einige Schwierigkeiten hatte, es am Laufen zu halten, waren meine Tokens aufgebraucht, und ich musste den verbleibenden Code selbst herausfinden. Dennoch gelang es mir, eine funktionierende Version zu erstellen, da nicht mehr viel fehlte, und ich stellte sofort einige Verbesserungen fest, die bis dahin unbemerkt geblieben waren. Da ich auf die Auffüllung meiner Tokens warten musste, tat ich genau das.",
  "The next morning the improvement session began, and after two long conversations.D0F806E5F02FCADFF975": "Am nächsten Morgen begann die Verbesserungsphase, und nach zwei langen Gesprächen war das Kontextfenster komplett gefüllt, sodass ich keine Nachrichten mehr im gleichen Chat senden konnte, obwohl meine Tokens noch nicht abgelaufen waren. Trotzdem war alles, was ich von Claude erreichen und erhalten wollte, nun verfügbar, und ich konnte einige Tests in einem meiner größeren Projekte durchführen. Nach der manuellen Bestätigung und Anpassung einiger Codes war ich vorerst zufrieden, und so entschied ich, dass die erste öffentliche Version bereit war.",
  "Some trial and error with [GitHub Actions](https://github.com/github) later, I m.B1A6CFA9C8791F3B0E65": "Nach einigen Versuchen und Fehlern mit [GitHub Actions](https://github.com/github) gelang es mir, [den Publisher einzurichten](https://code.visualstudio.com/api/working-with-extensions/publishing-extension#create-a-publisher) für eine VS-Code-Erweiterung. Und zwei Patch-Versionen später war ich mit den Ergebnissen recht zufrieden.",
  "The Final Result": "Das Endergebnis",
  "Try out the extension yourself by clicking on the button below. There are still .53D329C6D712DEFF0967": "Probieren Sie die Erweiterung selbst aus, indem Sie auf die Schaltfläche unten klicken. Es gibt noch viele Verbesserungen vorzunehmen, daher können Sie gerne auf [GitHub](https://github.com/trueberryless/terraform-variables-resolution) mithelfen, wenn Sie interessiert sind.",
  "Install Terraform Variables Resolution": "Terraform Variables Resolution installieren",
  "Here you can see the example from [the Terraform explanation](#what-is-terraform.772358BC6F4987371F60": "Hier sehen Sie das Beispiel aus [der Terraform-Erklärung](#what-is-terraform), das zeigt, wie diese Erweiterung die Werte der Variablen in VS Code visuell hinzufügt:"
}