{
  "Deep Thoughts - Overview": "Tiefgründige Gedanken - Überblick",
  "Welcome to my blog. Take a look at this minimalistic overview of all my blog pos.5A38D8470D9F24600ED2": "Willkommen in meinem Blog. Werfen Sie einen Blick auf diesen minimalistisch gestalteten Überblick über alle meine Blogbeiträge.",
  "Some aspects of creating a blog are really easy, and some are extremely difficul.997EB56977F5D63B1118": "Einige Aspekte der Erstellung eines Blogs sind wirklich einfach, und einige sind extrem schwierig!",
  "A beginner friendly introduction with some swear words on how to start writing y.BE312646252BC9A86726": "Eine einsteigerfreundliche Einführung mit einigen Schimpfwörtern darüber, wie man anfängt, seinen eigenen Blogbeitrag zu schreiben.",
  "<p>Talk a little bit about how one can become better (not master by any means, n.8C69E4E4A592E67958BE": "<p>Ein wenig darüber sprechen, wie man besser (bei weitem kein Meister, niemand ist perfekt) im Schreiben von Blogposts sein kann. Dies sind nur meine Gedanken, nachdem zwei großartige Leute aus der <a href=\"https://astro.build/chat\">Astro Community</a> (<a class=\"gh-badge\" href=\"https://github.com/jdtjenkins\"><img src=\"https://github.com/jdtjenkins.png\" alt=\"jdtjenkins\" />Jacob</a> und <a class=\"gh-badge\" href=\"https://github.com/louisescher\"><img src=\"https://github.com/louisescher.png\" alt=\"louisescher\" />Lou</a>) beschlossen haben, Blogs darüber zu schreiben, wie schwer und einfach es ist, Blogposts zu schreiben.</p><p>Bitte lesen Sie zuerst ihre Beiträge, da dies die Folge von beiden ist:</p><ol><li><a href=\"https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/\">\"Warum ist Blogschreiben so schwer?\" - Jacob Jenkins</a></li><li><a href=\"https://lou.gg/blog/why-writing-blogs-isnt-hard\">\"Warum Blogschreiben nicht schwer ist\" - Louis Escher</a></li><li><a href=\"/blog/writing-blogs-is-hard-and-easy/\">\"Einige Aspekte der Erstellung eines Blogs sind wirklich einfach, und einige sind extrem schwierig!\" - Felix Schneider</a></li></ol><p>Nachdem Sie das gelesen haben, haben Sie erfolgreich diese großartige Trilogie von Blogposts über Blogposts abgeschlossen.</p>",
  "After a very interesting discussion in the [Astro](https://github.com/withastro).48AFE0BF2E41079C33DD": "Nach einer sehr interessanten Diskussion im [Astro](https://github.com/withastro) [Discord](https://astro.build/chat) - gestartet von niemand geringerem als Kernentwickler [Alex](https://github.com/alexanderniebuhr) selbst (übrigens Glückwunsch zu diesem kürzlichen Erfolg 🎉) -, habe ich scherzhaft gesagt, dass jemand einen Blog darüber schreiben könnte, warum es für viele Menschen so schwierig ist, nicht nur zu schreiben, sondern auch einen Blog insgesamt zu pflegen.",
  "The man who nominated me as an Astro Support Squad - [Jacob](https://github.com/.47D0DB043E57D3E7660B": "Der Mann, der mich als Mitglied des Astro Support Teams vorgeschlagen hat - [Jacob](https://github.com/jdtjenkins) (übrigens vielen Dank, dass du mich in dieser großartigen Community bemerkt hast 😍) - nahm das ziemlich wörtlich und schrieb einen Blog darüber. Kein Scherz. Sehen Sie selbst: [https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/](https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/) Dies ist übrigens sein allererster Blog (und hoffentlich nicht sein letzter, da ich seinen Stil wirklich genossen habe).",
  "Our beloved everywhere-helper, Blogger, Designer and StudioCMSer - [Lou](https:/.00B9B777867DC593B708": "Unser geliebter Allround-Helfer, Blogger, Designer und StudioCMS-Experte - [Lou](https://github.com/louisescher/) (übrigens danke, dass du mir im Voraus ein paar Tipps zum Blogschreiben gegeben hast, damit ich das hier selbstbewusster schreiben konnte 🤩) - sprang sofort auf diesen großartigen Hype-Zug (wie Twitch-Nutzer es nennen könnten) und veröffentlichte [seinen Anschlussartikel](https://lou.gg/blog/why-writing-blogs-isnt-hard) innerhalb von verdammten 12 Stunden!!! Glauben Sie mir, ich habe die Commits überprüft, Lou hat buchstäblich innerhalb von 4 Minuten nach Ablauf der 12 Stunden-Marke veröffentlicht.",
  "As I will include many references to both of their blogs, it's best if you read .2E1FCF6AB78B43DC2069": "Da ich viele Verweise auf beide ihrer Blogs einfügen werde, ist es am besten, wenn Sie zuerst ihre lesen. Und dann meinen. Oder vielleicht ist es besser, wenn Sie nur ihre lesen, ich bin mir noch nicht sicher, wie sich meiner entwickeln wird.",
  "But what I can ~~say~~ write, is that mine will fully focus on just the writing .FC4D0CF3F6082890E1EC": "Aber was ich sagen ~~kann~~ schreiben kann, ist, dass meiner sich vollständig auf die Schreibfähigkeiten konzentrieren wird.",
  "How to setup a blog (technical challenges)": "Wie man einen Blog einrichtet (technische Herausforderungen)",
  "Whilst this blog doesn't focus on how to build a blog, deploy it and all this te.460F9C9970BD9D6ED53F": "Auch wenn dieser Blog sich nicht darauf konzentriert, wie man einen Blog erstellt, bereitstellt und all diesen technischen Kram macht, möchte ich erwähnen, dass es jeder schaffen kann. Wie Lou erwähnte, können Sie als Nicht-Techniker immer einfach ein Konto auf [Medium](https://medium.com/) oder ähnlichen Alternativen erstellen. Wenn Sie sich ein wenig mit Programmierung auskennen, können Sie Ihrer Kreativität ein wenig mehr Raum geben. Dank des großartigen [Starlight Blog](https://starlight-blog-docs.vercel.app/) Projekts von [HiDeoo](https://github.com/HiDeoo) benötigen Sie nicht viel Wissen, um Ihre eigene Website bereitzustellen. Heutzutage, wo es auch PaaS (Platform as a Service)-Anbieter wie [Netlify](https://www.netlify.com/) gibt, die den Umgang zu einer Click-Ops Erfahrung machen, gibt es keine Ausrede mehr, warum technische Schwierigkeiten Sie daran hindern sollten, Ihren Blog zu veröffentlichen.",
  "Okay, jokes aside, now: Writing skills": "Okay, Spaß beiseite, jetzt: Schreibfähigkeiten",
  "But this blog should focus on mainly on the \"Writing Skill\" as I said, so let's .809BFECD79628A7D6401": "Aber dieser Blog sollte sich hauptsächlich auf die \"Schreibfähigkeiten\" konzentrieren, wie ich sagte, also machen wir dort weiter. Da ich selbst anfangs Schwierigkeiten hatte, Blogs zu schreiben, kann ich Jacob absolut zustimmen, dass der Einstieg schwierig ist. Es ist nicht wie das Durchlesen des [Astro \"Getting started\" Leitfadens](https://docs.astro.build/en/install-and-setup/), bei dem Sie nur den Anweisungen folgen müssen und dann auf Discord fragen, was ein `InvalidContentEntryDataError` bedeutet <sub>bitte verwenden Sie den `#support`-Thread, wenn Sie das tun 🫶</sub> ([Falls Sie sich immer noch wundern](https://docs.astro.build/en/reference/errors/invalid-content-entry-data-error/)).",
  "On the other hand, the goal seems so close and doable. Just write some words. Wh.D4B7EBAB98F3D78C25CA": "Auf der anderen Seite erscheint das Ziel so nah und machbar. Schreiben Sie einfach ein paar Worte. Was ist so schwer daran, diese verdammten Worte zu schreiben? Ehrlich gesagt weiß ich es selbst nicht. Warum fragen Sie mich? Das Einzige, was mir geholfen hat, aus der Spirale „Du-willst-schreiben-aber-jedes-Mal-wenn-du-den-blinkenden-Cursor-ansiehst-wird-dein-Hirn-leer“ (machen wir das zum Hashtag der Woche) herauszukommen, war Lous Tipp, am Anfang nicht so viel von sich selbst zu verlangen. Warum möchten Sie mit einem perfekten Blog beginnen? Nur wegen Ihres Rufs? Damit die Leute nichts Falsches von Ihnen denken? Enttäuscht sind? Ehrlich gesagt: Das ist Schwachsinn! Nicht nur, weil Ihr erster Blog sehr wahrscheinlich von niemandem gelesen wird (mit Ausnahme von Jacobs außergewöhnlichem Blog), sondern auch, weil Sie es sich nur schwerer machen. Meine persönliche mentale Grenze war, dass ich dachte, ich müsse mindestens 500 Wörter schreiben, um anzufangen. Aber wer sagt das? Um ehrlich zu sein, wenn ich jetzt zurückblicke, denke ich manchmal: „Mensch, es wäre so einzigartig und cool gewesen, wenn mein erster Blog wie ein normaler Tweet gewesen wäre“, oder noch extremer: Ein. Wort. Niemand wird Sie davon abhalten, diesen Blog zu veröffentlichen:",
  "Hello 👋": "Hallo 👋",
  "(Sorry if I now took your awesome idea,\\\nand included your whole blog post in he.2C4E38E676160D62D299": "(Entschuldigung, falls ich jetzt Ihre großartige Idee genommen habe,\\\nund Ihren gesamten Blogbeitrag hier eingefügt habe\\\n\\- wow cool, das reimt sich.)",
  "See? I can do whatever I want, even being a fricking poet (typical German behavi.CA4561FAF77C16255B02": "Sehen Sie? Ich kann tun, was ich will, sogar ein verdammter Poet sein (typisches deutsches Verhalten), und niemand wird mich verurteilen. Okay, vielleicht wird jemand diesen Blog hassen, weil er „Zeitverschwendung sei, kein Sinn in all diesen nutzlosen Inhalten“, aber wen interessiert’s, ***w e n***? Es ist *Ihr* Blog, <span id=\"comment-reference\" class=\"fragment-highlight\">niemand fragt nach deren Meinungen (es sei denn, Sie haben einen Kommentarbereich unter Ihrem Blog 🙄 *hust* [Lou](https://lou.gg/blog/why-writing-blogs-isnt-hard#chapter-five-its-the-8th-of-july)</span>). Also denken Sie nicht darüber nach, was andere über Ihren Schreibstil, Inhalt, Sprachgebrauch oder sogar Ihre Grammatikfehler denken könnten. All dies macht Sie menschlich, und alles perfekt hinzubekommen, ist nicht nur völlig unnötig, sondern auch [hrad](https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/#chapter-1---i-want-it-now).",
  "Another part of writing blogs is not just getting started, but the difficulty of.784B95527E097077F971": "Ein weiterer Bestandteil des Blogschreibens ist nicht nur der Einstieg, sondern auch die Schwierigkeit, einen Fluss, einen Gedanken, wenn Sie so wollen, aufrechtzuerhalten. Als Zuhörer gut geschriebener Reden bemerken Sie unterbewusst, dass sie gut waren, erfüllend, erhaben. Und das liebe ich an solchen Blogs oder Reden. Sie fühlen sich einfach irgendwie richtig an. Aber ich selbst habe akzeptiert, dass ich solche Errungenschaften in meiner eigenen kreativen Arbeit nicht erreichen kann. Und mit dieser Akzeptanz komme ich viel besser zurecht. Denn der Vorteil, Unvollkommenheit zu akzeptieren, besteht darin, Dinge fertig zu bekommen. Nicht nur zu 50 %, nicht nur zu 90 %. Fertig. Abgeschlossen, 100 %. Und das ist etwas, womit viele Menschen kämpfen, mich eingeschlossen - tatsächlich nur mich.",
  "But as Lou mentions, there are other easy methods to keep a common thread in the.18BEED3C4E5876FC95F2": "Aber wie Lou erwähnt, gibt es andere einfache Methoden, um einen roten Faden im gesamten Beitrag beizubehalten, der Geschichte treu zu bleiben, während Gedanken in Ihrem eigenen Kopf herumschweifen könnten. All diese Gedanken zu Papier zu bringen oder in diesem Fall auf die Tastatur, kann eine Herausforderung sein, besonders wenn Sie gerade erst mit dem Schreiben anfangen. Aber es gibt einen Grund, warum wir solche Fähigkeiten in der Schule lernen. Sie verbessern unsere kognitive Gesundheit und Entwicklung erheblich. Deshalb stimme ich Lou auch zu, wenn er sagt, dass KI im Schreibprozess niemals verwendet werden sollte. Es bringt weder für den Leser noch für Sie selbst irgendwelche Vorteile mit sich.",
  "So I don't want to repeat what Lou says, but bullet points have helped me out a .964F132C02AED6CE1634": "Ich möchte nicht wiederholen, was Lou sagt, aber Aufzählungspunkte haben mir in der Vergangenheit sehr geholfen. Sie geben mir das Gefühl von konstanter Struktur, während mein Geist mit verschiedenen Gedanken und Theorien spielen kann. So stelle ich sicher, dass ich immer wieder zu dem zurückkomme, was ich ursprünglich in meinen Beitrag aufnehmen wollte. „Und wenn Ihnen keine Aufzählungspunkte einfallen?“, könnten Sie fragen. Dann brauchen Sie möglicherweise noch mehr Brainstormings oder einfach Duschen.",
  "In the end, these are some tips I can give you along the way:": "Am Ende sind hier einige Tipps, die ich Ihnen mit auf den Weg geben kann:",
  "Develop your own writing style, not by training, but just writing. Sooner or lat.F84CA1A98AD5E28A3F69": "Entwickle deinen eigenen Schreibstil, nicht durch Training, sondern durch Schreiben. Früher oder später wirst du bemerken, welche Arten dir gefallen könnten, einige Dinge, die du von anderen Bloggern übernehmen möchtest, aber summa summarum wird das, was du schreibst, immer deins sein. Du teilst es einfach mit der Welt. Es liegt an dir, ob du hier und da einen Doppelpunkt oder Bindestrich verwenden möchtest, mehr Punkte, die Vergangenheitsform, den Imperativ, Schimpfwörter oder den formelleren Stil. All diese Dinge fügen sich automatisch zusammen und definieren dich als einzigartigen Blogger. Und deine Leser werden diese Individualität mehr schätzen, als du denkst.",
  "Don't take on too much. Might sound easy, but everyone falls regularly into this.F956D1FB960DB4CD026C": "Nimm dir nicht zu viel vor. Das klingt vielleicht einfach, aber jeder tappt regelmäßig in diese Falle. Oder vielleicht nur Leute wie ich, die eine Mischung aus Autismus und Perfektionismus haben – keine Ahnung.",
  "Although it always sounds stupid: Start writing. And if it doesn't work, start w.0018355B94E38C7B923C": "Auch wenn es immer dumm klingt: Fang an zu schreiben. Und wenn es nicht funktioniert, fang mit dem Mittelteil an. Denn ich weiß, Anfang und Ende sind immer schwierig, aber meiner Meinung nach flutscht der Mittelteil wie Butter.",
  "Blogs have easy and hard sides: This is what the title says, but know that I wro.72A914EB55320A9E44E4": "Blogs haben einfache und schwierige Seiten: Das ist, was der Titel sagt, aber wusstest du, dass ich beim Schreiben all dessen gemerkt habe, dass ich diese Frage überhaupt nicht beantwortet habe... Gott sei Dank hat Jacob am Ende dieses Vorschlags kein Fragezeichen gesetzt. 🙏",
  "Yeah, I guess that's it. If you want to share you thoughts, leave them in [Lou's.D2EA8444C7BDC5361790": "Ja, ich denke, das war's. Wenn du deine Gedanken teilen möchtest, hinterlasse sie in [Lous Kommentaren](https://lou.gg/blog/why-writing-blogs-isnt-hard), weil ich keine habe.",
  "Vibe-coding a VS Code Extension for Terraform projects": "Vibe-Coding einer VS Code-Erweiterung für Terraform-Projekte",
  "How I created an extension for Visual Studio Code which adds inline resolutions .94295B1957CBEE7AD731": "Wie ich eine Erweiterung für Visual Studio Code erstellt habe, die Inline-Resolutionen für Variablen in Terraform-Projekten hinzufügt.",
  "Today, I want to talk about a small VS Code extension that I vibe-coded in a sin.6C43E09851571E31F19E": "Heute möchte ich über eine kleine VS Code-Erweiterung sprechen, die ich an einem einzigen Tag vibe-codiert habe, um die Arbeit mit Terraform zu erleichtern. Zunächst erkläre ich, was Terraform ist, und gehe dann direkt auf die Funktionalität und die Gründe für diese Erweiterung ein. Fühlen Sie sich frei, den ersten Abschnitt zu überspringen, wenn Sie bereits mit Terraform vertraut sind.",
  "What is Terraform?": "Was ist Terraform?",
  "Terraform is an infrastructure-as-code (IaC) tool that lets you define your enti.C1E19D8A95C63B18257A": "Terraform ist ein Infrastructure-as-Code (IaC)-Tool, mit dem Sie Ihre gesamte Cloud- oder On-Premises-Infrastruktur als Code definieren können. Die von [HashiCorp](https://github.com/hashicorp) entwickelte Konfigurationssprache wird als HCL (HashiCorp Configuration Language) bezeichnet und bietet eine intuitive, menschenlesbare Syntax. Die *native Syntax* hat den Vorteil, dass die Lernkurve niedrig ist, sie für alle Anbieter konsistent ist und angenehm für Menschen zu lesen und zu schreiben ist, während die JSON-basierte Variante für Maschinen einfacher zu generieren und zu parsen ist.",
  "What makes Terraform very powerful are two basic features: **variables** and **m.F29F6CFC8D18A39724FE": "Was Terraform sehr leistungsfähig macht, sind zwei grundlegende Funktionen: **Variablen** und **Module**. Variablen ermöglichen es, Ressourcen zu erstellen, bei denen die tatsächlichen Werte von anderswoher eingefügt werden können, und Module gruppieren eine beliebige Anzahl von Ressourcen, was den Vorteil der Wiederverwendbarkeit und Verschachtelung hat. Während beide Funktionen sehr grundlegend erscheinen, bilden sie in Kombination ein Traumteam. Denn die Offenheit von Terraform ermöglicht es, Eingabevariablen für jedes Modul zu definieren und Variablen auch über Ausgaben zu exportieren.",
  "A simple module is therefore structured like this:": "Ein einfaches Modul ist daher wie folgt aufgebaut:",
  "azure-resource-group/": "azure-resource-group/",
  "main.tf": "main.tf",
  "variables.tf": "variables.tf",
  "outputs.tf": "outputs.tf",
  "README.md": "README.md",
  "All files except `main.tf` are optional (the `README.md` isn’t Terraform-specifi.C0AA6A4205B65B850BDC": "Alle Dateien außer `main.tf` sind optional (die `README.md` ist nicht spezifisch für Terraform), aber ich bevorzuge es, Best Practices zu folgen, daher beinhaltet das Beispiel diese Dateien.",
  "Let's look at a simple example. Imagine we want to manage a resource group in Az.C7130E93293C5F3835FA": "Schauen wir uns ein einfaches Beispiel an. Nehmen wir an, wir möchten eine Ressourcengruppe in Azure mit Terraform verwalten. In der Datei `variables.tf` definieren wir, welche Eingaben wir innerhalb des Moduls erwarten. Jeder der beiden Blöcke repräsentiert die Variable und die Eigenschaften der Variablen, wie die `description` oder den `type`:",
  "You might have noticed that the `location` variable also has a `default` propert.98D282B5427579CFCDE8": "Sie haben vielleicht bemerkt, dass die Variable `location` auch eine `default`-Eigenschaft hat, die die Variable optional macht und einen Fallback-Wert bietet, falls keiner angegeben wird. Diese Variablen können dann innerhalb der Datei `main.tf` verwendet werden. Hier definieren wir die tatsächlichen Ressourcen, die wir generieren möchten:",
  "In this case, we just define our simple resource group, which you can think of a.549C08D1FEC998D18486": "In diesem Fall definieren wir einfach unsere Ressourcengruppe, die Sie sich wie einen Ordner in Azure vorstellen können – eine sehr laienhafte Erklärung. Der letzte Teil, den wir umsetzen können, ist die Datei `outputs.tf`:",
  "This is very useful if we want to use information like the ID of the resource gr.EB0A3E52AB5C3982D204": "Dies ist sehr nützlich, wenn wir Informationen wie die ID der Ressourcengruppe später in anderen Teilen unseres Terraform-Projekts verwenden möchten.",
  "As I already wrote, the `README.md` is not actually part of the Terraform defini.E6BDEA6D28A17F85099B": "Wie ich bereits geschrieben habe, ist die `README.md` tatsächlich kein Teil der Terraform-Definitionen, hilft uns jedoch, den Zweck des Moduls zu verstehen:",
  "As the `README.md` already suggests, we can now use this module to create an Azu.A94748FE0C01D4120745": "Wie die `README.md` bereits andeutet, können wir dieses Modul jetzt verwenden, um eine Azure-Ressourcengruppe überall innerhalb unseres Projekts zu erstellen. Wir müssen nur sicherstellen, dass der Pfad zum Modul-Ordner korrekt ist und Terraform die Dateien `main.tf`, `variables.tf` und `outputs.tf` interpretieren kann. In diesem Fall, da wir die Variable `location` nicht angeben, wird sie auf `\"westeurope\"` gesetzt.",
  "I hope this section gave you a better basic understanding of what Terraform is a.8558BAB715B916ACA2AE": "Ich hoffe, dieser Abschnitt hat Ihnen ein besseres grundlegendes Verständnis dafür gegeben, was Terraform ist und was Sie damit tun können.",
  "The tedious task of Terraform": "Die mühsame Aufgabe mit Terraform",
  "You might have noticed that the `source` field of a module creates an awesome fl.8E968461FC7650C53259": "Sie haben vielleicht bemerkt, dass das Feld `source` eines Moduls eine erstaunliche Flexibilität für das gesamte Projekt schafft, da Sie Module überall definieren und überall im Projekt verwenden können.",
  "However, this feature also has a huge drawback when it comes to maintainability:.648C608F44A24AAF64E1": "Dieses Feature hat jedoch einen großen Nachteil in Bezug auf die Wartbarkeit: Das Auflösen der tatsächlichen Werte hinter Variablen kann sehr mühsam sein. Während es in diesem einfachen Beispiel leicht zu verwalten scheint, desto größer das Projekt wird und je verschachtelter es ist, desto schwieriger und zeitaufwändiger wird das Verstehen und Anpassen von Terraform-Code. Deshalb habe ich eine Erweiterung erstellt.",
  "**What should the extension do?** The main goal of the extension is to provide t.8B7ACE467BC6CBF2D8B5": "**Was sollte die Erweiterung tun?** Das Hauptziel der Erweiterung ist es, die tatsächlichen Werte der Variablen überall dort bereitzustellen, wo sie verwendet werden. Wenn ein Modul von mehreren Stellen oder einfach mehreren Malen aufgerufen wird, sollten die Informationen bereitstellen, welcher Anwendungsfall die Variable auf welchen Wert setzt. Wenn Module tief verschachtelt sind, sollten die Werte aufgelöst werden, bis wir die `.tfvars`-Dateien erreichen. Dies sind die Dateien, in denen Sie die fest kodierten Werte für Variablen definieren können.",
  "How to start a VS Code extension": "So starten Sie eine VS Code-Erweiterung",
  "Creating the basic template project for a VS Code extension is as easy as runnin.6F4EB3BBD45F5DF0A520": "Das Erstellen des grundlegenden Template-Projekts für eine VS Code-Erweiterung ist so einfach wie das Ausführen dieses Befehls, wenn Sie [Node](https://github.com/nodejs) installiert haben:",
  "This command temporarily installs the Yeoman (a generator software), and enters .5FDA5DDC43BF09081006": "Dieser Befehl installiert temporär Yeoman (eine Generator-Software) und öffnet einen interaktiven Modus, in dem einige Fragen beantwortet werden müssen, wie der Projektname, der Typ und die Beschreibung. Im folgenden Block sehen Sie alle Fragen und Standardantworten:",
  "For further information regarding VS Code extensions I want to link to [the offi.B0448C131D881366A635": "Weitere Informationen zu VS Code-Erweiterungen möchte ich im [offiziellen Dokumentation](https://code.visualstudio.com/api/get-started/your-first-extension) verlinken, da sie immer aktueller im Gegensatz zu meinen Erklärungen hier ist.",
  "3… 2… 1… Vibe-Coding!": "3… 2… 1… Vibe-Coding!",
  "I like to start new projects by asking [ChatGPT](https://github.com/openai) for .FD250EAE4277C6E99E2B": "Ich beginne gerne neue Projekte, indem ich [ChatGPT](https://github.com/openai) nach allgemeinen technischen Fragen frage wie:",
  "How would you suggest achieving such a project?": "Wie würden Sie vorschlagen, ein solches Projekt umzusetzen?",
  "How long do you estimate it will take me?": "Wie lange schätzen Sie, dass es dauern wird?",
  "How difficult will it be?": "Wie schwierig wird es sein?",
  "Brainstorming with AI bots seems like a very sensible way to get a better overvi.59F0199CCC0E7F65A0D7": "Das Brainstorming mit KI-Bots scheint ein sehr sinnvoller Weg zu sein, um sich einen besseren Überblick über neue Projekte zu verschaffen, insbesondere wenn man in völlig neue Gewässer eintaucht. Eine VS Code-Erweiterung zu erstellen, war genau ein solcher Anwendungsfall, da ich noch nie zuvor etwas für VS Code oder eine andere IDE erstellt hatte. Nach dieser anfänglichen Brainstorming-Phase bevorzuge ich [Claude](https://github.com/anthropics), um alle notwendigen Dateien für eine solche Erweiterung zu programmieren, da dieser KI-Bot meiner Erfahrung nach in der Lage ist, Code wirklich präzise umzusetzen. Ich habe kaum Fehler oder Laufzeitprobleme mit Claude-Code erlebt, sodass ich ihn genau für solche Anwendungsfälle nutze – Initialstarter. Der Nachteil von Claude ist sein sehr begrenztes kostenloses Testangebot, weshalb ich beim Formulieren meiner Worte immer vorsichtig bin und versuche, im Voraus an so viele mögliche Fehler der KI zu denken wie möglich. So begann es also: Ich nahm mir etwas Zeit, um mein genaues Szenario und meinen Wunsch in die begrenzten Kontextfenster einer zufälligen Wortmaschine namens Claude zu formulieren und erhielt sofort eine riesige `extension.ts`-Implementierung. Natürlich gab es offensichtliche Unterschiede zwischen meiner Vision und der Kommunikation mit diesem LLM, weshalb ich ihm ein weiteres Mal erklären musste, was die wichtigen Überlegungen sind, und um weiteren Code zu erhalten, nutzte ich auch meinen magischen Trick: \"Wenn das zu groß für eine Datei ist, geben Sie mir einfach die gesamte `extension.ts` in mehreren Dateien, die natürlich funktionieren sollte.\"",
  "Claude then went on a long journey.": "Claude begab sich dann auf eine lange Reise.",
  "After some struggling to keep it going my tokens were all used and I had to figu.2D452B77249C8430A480": "Nach einigen Kämpfen, es weiter am Laufen zu halten, waren meine Tokens aufgebraucht und ich musste den verbleibenden Code selbst herausfinden. Dennoch gelang es mir, eine laufende Version zu erstellen, da nicht viel fehlte, und bemerkte sofort einige Verbesserungen, die bislang unbemerkt geblieben waren. Da ich auf die Wiederauffüllung meiner Tokens warten musste, tat ich genau das.",
  "The next morning the improvement session began, and after two long conversations.D0F806E5F02FCADFF975": "Am nächsten Morgen begann die Verbesserungssitzung, und nach zwei langen Gesprächen war das Kontextfenster komplett gefüllt, und ich konnte keine Nachrichten mehr im selben Chat senden, obwohl meine Tokens noch nicht abgelaufen waren. Doch alles, was ich von Claude erreichen und erhalten wollte, war nun verfügbar, und ich konnte einige Tests in einem meiner größeren Projekte durchführen. Nachdem ich den Code manuell bestätigt und angepasst hatte, war ich zunächst zufrieden und entschied, dass die erste öffentliche Version fertig war.",
  "Some trial and error with [GitHub Actions](https://github.com/github) later, I m.B1A6CFA9C8791F3B0E65": "Nach einigem Ausprobieren mit [GitHub Actions](https://github.com/github) gelang es mir, den [Publisher für eine VS Code-Erweiterung einzurichten](https://code.visualstudio.com/api/working-with-extensions/publishing-extension#create-a-publisher). Und zwei Patch-Versionen später war ich ziemlich zufrieden mit den Ergebnissen.",
  "The Final Result": "Das Endergebnis",
  "Try out the extension yourself by clicking on the button below. There are still .53D329C6D712DEFF0967": "Probieren Sie die Erweiterung selbst aus, indem Sie auf den unten stehenden Button klicken. Es gibt noch viele Verbesserungsmöglichkeiten, also zögern Sie nicht, mitzuhelfen, wenn Sie interessiert sind. Sie können dies gerne auf [GitHub](https://github.com/trueberryless/terraform-variables-resolution) tun.",
  "Install Terraform Variables Resolution": "Terraform Variables Resolution installieren",
  "Here you can see the example from [the Terraform explanation](#what-is-terraform.772358BC6F4987371F60": "Hier sehen Sie das Beispiel aus [der Terraform-Erklärung](#what-is-terraform), das zeigt, wie diese Erweiterung die Werte der Variablen visuell in VS Code hinzufügt:",
  "![Terraform Variables Resolution Example](../../../assets/terraform/terraform-va.94526691E47AD9D882F5": "Beispiel für Terraform Variables Resolution",
  "How I Built a GitHub Profile README That Shouldn’t Exist (But It Does)": "Wie ich ein GitHub-Profil-README gebaut habe, das nicht existieren sollte (aber es tut)",
  "A deep dive into the technical challenges and solutions behind my GitHub profile.8493E1B06B7E9BE16E95": "Ein tiefgehender Einblick in die technischen Herausforderungen und Lösungen hinter meinem GitHub-Profil-README, mit Schwerpunkt auf SVG-Manipulation, Automatisierung und einem dynamischen Bento-Grid.",
  "Creating a standout <a class=\"gh-badge\" href=\"https://github.com/github\"><img sr.EC7EC3169C3D5076914B": "Ein herausragendes <a class=\"gh-badge\" href=\"https://github.com/github\"><img src=\"https://github.com/github.png\" alt=\"github\" />GitHub</a>-Profil-README zu erstellen, bedeutet nicht nur, ein paar Abzeichen hinzuzufügen — es geht darum, technische Grenzen zu überwinden. In diesem tiefgehenden Artikel erkunde ich grundlegende SVG-Manipulation, HTML-zu-SVG-Konvertierung, Inline-Animationen und vollständige Automatisierung mit GitHub Actions, um eines der technisch fortschrittlichsten GitHub-READMEs zu bauen. Von einem dynamischen Bento-Grid, das sich alle 5 Minuten aktualisiert, bis hin zur Einbettung von Live-SVGs ohne externe Anfragen – dieses Projekt hat mein Profil in eine lebendige, sich selbst aktualisierende Präsentation meiner Arbeit verwandelt. Möchtest du wissen, wie ich das gemacht habe? Lass es uns aufschlüsseln. 🚀",
  "Read the more formal story [here](https://trueberryless.org/work/github-profile-.5BCD9DBA0F2103014075": "Lies die formellere Geschichte [hier](https://trueberryless.org/work/github-profile-readme/)",
  "The Beginning: A README That Looked Like a Wikipedia Dump": "Der Anfang: Ein README, das wie ein Wikipedia-Dump aussah",
  "Every great story starts with a problem, and mine was simple: my [GitHub profile.3713BD43F2A1A91BFB7E": "Jede großartige Geschichte beginnt mit einem Problem, und meines war einfach: Mein [GitHub-Profil](https://github.com/trueberryless) README war ein komplettes Chaos. Es war lang. Es hatte zu viel Text. Es war überfüllt mit Abzeichen — so viele, dass es aussah, als würde ich jede mögliche Internet-Trophäe horten. Hackathons, GitHub-Beiträge, Astro, roadmap.sh — wenn es ein Abzeichen gab, hatte ich es.",
  "At first, I thought this was fine. It showed everything about me, right? But one.773B7C308644FEDA7081": "Am Anfang dachte ich, das wäre in Ordnung. Es zeigte schließlich alles über mich, oder? Aber eines Tages sah ich es an und stellte fest:",
  "This is not stylish. This is a cluttered disaster.": "Das ist nicht stilvoll. Das ist ein überladenes Desaster.",
  "I needed something new. Something clean. Something visually striking. I wanted a.C82835C3D13A6981B63B": "Ich brauchte etwas Neues. Etwas Sauberes. Etwas Visuell Beeindruckendes. Ich wollte ein **Bento-Grid**, das die Leute dazu bringt, stehen zu bleiben und es zu bewundern, anstatt verwirrt daran vorbeizuscrollen. Ein Design, das so gut ausgeführt ist, dass jeder, der es sieht, sofort eines für sich haben wollte.",
  "That was the dream. Now I just had to make it real.": "Das war der Traum. Jetzt musste ich ihn nur noch realisieren.",
  "Phase 1: The HTML Dream (and Markdown Nightmare)": "Phase 1: Der HTML-Traum (und Markdown-Albtraum)",
  "The first step was simple: mock up my perfect profile in HTML and CSS. And let m.EEFE6C2742301B518D46": "Der erste Schritt war einfach: Entwerfen meines perfekten Profils in HTML und CSS. Und ich kann dir sagen, es sah unglaublich aus. Es hatte das perfekte Layout, sanfte Animationen und genau das richtige Gleichgewicht zwischen Inhalt und Raum. Dann kam die Realität. Dies musste innerhalb von *GitHub-Flavored Markdown* funktionieren. Kein Problem, oder? Markdown unterstützt HTML! Also kopierte ich mein wunderschönes HTML in mein README und drückte Speichern.",
  "[GitHub](https://github.com/github): *Absolutely not.*": "[GitHub](https://github.com/github): *Absolut nicht.*",
  "GitHub’s Markdown [strips out a not a huge number of HTML tags, but important on.8ADCE02DB7CC7739FAD2": "GitHubs Markdown [entfernt zwar keine große Anzahl von HTML-Tags, aber wichtige](https://github.github.com/gfm/#disallowed-raw-html-extension). Aus Sicherheitsgründen natürlich (und ich respektiere das vollkommen, GitHub, wirklich ❤️), aber das bedeutete, dass mein perfektes Design komplett **unbrauchbar** war.",
  "I tried tweaking it. Replacing unsupported tags with ones that worked. Maybe I c.14452FE82B6AC0DB8958": "Ich versuchte, es anzupassen. Ungestützte Tags durch solche zu ersetzen, die funktionierten. Vielleicht könnte ich etwas davon retten? *Nein*. Die Einschränkungen von Markdown bedeuteten, dass mein Traum-Layout unmöglich war.",
  "Phase 2: The \"Just Use a Python Script\" Cope": "Phase 2: Der \"Einfach Ein Python-Skript Benutzen\"-Kompromiss",
  "When in doubt, automate. If I couldn’t get my HTML in directly, maybe I could ge.FD6C9ADF71816E0E5B49": "Wenn man unsicher ist, automatisieren. Wenn ich mein HTML nicht direkt einfügen konnte, konnte ich vielleicht etwas Dynamisches mit einem Skript erstellen? Also bastelte ich ein Python-Skript, das mein neuestes GitHub-Repository abruft und in mein README einfügt. Hier einfach ein paar zufällige Bytes, die manche als Python-Code bezeichnen:",
  "This seemed like a step in the right direction. It was automated. It was functio.D20A833F97288BD3E73B": "Das schien ein Schritt in die richtige Richtung zu sein. Es war automatisiert. Es funktionierte. Aber es löste mein eigentliches Problem nicht. 😢",
  "This wasn’t about dynamic content — it was about *design*. And no amount of Pyth.8C914CE49CA59FC373EC": "Es ging nicht um dynamischen Inhalt — es ging um *Design*. Und kein Skript der Welt konnte Markdown schön machen.",
  "Phase 3: \"Fine, I'll Just Use a Screenshot\" (Rock Bottom)": "Phase 3: \"Na Gut, Ich Nehme Einfach Einen Screenshot\" (Tiefpunkt)",
  "At this point, I was desperate. I considered the unthinkable: *just take a scree.A573BC6FDCB7D404B86F": "Zu diesem Zeitpunkt war ich verzweifelt. Ich dachte an das Undenkbare: *Einfach einen Screenshot vom HTML machen und ihn als Bild in mein README einfügen.* Es war ein brutaler Ansatz. Es war faul. Es war... effektiv?",
  "For a moment, I actually thought about doing it. But I knew deep down that I wou.F11BA1015DB80A5D8D2D": "Einen Moment lang dachte ich tatsächlich darüber nach, es zu tun. Aber tief im Inneren wusste ich, dass ich mir nie verzeihen würde, wenn ich das als endgültige Lösung akzeptieren würde.",
  "Just for the reference, I would have used [Puppeteer](https://www.npmjs.com/pack.7C033B35BC935C314B6E": "Zur Referenz hätte ich [Puppeteer](https://www.npmjs.com/package/puppeteer) und [FFmpeg](https://www.ffmpeg.org/) verwendet — keine Ahnung, was diese Tools sind.",
  "Phase 4: Enter SVG (The Light at the End of the Tunnel)": "Phase 4: SVGs treten auf den Plan (Das Licht am Ende des Tunnels)",
  "I abandoned the cursed screenshot plan and looked for something more flexible.": "Ich ließ den verfluchten Screenshot-Plan fallen und suchte nach etwas Flexiblerem.",
  "SVGs.": "SVGs.",
  "SVGs could scale, they supported both text and images, and — most importantly — .F259141963EA4A11F694": "SVGs konnten skalieren, sie unterstützten sowohl Text als auch Bilder, und — was am wichtigsten war — sie konnten **HTML innerhalb von ihnen einbetten**.",
  "So I tried something like this:": "Also versuchte ich etwas wie das:",
  "Promising! This could actually work!": "Vielversprechend! Das könnte tatsächlich funktionieren!",
  "Then I got busy with other things, forgot to debug it, and never returned to thi.9BEE5D08ED4C8C9B33DD": "Dann wurde ich mit anderen Dingen beschäftigt, vergaß, es zu debuggen, und kehrte nie zu dieser Idee zurück.",
  "![Throw away a good idea](../../../../public/online-classes-throw-away.gif)": "Eine gute Idee verwerfen",
  "Phase 5: SVGs Within SVGs Within SVGs (Inception Level 100)": "Phase 5: SVGs in SVGs in SVGs (Inception-Stufe 100)",
  "When I came back to the project, I was **determined** to make it work.": "Als ich zum Projekt zurückkehrte, war ich **entschlossen**, es zum Laufen zu bringen.",
  "I realised that if I couldn’t directly embed HTML into Markdown, I could fake it.8993D07A86C6FB209386": "Ich stellte fest, dass ich, wenn ich HTML nicht direkt in Markdown einbetten konnte, es durch verschachtelte SVGs vortäuschen konnte. (Übrigens ist das massiv vereinfacht; der eigentliche Prozess dauerte Tage, die sich wie Wochen anfühlten, wenn nicht Monate, aber ich weiß, dass du sowieso nichts davon lesen würdest, also wen interessiert's?)",
  "And then, after hours of research, I stumbled across a life-changing Stack Overf.B19E66FB6CDC38EB7F45": "Und dann, nach Stunden der Recherche, stieß ich auf eine lebensverändernde Stack Overflow-Antwort:",
  "This lead me to the current solution:": "Das führte mich zur aktuellen Lösung:",
  "Convert my HTML layout to SVG.": "Mein HTML-Layout nach SVG konvertieren.",
  "Encode all images in **Base64** (because GitHub Markdown won’t load external ima.6BA37AFF26936D15AD36": "Alle Bilder in **Base64** codieren (da GitHub-Markdown keine externen Bilder in einem SVG mit HTML lädt).",
  "Inline dynamic SVGs (like my GitHub stats, Spotify status, etc.).": "Dynamische SVGs einbetten (wie meine GitHub-Statistiken, Spotify-Status usw.).",
  "Automate everything with **GitHub Actions**.": "Alles mit **GitHub Actions** automatisieren.",
  "The Grand Finale: The Ultimate GitHub Profile README": "Das große Finale: Das ultimative GitHub-Profil-README",
  "A sleek Bento Grid layout, perfectly structured in SVG.": "Ein schlankes Bento-Grid-Layout, perfekt in SVG strukturiert.",
  "A live-updating Spotify status, inlined as an SVG.": "Ein live-aktualisierender Spotify-Status, in SVG eingebettet.",
  "GitHub stats, dynamically inserted via automation.": "GitHub-Statistiken, dynamisch über Automatisierung eingefügt.",
  "Fully responsive, fully scalable, and fully insane to build.": "Vollständig responsiv, vollständig skalierbar und vollkommen verrückt zu erstellen.",
  "It updates itself every 5 minutes, runs completely on GitHub Actions, and doesn’.D6DD34ED3B85DAE2F120": "Es aktualisiert sich alle 5 Minuten selbst, läuft vollständig über GitHub Actions und ist unabhängig von externen Diensten. Es ist wunderschön. Es ist effizient. Und am wichtigsten, es ist technisch absurd auf die beste Art und Weise.",
  "Take a look at a specific example of the final results at some point back in tim.096EC0AF4A7E3D30CE29": "Schauen Sie sich ein konkretes Beispiel der Endergebnisse irgendwann in der Vergangenheit an.",
  "Isn't that bad compared to the [old README.md](https://github.com/trueberryless/.E3E5E0072DF705843179": "Das ist nicht schlecht im Vergleich zum [alten README.md](https://github.com/trueberryless/trueberryless/blob/5dce4ad0033b00829f8ec3756827057017447a65/README.md). Und kommentiere nicht, warum ich K-Pop höre! Es ist besser, als du denkst, glaub mir.",
  "Check out the live version on my GitHub [trueberryless](https://github.com/trueb.4FFADA956CF12B9EFE9F": "Sieh dir die Live-Version auf meinem GitHub [trueberryless](https://github.com/trueberryless) an — falls ich beschlossen habe, sie zu behalten... — und folge mir, wenn du schon da bist, falls dir das Lesen gefallen hat! ❤️",
  "Final Thoughts: Was It Worth It?": "Abschließende Gedanken: War es das wert?",
  "Absolutely.": "Absolut.",
  "This journey was frustrating, time-consuming, and filled with more roadblocks th.9E6BE12D4EDD580594EA": "Diese Reise war frustrierend, zeitaufwendig und voller Hindernisse, mit denen ich nie gerechnet hätte. Aber ich habe so viel über SVGs, die Einschränkungen von Markdown, GitHub Actions und Automatisierung gelernt.",
  "Would I do it again? Definitely.": "Würde ich es wieder tun? Definitiv.",
  "Would I recommend it? Only if you have way too much patience. 😅": "Würde ich es empfehlen? Nur, wenn du eine Menge Geduld hast. 😅",
  "But in the end, I created a [GitHub](https://github.com/github) profile README t.2B7EC6933681A24E2F33": "Aber am Ende habe ich ein [GitHub](https://github.com/github)-Profil-README erstellt, das *nicht existieren sollte* — aber es existiert. Und ich liebe es.",
  "A short history of Starlight Sidebar Topics plugins": "Eine kurze Geschichte der Starlight Sidebar Topics Plugins",
  "In this blog post, I'll show you the evolution of Starlight plugins with a case .4AA6D9FADD1A6BE13985": "In diesem Blogbeitrag zeige ich Ihnen die Entwicklung der Starlight-Plugins anhand einer Fallstudie zum Starlight Sidebar Topics Plugin.",
  "In this post, I'll show you the evolution of <a class=\"gh-badge\" href=\"https://g.995EB19ECCFE1867C83C": "In diesem Beitrag zeige ich Ihnen die Entwicklung der <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" />Starlight</a>-Plugins anhand einer Fallstudie des [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar-topics) Plugins. Seien Sie darauf gefasst, beeindruckende Fakten über Menschen und Code rund um Starlight zu entdecken.",
  "Maybe you have heard about this cool documentation framework before. I talk abou.5A104B8E7F80C4B25128": "Vielleicht haben Sie schon einmal von diesem coolen Dokumentationsframework gehört. Ich spreche oft darüber und benutze es regelmäßig. Nicht nur, weil ich ein aktiver Mitwirkender bin, sondern auch, weil [Starlight](https://starlight.astro.build) mir einfach ans Herz gewachsen ist. Seine Funktionen: Einfachheit und Minimalismus, aber alles, was man braucht. Seine Leistung: [Schneller als 98 % der anderen Websites](https://www.websitecarbon.com/website/starlight-astro-build-getting-started/). Seine Barrierefreiheit: Keine Frage!",
  "The Creation": "Die Entstehung",
  "However, one thing that's objectively missing in my opinion is a granular way of.DBB9BD2B7C991AECF1AF": "Eine Sache, die aus meiner Sicht objektiv fehlt, ist eine granulare Möglichkeit, breite Themen in Ihrer Dokumentation zu trennen. Und ich bin nicht allein mit dieser subjektiv allgemein akzeptierten Meinung. [HiDeoo](https://github.com/HiDeoo) ist nicht nur einer der aktivsten Maintainer des Projekts, sondern auch der Autor der meisten und meiner Meinung nach besten Plugins, die man für Starlight finden kann. Und auch ihnen fiel diese fehlende Nischenfunktionalität bei Themen auf. Deshalb haben sie im Oktober 2024, also relativ früh, das [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar-topics) Plugin erstellt, mit dem man eine Seitenleiste mit Themen erstellen kann. Lesen Sie mehr über die Funktionen des Plugins in [der Dokumentation](https://starlight-sidebar-topics.trueberryless.org/).",
  "The one thing that bothered me personally in the early days of the plugin was th.6F5F49BB9B5B06675F60": "Das Einzige, was mich in den frühen Tagen des Plugins persönlich gestört hat, war die Art und Weise, wie die Themen in der Seitenleiste angezeigt wurden. Es verwendet - im Gegensatz zu der von mir vorgestellten Lösung - keine Art Dropdown-Menü zum Wechseln zwischen Themen, sondern zeigt stattdessen immer alle Themen an. Diese Designentscheidung war, wie [HiDeoo klar hervorhebt](https://github.com/HiDeoo/starlight-sidebar-topics/issues/2#issuecomment-2410196392), sehr bewusst und nicht ohne Grund: Alle Themen sollen auf einmal sichtbar sein. Bewiesen durch die [Astro](https://github.com/withastro) Dokumentation selbst ([Chris Swithinbank](https://github.com/delucis) implementierte die [\"Tab-Leiste\"](https://github.com/withastro/docs/pull/9890) für die Astro v5 Dokumentation später im selben Monat), hat dieser Ansatz definitiv viele Vorteile gegenüber einem Dropdown-Menü. Dennoch war ich weiterhin mit diesem Design unzufrieden, und so habe ich meine eigene Version erstellt.",
  "Copying and pasting was my strength when it came to building a new Starlight plu.860638CCB2BA61F003E9": "Kopieren und Einfügen war meine Stärke, wenn es darum ging, ein neues Starlight-Plugin für die Community zu erstellen. Und so habe ich es einfach getan. Ich nahm das Starlight Sidebar Topics Plugin als Ausgangspunkt und musste nur das `Topics.astro`-Komponente anpassen, das das HTML für die Darstellung der Themen in der Seitenleiste enthält. Nachdem ich einige Zeit damit gekämpft hatte, ein zufriedenstellendes Dropdown-Menü zu implementieren, das nur aus HTML und CSS bestand, aber auch optisch ansprechend war (Entschuldigung für das Eigenlob, ich bin einfach stolz auf mich), habe ich endlich eine Lösung gefunden, mit der ich sehr zufrieden bin, und habe dieses neue Plugin unter dem Namen [Starlight Sidebar Topics Dropdown](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown) veröffentlicht - wie originell.",
  "The Adaptation": "Die Anpassung",
  "You might think that this story is now over because everyone could just use the .B22BDA5C191E4AEC54CE": "Man könnte denken, dass diese Geschichte jetzt zu Ende ist, weil jeder einfach die Variante verwenden könnte, die er möchte, und jeder glücklich ist. Aber Starlight hat sich kontinuierlich verbessert, und etwa drei Monate später, am 15. Februar, wie ein [Geburtstagsgeschenk](https://trueberryless.org/work/20th-birthday/) für mich, kam die langersehnte Hinzufügung von Routen-Daten in Starlight mit der Veröffentlichung von [v0.32](https://github.com/withastro/starlight/releases/tag/@astrojs/starlight@0.32.0). Diese scheinbar kleine Ergänzung eröffnete so viele Möglichkeiten, die ich selbst nie vorausgesehen habe. HiDeoo war erneut die treibende Inspirationsquelle für Plugin-Autoren und nutzte diese neue Funktionalität voll aus. Es dauerte nur zwei Tage, um [über 11 Plugins an die neueste Starlight-Version anzupassen](https://bsky.app/profile/hideoo.dev/post/3liffpudc5c2b), und später verbesserten und überarbeiteten sie viel vom Code, um diese leistungsstarke Funktion noch besser zu nutzen.",
  "And so comes the day when HiDeoo contacts me to tell me that the Starlight Sideb.CB4E9F542FB4DC96204E": "Und so kam der Tag, an dem HiDeoo mich kontaktierte, um mir mitzuteilen, dass das Starlight Sidebar Topics Plugin nun die neue Routen-Daten-Funktion von Starlight nutzt. Zuerst verstand ich nicht ganz, welchen Nutzen diese Implementierungsänderungen haben würden, aber dann nahm sich HiDeoo die Zeit, mir zu erklären, dass ich das Starlight Sidebar Topics Dropdown Plugin jetzt in eine einfache Komponente umwandeln könnte, die die Routen-Daten aus seinem Plugin verwendet. Intuitiv war ich gegen diese clevere Idee, weil es sich anfühlte, als würde mein einziges Plugin, das etwas Popularität erlangt hatte, in eine nutzlose Komponente verwandelt. Ich hätte nicht weiter von der Wahrheit entfernt sein können.",
  "The Union": "Die Vereinigung",
  "Eventually, I decided to refactor my plugin into a component - this refactoring .4324540ABE36305F27C5": "Schließlich beschloss ich, mein Plugin in eine Komponente umzuwandeln - diese Umstrukturierung eliminierte beiläufig genau [1210 Zeilen Code und fügte 68 Änderungsprotokollzeilen hinzu](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown/pull/40) - und ich bemerkte, wie wenig Code es jetzt erforderte, um die `Topics.astro` Liste aus der Perspektive eines Nutzers in ein Dropdown zu verwandeln. Ich war zuversichtlich, dass dies wirklich die richtige Richtung für die ~~Plugin~~ Komponente war. Also aktualisierte ich die gesamte Dokumentation - eher: löschte über 200 Zeilen Text (fühlt sich gut an) - und veröffentlichte die neue [Version 0.5](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown/releases/tag/starlight-sidebar-topics-dropdown%400.5.0).",
  "Now you might wonder how such mature plugins could still improve over time. To b.8F9AABD213A178EFB11C": "Jetzt fragen Sie sich vielleicht, wie solch ausgereifte Plugins sich noch weiter verbessern können. Um ehrlich zu sein, ich selbst war sehr überrascht, als HiDeoo mir beiläufig eine Bombe in meine Discord-DMs fallen ließ. Seine Idee war und ist immer noch genial. Andernfalls würde ich nicht einmal mehr an dieses *Thema* denken. Aber hier bin ich und schreibe satte 800 Worte, nur um Sie auf das kommende vorzubereiten. Trommelwirbel bitte! Anschnallen! Diese Aussage von HiDeoo wird Sie umhauen:",
  "\"One could have something like the default built-in list on a desktop view, and .D9D8BC0B8C5FADE63015": "„Man könnte auf einer Desktop-Ansicht etwas wie die standardmäßig eingebaute Liste und auf mobilen Geräten Ihre Komponente oder so etwas verwenden 🧠“ — HiDeoo, 21/03/2025 09:54",
  "Profound. Timeless. Golden.": "Tiefgründig. Zeitlos. Golden.",
  "And that single, beautiful spark of an idea? It’s precisely what I’ll guide you .D5B772B8E2ED479D7F54": "Und diese einzige, wunderschöne Idee? Genau darüber werde ich Ihnen im Beitrag [„Starlight Topics Dropdown und List zusammen“](/blog/starlight-dropdown-and-list-together/) berichten.",
  "How to make your Starlight sidebar items look better": "Wie Sie die Elemente Ihrer Starlight-Seitenleiste verbessern können",
  "In this blog post, we'll take a look at how small changes can make a big differe.710EB546A7825319B5BD": "In diesem Blogbeitrag werfen wir einen Blick darauf, wie kleine Änderungen bei Leerzeichen, Schriftgrößen, -gewichten und -farben in Ihrer Starlight-Seitenleiste einen großen Unterschied machen können.",
  "In this blog post, we'll take a look at how small changes can make a big differe.91CB4D1869F959776162": "In diesem Blogbeitrag werfen wir einen Blick darauf, wie kleine Änderungen bei Leerzeichen in Ihrer <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" />Starlight</a>-Seitenleiste einen großen Unterschied machen können.",
  "Have you ever wondered why your [Starlight][starlight] sidebar doesn't look that.1641BC1FAEE439920C90": "Haben Sie sich jemals gefragt, warum Ihre [Starlight][starlight]-Seitenleiste nicht so ansprechend aussieht? Wussten Sie, wie wichtig der Platz zwischen den Elementen in Ihrer Seitenleiste unbewusst ist? Die Schriftgröße, das Gewicht und kleine Farbabstufungen? In diesem Leitfaden werfen wir einen Blick darauf, wie Sie das Erscheinungsbild Ihrer Starlight-Seitenleiste mit ein paar schnellen und einfachen Schritten anpassen können.",
  "Prerequisites": "Voraussetzungen",
  "First, you need to [set up your Starlight site][starlight-getting-started]. Afte.DF558576AB082588D034": "Zuerst müssen Sie Ihre [Starlight-Seite einrichten][starlight-getting-started]. Anschließend bietet Starlight einen [Leitfaden zur Anpassung von Stilen, die auf Ihre Starlight-Seite angewendet werden][starlight-css], und genau dieses Feature werden wir heute verwenden.",
  "As described in [this guide][starlight-css-custom], you need to create a `.css` .0CD83940C89F2D1185A1": "Wie in [diesem Leitfaden][starlight-css-custom] beschrieben, müssen Sie eine `.css`-Datei irgendwo in Ihrem `src/`-Verzeichnis erstellen, in der Sie Ihre CSS-Stile definieren können. Vergessen Sie nicht, den Pfad zu dieser `.css`-Datei in Starlight's `customCss`-Array in `astro.config.mjs` hinzuzufügen:",
  "After completing these preparation steps, you are ready to try out some nice adj.DE7E5B1DE51E76B69982": "Nach Abschluss dieser Vorbereitungsschritte sind Sie bereit, einige schöne Anpassungen am Design der Starlight-Seitenleiste auszuprobieren.",
  "Customizations": "Anpassungen",
  "There are endless different possibilities that you can play around with just wit.315492DDFA6948DAD882": "Es gibt unendlich viele Möglichkeiten, mit Ihrem benutzerdefinierten CSS zu experimentieren. Ich werde Ihnen einige Ideen geben, die ich selbst beim Spielen mit dem Design der Seitenleiste sehr hilfreich fand. Auch wenn einige dieser Ideen für Sie albern erscheinen mögen, verspreche ich, dass die Kombination einiger davon Ihre Starlight-Seitenleiste noch besser aussehen lassen wird.",
  "One thing to note though is that in this blog post the focus lies on adjusting t.157A7D5F675513D49CA2": "Eine Sache, die zu beachten ist: In diesem Blogbeitrag liegt der Fokus auf der Anpassung des Stils von **Elementen auf Root-Ebene** (diejenigen ohne Unterelemente) in der Seitenleiste.",
  "But before I do that, I'll show you how the default styling of the Starlight sid.935D4EBD7A75949003B6": "Aber bevor ich das tue, zeige ich Ihnen, wie das Standarddesign der Starlight-Seitenleiste derzeit aussieht:",
  "![Default styling of the Starlight sidebar](../../../assets/sidebar-css/no-css.p.CD83DAFB82A4B2123FA6": "Standarddesign der Starlight-Seitenleiste",
  "Manipulate the whitespaces between sidebar items": "Anpassen der Leerzeichen zwischen den Elementen der Seitenleiste",
  "On the root level of your Starlight sidebar, there are two different types of el.44095ABCBC3AC9DE4022": "Auf der Root-Ebene Ihrer Starlight-Seitenleiste gibt es zwei verschiedene Arten von Elementen: **Seiten** und **Gruppen**. Während das Standarddesign ziemlich anständig ist, fand ich die Leerzeichen – der Abstand zwischen den Elementen, der selbst keinen Inhalt enthält – etwas zu groß, besonders zwischen Elementen auf Root-Ebene. Mit diesem Beispiel benutzerdefinierten CSS unten habe ich den Abstand zwischen den Elementen auf Root-Ebene verkleinert, während der Abstand zwischen den Gruppen gleich bleibt. Die wichtigen CSS-Stile sind im Codeblock hervorgehoben.",
  "![Starlight sidebar where the margin between root-level items is smaller](../../.880AFEBFAC9D61C70E2C": "Starlight-Seitenleiste, bei der der Abstand zwischen den Elementen auf Root-Ebene kleiner ist",
  "Perhaps, this will not be as useful to you because you don't use root-level page.31533AC4A173BE6AA7E5": "Vielleicht ist dies für Sie nicht so nützlich, weil Sie keine Root-Level-Seiten in Ihrer Seitenleiste verwenden, sodass dieser Effekt für Sie nicht bemerkbar ist. Aber wenn doch, probieren Sie es aus.",
  "Adjust the font weight of sidebar items": "Anpassen des Schriftgewichts der Seitenleisten-Elemente",
  "[Imho][imho] the one thing that triggers me the most about Starlight's root-leve.BC0D0A5B6F41C0B208BF": "[IMHO][imho], das eine, was mich an den Root-Level-Elementen in der Starlight-Seitenleiste am meisten stört, ist deren Fettdruck. Das ist wahrscheinlich eine sehr subjektive Meinung, aber wenn Sie mich fragen: Eine einzige Seite kann unmöglich so wichtig sein wie eine ganze Gruppe Seiten in Ihrer Dokumentation. Daher habe ich das Schriftgewicht der Elemente auf Root-Ebene dünner gemacht, wie Sie im folgenden Codeblock sehen können.",
  "![Starlight sidebar with lighter font weight](../../../assets/sidebar-css/font-w.7D96D24D62FE18FEF0C9": "Starlight-Seitenleiste mit leichterem Schriftgewicht",
  "Adjust the colour of sidebar items": "Anpassen der Farbe der Seitenleisten-Elemente",
  "A small but subtle change: I made unselected root-level items appear dimmer in t.487CF0E6076E81E13BB4": "Eine kleine, aber subtile Änderung: Ich habe unselektierte Root-Level-Einträge in der Seitenleiste mit einem schwächeren Erscheinungsbild versehen, wie im folgenden Codeblock gezeigt.",
  "If you choose to use this design as well, I recommend that you only apply the se.C425BF4402932D0E21FC": "Wenn Sie sich entscheiden, dieses Design ebenfalls zu verwenden, empfehle ich, nur die zweite CSS-Manipulation anzuwenden, da die erste nur zur Demonstration dient, wie Sie das Styling von ausgewählten Root-Level-Elementen anpassen könnten – diese Regel gilt auch für andere Codeblöcke in diesem Blog, wenn sie als `default value` gekennzeichnet sind.",
  "![Starlight sidebar with dimmer colors](../../../assets/sidebar-css/color.png)": "Starlight-Seitenleiste mit abgeschwächten Farben",
  "Adjust the font size of sidebar items": "Anpassen der Schriftgröße der Seitenleisten-Elemente",
  "Although I don't recommend it, you can also adjust the font size of sidebar item.5B666452173153740723": "Obwohl ich es nicht empfehle, können Sie auch die Schriftgröße der Seitenleisten-Elemente anpassen. Mit diesem Beispiel benutzerdefinierten CSS unten habe ich die Schriftgröße der Elemente auf Root-Ebene verkleinert.",
  "![Starlight sidebar with smaller font size](../../../assets/sidebar-css/font-siz.B88E6D3A46696C763ECA": "Starlight-Seitenleiste mit kleinerer Schriftgröße",
  "Recommendations": "Empfehlungen",
  "Summing everything up, I recommend that you apply some mix of the above customiz.01EDE8C6353CC9B29A42": "Zusammenfassend empfehle ich, dass Sie eine Mischung aus den oben genannten Anpassungsoptionen anwenden, die Sie bequem in einer einzigen `.css`-Datei sehen können.",
  "Note that I also use [Cascade Layers][starlight-css-cascade-layers], supported s.26DC0EFB0948E47CFD73": "Beachten Sie, dass ich auch [Cascade Layers][starlight-css-cascade-layers] verwende, die seit [Starlight 0.34.0][starlight-0-34] unterstützt werden, und empfehle, diese zu verwenden, um die Reihenfolge der angewendeten CSS-Stile festzulegen.",
  "How to create a horizontal progress indicator for your Starlight site": "Wie man einen horizontalen Fortschrittsanzeiger für Ihre Starlight-Website erstellt",
  "Learn how to create a horizontal progress indicator for your Starlight site.": "Erfahren Sie, wie Sie einen horizontalen Fortschrittsanzeiger für Ihre Starlight-Website erstellen.",
  "Learn how to create a horizontal progress indicator for your <a class=\"gh-badge\".E525FE811A5499114EFE": "Erfahren Sie, wie Sie einen horizontalen Fortschrittsanzeiger für Ihre <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" />Starlight</a>-Website erstellen.",
  "In this post, we would like to show you how [FrostyBee](https://github.com/frost.E8FB1C6C96EF64C97121": "In diesem Beitrag möchten wir Ihnen zeigen, wie [FrostyBee](https://github.com/frostybee) einen sauberen horizontalen Fortschrittsanzeiger für Starlight-Websites erstellt hat.",
  "You will need to have an existing Starlight website.": "Sie benötigen eine bestehende Starlight-Website.",
  "Create the progress indicator component": "Erstellen Sie die Fortschrittsanzeiger-Komponente",
  "Let's create a new component called `ProgressIndicator.astro` in the `src/compon.3AF2A56DBB850F8660D1": "Lassen Sie uns eine neue Komponente namens `ProgressIndicator.astro` im Verzeichnis `src/components/` erstellen. Diese Komponente ist für die Darstellung des Fortschrittsanzeigers zuständig.",
  "We create a container which spans across the whole width with the progress bar `.BF53914FAF1D12F4D39C": "Wir erstellen einen Container, der sich über die gesamte Breite erstreckt, mit der Fortschrittsleiste `<div>` darin. Die Breite des inneren `<div>` wird aktualisiert, wann immer der Benutzer scrollt (und beim Laden der Seite), um die aktuelle Scrollposition widerzuspiegeln.",
  "In the hidden lines is the styling which makes sure that the progress bar looks .D3205B85D528FA0A2D8A": "In den ausgeblendeten Zeilen befindet sich das Styling, das sicherstellt, dass die Fortschrittsleiste wie eine typische Fortschrittsleiste aussieht. Sie ist auch an Starlight angepasst, da die Leiste automatisch ausgeblendet wird, wenn die Website keine Seitenleiste und Inhaltsverzeichnis, aber ein Hero-Element hat, wie es die meisten Landing Pages tun.",
  "One thing to point out is what the global CSS (line 45) does: It pushes the mobi.9D93B4CCEB69834E52E2": "Eine Sache, die hervorzuheben ist, ist, was das globale CSS (Zeile 45) bewirkt: Es schiebt das Dropdown-Menü des mobilen Inhaltsverzeichnisses nach unten, um mehr Abstand zur Fortschrittsleiste zu schaffen. Dies ist eine persönliche Präferenz, die Sie entfernen können, wenn Sie möchten.",
  "Starlight Override": "Starlight-Override",
  "Now we can use this component in a [Starlight override](https://starlight.astro..BD7A14DF6609C76376D6": "Nun können wir diese Komponente in einem [Starlight-Override](https://starlight.astro.build/guides/overriding-components/) verwenden. In diesem Fall macht es Sinn, die [`Header.astro`-Komponente](https://starlight.astro.build/reference/overrides/#header-1) wie folgt zu überschreiben:",
  "Do not forget to add this component override to your `astro.config.mjs` file:": "Vergessen Sie nicht, dieses Komponenten-Override in Ihre `astro.config.mjs`-Datei aufzunehmen:",
  "Source Code": "Quellcode",
  "You can find the whole project code on [GitHub](https://github.com/trueberryless.F650372F9DC07B1F43E8": "Sie können den gesamten Projektcode auf [GitHub](https://github.com/trueberryless/starlight-progress-indicator) und in diesem [Stackblitz-Beispiel](https://stackblitz.com/github/trueberryless/starlight-progress-indicator?file=src%2Fcomponents%2FProgressIndicator.astro) finden.",
  "Conclusion": "Fazit",
  "With this setup, the progress indicator will be displayed on every page (except .14DF840C82B37252652E": "Mit dieser Konfiguration wird der Fortschrittsanzeiger auf jeder Seite (außer Landing Pages) Ihrer Starlight-Website angezeigt. 🥳",
  "You can also check out [FrostyBee's](https://github.com/frostybee) [Starlight Sc.2885FB180F098A43BD51": "Sie können auch das [Starlight Scroll To Top Plugin](https://github.com/frostybee/starlight-scroll-to-top) von [FrostyBee](https://github.com/frostybee) ausprobieren, das seit Version `0.3.1` auch einen integrierten [Fortschrittsring](https://frostybee.github.io/starlight-scroll-to-top/configuration/#showprogressring) unterstützt. 🙌",
  "Starlight Topics Dropdown and List together": "Starlight Themen-Dropdown und Liste zusammen",
  "Learn how to combine a desktop list and mobile dropdown for your Starlight sideb.E44A5587DB1652DE8801": "Erfahren Sie, wie Sie eine Desktop-Liste und ein mobiles Dropdown-Menü für die Starlight-Sidebar-Themen kombinieren.",
  "Combine two <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><i.F2B401A419A027863D20": "Kombinieren Sie zwei <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" />Starlight</a> Sidebar Topics Plugins, um eine Themenliste auf dem Desktop und ein Dropdown-Menü in der mobilen Sidebar anzuzeigen.",
  "Using the [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar.7183C62B96DBF9A43128": "Mit dem [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar-topics) Plugin zusammen mit der [Starlight Sidebar Topics Dropdown](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown) Komponente können Sie eine Website erstellen, die eine Themenliste auf dem Desktop und ein Dropdown-Menü auf mobilen Geräten bietet.",
  "Install the packages": "Pakete installieren",
  "First, install the `starlight-sidebar-topics` plugin and also the `starlight-sid.6A32241A1C081FF4DD1C": "Zuerst installieren Sie das `starlight-sidebar-topics` Plugin sowie die `starlight-sidebar-topics-dropdown` Komponente:",
  "Afterwards, follow the setup guides from [Starlight Sidebar Topics](https://star.D6EC61B940DA777E2BEB": "Anschließend folgen Sie den Einrichtungsanleitungen von [Starlight Sidebar Topics](https://starlight-sidebar-topics.trueberryless.org/docs/getting-started/#installation) und [Starlight Sidebar Topics Dropdown](https://starlight-sidebar-topics-dropdown.trueberryless.org/docs/getting-started/#installation).",
  "Modify the Sidebar component": "Die Sidebar-Komponente anpassen",
  "In the setup guide from the dropdown component, you have created a sidebar compo.BD6B58F9BEEFEE582749": "In der Einrichtungsanleitung der Dropdown-Komponente haben Sie eine Sidebar-Komponente erstellt, die nur das Dropdown-Menü rendert. Nun müssen Sie diese Komponente anpassen, sodass sie auch die Standard-Sidebar rendert, wenn der Benutzer am Desktop ist.",
  "Result": "Ergebnis",
  "If you follow these steps, your sidebar will look like this:": "Wenn Sie diese Schritte befolgen, sieht Ihre Sidebar folgendermaßen aus:",
  "![Final result with desktop view on the left and mobile view on the right](../...6745D424D50B4DE3BC95": "Endergebnis mit Desktop-Ansicht links und mobiler Ansicht rechts",
  "You can find the complete source code of this guide in this [StackBlitz example].B731F1E66F12B002F90D": "Den vollständigen Quellcode dieser Anleitung finden Sie in diesem [StackBlitz-Beispiel](https://stackblitz.com/edit/withastro-starlight-qgraahmp?file=astro.config.mjs).",
  "Endless possibilities": "Unbegrenzte Möglichkeiten",
  "You could also do it the other way around (list on mobile, dropdown on desktop) .6BA6A2F32E24F0FB3A00": "Sie könnten es auch umgekehrt machen (Liste auf mobilen Geräten, Dropdown auf dem Desktop), indem Sie die CSS-Eigenschaften `display: block` und `display: none` tauschen.",
  "Moreover, you could also create your own display component, which uses the route.7237A9BCDFBA80A2B459": "Darüber hinaus könnten Sie auch eine eigene Anzeige-Komponente erstellen, die die Routendaten aus dem Starlight Sidebar Topics Plugin verwendet und die Themen auf eine benutzerdefinierte Weise rendert. Das ist etwas anspruchsvoller, aber Sie finden weitere Informationen dazu in der [\"Custom Topics List\"-Dokumentation](https://starlight-sidebar-topics.trueberryless.org/docs/guides/custom-topic-list/).",
  "Setting up Kubernetes with Cilium and Cloudflare": "Einrichten von Kubernetes mit Cilium und Cloudflare",
  "Today we'll take a look at how to set up a Kubernetes cluster with K3s and Ciliu.651207C3314901C11632": "Heute schauen wir uns an, wie man ein Kubernetes-Cluster mit K3s und Cilium einrichtet.",
  "This blog posts describes the process of setting up a <a class=\"gh-badge\" href=\".E82478488BD3E7D9E2C2": "Dieser Blogpost beschreibt den Prozess der Einrichtung eines <a class=\"gh-badge\" href=\"https://github.com/kubernetes\"><img src=\"https://github.com/kubernetes.png\" alt=\"Kubernetes\" />Kubernetes</a>-Clusters mit <a class=\"gh-badge\" href=\"https://github.com/k3s-io\"><img src=\"https://github.com/k3s-io.png\" alt=\"k3s\" />k3s</a> und <a class=\"gh-badge\" href=\"https://github.com/cilium\"><img src=\"https://github.com/cilium.png\" alt=\"Cilium\" />Cilium</a>. Wir verwenden <a class=\"gh-badge\" href=\"https://github.com/helm\"><img src=\"https://github.com/helm.png\" alt=\"Helm\" />Helm</a> als Paketmanager und <a class=\"gh-badge\" href=\"https://github.com/cloudflare\"><img src=\"https://github.com/cloudflare.png\" alt=\"Cloudflare\" />Cloudflare</a> als Zertifikataussteller. Wir haben die Tipps und Tricks von Vegard S. Hagen aus [seinem Artikel](https://blog.stonegarden.dev/articles/2024/02/bootstrapping-k3s-with-cilium/) genutzt. Im Wesentlichen erklärt dieser Blog, wie alle trueberryless.org-Webseiten bereitgestellt wurden (nicht mehr).",
  "Working with [Docker](https://github.com/docker) Containers can be hard. However.1CC6942704DAE062A463": "Die Arbeit mit [Docker](https://github.com/docker)-Containern kann schwierig sein. Es gibt jedoch Tools, die das Management von Containern verbessern, wie [Kubernetes](https://github.com/kubernetes). Tatsächlich ist Kubernetes meines Wissens das einzige Tool, das als Management-Software für Docker-Container fungiert. Kubernetes ist in fast allen Cloud-Anbietern wie Google Cloud, Azure und AWS gut integriert. Dadurch hat es eine standardisierte `yaml`-Syntax, was für kleine Entwickler großartig ist, da sie mit geringem Aufwand zwischen `The Big Three` wechseln können.",
  "tl;dr": "tl;dr",
  "Install everything and then apply cert-manager. ez": "Alles installieren und dann cert-manager anwenden. Ganz einfach.",
  "Install k3s": "k3s installieren",
  "As Hagen explains in [his article](https://blog.stonegarden.dev/articles/2024/02.D5EDD5BC9C49780444EF": "Wie Hagen in [seinem Artikel](https://blog.stonegarden.dev/articles/2024/02/bootstrapping-k3s-with-cilium/) erklärt, möchten wir `k3s` ohne Konfigurationen und mit deaktivierten Komponenten installieren. Er beschreibt im Detail, welche Komponenten nicht installiert werden.",
  "After the installation, there should be some pods running (3). Don't be shocked .56BB9C3C1CCEDAFADEDB": "Nach der Installation sollten einige Pods laufen (3). Nicht schockiert sein, wenn die Pods im Status `ContainerCreating` oder `Pending` sind. Das liegt daran, dass die Pods nicht miteinander kommunizieren können, da wir das CNI deaktiviert haben (`--flannel-backend=none`). Später werden wir [Cilium](https://github.com/cilium) installieren, welches das Flannel-CNI ersetzen wird.",
  "Install Helm": "Helm installieren",
  "Helm is the package manager for [Kubernetes](https://github.com/kubernetes), so .B3313537E64D4FFE6667": "Helm ist der Paketmanager für [Kubernetes](https://github.com/kubernetes). Sie können es entweder direkt installieren (siehe die [Helm-Dokumentation](https://helm.sh/docs/intro/install/)) oder Teile von Helm verwenden, die mit Cilium ausgeliefert werden. Wir haben uns entschieden, Helm direkt zu installieren, was mit folgendem Befehl problemlos möglich ist:",
  "Install Cilium": "Cilium installieren",
  "[Cilium](https://github.com/cilium) is a networking and security software for Ku.F7DC9A96105A082EC9DB": "[Cilium](https://github.com/cilium) ist eine Netzwerk- und Sicherheitssoftware für Kubernetes. Cilium ist sehr schnell, skalierbar und sicher, da es auf eBPF basiert -- einer revolutionären Technologie, die sandboxed Programme im Linux-Kernel ausführen kann, ohne den Kernel neu zu kompilieren oder Kernelmodule zu laden.",
  "We could install Cilium with Helm like shown here:": "Wir könnten Cilium mit Helm wie hier gezeigt installieren:",
  "However, we wanted to install with their CLI and this is how you can do it. Firs.551EA48947BA4759E483": "Wir wollten es jedoch mit deren CLI installieren, und so funktioniert das. Zuerst installieren Sie die Cilium-CLI, indem Sie diesen Code-Schnipsel ausführen:",
  "Then you can install Cilium with your Server IP-Address:": "Anschließend können Sie Cilium mit Ihrer Server-IP-Adresse installieren:",
  "Now we wait until Cilium says, everything is `OK` or `disabled`:": "Jetzt warten wir, bis Cilium meldet, dass alles `OK` oder `disabled` ist:",
  "After a while, all pods should be `Running`.": "Nach einer Weile sollten alle Pods im Status `Running` sein.",
  "Last but not least, you can apply some resources for Cilium:": "Zu guter Letzt können Sie einige Ressourcen für Cilium anwenden:",
  "Additionally you should upgrade the cilium config. In order to do that with the .B2C737654644F532072A": "Außerdem sollten Sie die Cilium-Konfiguration aktualisieren. Um dies mit den richtigen Werten zu tun, erstellen Sie zunächst diese Datei im Root-Verzeichnis, in dem Sie das k3s-Cluster verwalten möchten. Später können Sie auch einige hubble- und prometheus-bezogene Eigenschaften hinzufügen, wenn Sie [Grafana](https://github.com/Grafana) oder Ähnliches verwenden möchten (öffnen Sie die ausgeblendeten Zeilen, wenn Sie unsere Konfiguration ebenfalls verwenden möchten).",
  "Run this command to upgrade:": "Führen Sie diesen Befehl aus, um ein Upgrade durchzuführen:",
  "Setup Certificate Manager with Cloudflare": "Zertifikatsmanager mit Cloudflare einrichten",
  "In order to be able to create certificates for each subdomain, it is important t.412EB3BCACB9EA434592": "Um in der Lage zu sein, Zertifikate für jede Subdomain zu erstellen, ist es wichtig, einen Zertifikatsaussteller anzuwenden, der Zertifikatsanfragen bearbeitet und sie bei einem Anbieter einlöst. Wir haben [Cloudflare](https://github.com/cloudflare) als unseren Aussteller gewählt, und hier ist die Konfiguration, die Sie auf Ihr Kubernetes-Cluster anwenden müssen. Weitere Informationen finden Sie in der [cert-manager-Dokumentation](https://cert-manager.io/docs/configuration/acme/dns01/cloudflare/).",
  "But first, we need to install the cert-manager by running the following command:.2C3AE967A1D1E33B0CFD": "Zuerst müssen wir den cert-manager installieren, indem wir den folgenden Befehl ausführen:",
  "You can apply a file to the [Kubernetes](https://github.com/kubernetes) cluster,.7C198D3247CB04A61DD9": "Sie können eine Datei auf den [Kubernetes](https://github.com/kubernetes)-Cluster anwenden, indem Sie diesen k8s- (oder k3s-) Befehl ausführen:",
  "If you want to delete the resource in the Kubernetes cluster, the command is pre.13785BDE8535FD743BB9": "Wenn Sie die Ressource im Kubernetes-Cluster löschen möchten, ist der Befehl ziemlich einfach:",
  "As you may have spotted above, we also need a secret for the API token which aut.EED50E553247233483D4": "Wie Sie oben vielleicht bemerkt haben, benötigen wir auch ein Geheimnis für das API-Token, das die Authentifizierung durchführt, dass dieser Issuer berechtigt ist, Zertifikate anzufordern. Daher erstellen wir ein Geheimnis mit einem unverschlüsselten `API Token` von Cloudflare.",
  "Nowadays we create a token by going to your [Cloudflare](https://github.com/clou.29311654A42391586C43": "Heutzutage erstellen wir ein Token, indem wir zu Ihrem [Cloudflare](https://github.com/cloudflare)-Dashboard gehen, dann auf Ihr Profil klicken und die Registerkarte `API Tokens` auswählen. Hier können Sie ein spezifisches Token für Ihren Issuer generieren oder den globalen API-Schlüssel (nicht mehr empfohlen) verwenden. Die empfohlene Lösung ist, ein API-Token mit zwei Berechtigungen (benutzerdefiniertes Token) zu erstellen:",
  "Zone - DNS - Edit": "Zone - DNS - Bearbeiten",
  "Zone - Zone - Read": "Zone - Zone - Lesen",
  "![Cloudflare API Token](../../../assets/cloudflare/cloudflare_api_token.png)": "Cloudflare-API-Token",
  "A more detailed description about the tokens, can be found in the [Cloudflare do.1F2C806B3988F77EF2CC": "Eine detailliertere Beschreibung der Tokens finden Sie in den [Cloudflare-Dokumenten](https://developers.cloudflare.com/fundamentals/api/get-started/create-token/).",
  "After applying this secret to Kubernetes, the issuer should be ready to resolve .6908E4EC999AC0DCA147": "Nachdem Sie dieses Geheimnis auf Kubernetes angewendet haben, sollte der Issuer bereit sein, unangenehme Fälle zu lösen!",
  "You can now use this issuer by applying this file which will hopefully create a .7987E8195B3DBB4AB6A9": "Sie können diesen Issuer jetzt verwenden, indem Sie diese Datei anwenden, die hoffentlich ein Zertifikat erstellt:",
  "It usually takes around 90 seconds to authenticate the request once applied. You.523D684039CD86DF5B8E": "Normalerweise dauert es etwa 90 Sekunden, um die Anfrage nach dem Anwenden zu authentifizieren. Sie können den aktuellen Status der Anfrage überprüfen, indem Sie diesen Kubernetes-Befehl ausführen.\nWenn es länger als 2 Minuten dauert, können möglicherweise einige Tipps unter [#Fehlerbehebung](#no-cloudflare-certificate-approval) hilfreich sein.",
  "The `-n` option stands for namespace.": "Die Option `-n` steht für Namespace.",
  "## Example app [`mutanuq`](https://mutanuq.trueberryless.org)": "Beispielanwendung [`mutanuq`](https://mutanuq.trueberryless.org)",
  "Then you can use this certificate in your Ingress controller:": "Dann können Sie dieses Zertifikat in Ihrem Ingress-Controller verwenden:",
  "Setup Keel": "Einrichtung von Keel",
  "We always wanted a clean Continuous Integration (CI) and Continuous Delivery (CD.5A7C877EE9C3CC7E2E7A": "Wir wollten schon immer eine saubere Continuous Integration (CI) und Continuous Delivery (CD) Lösung für unsere Websites. Das bedeutet, dass eine spezifische Commit-Nachricht einen automatisierten Prozess über [GitHub](https://github.com/github), Docker Hub und unseren Server auslösen sollte, der am Ende die entsprechende Website nach etwa zwei Minuten aktualisiert.",
  "Keel is a robust software tool which enables this feature for Kubernetes. We use.782AFBD621B2DB555C2D": "Keel ist ein robustes Software-Tool, das diese Funktion für Kubernetes ermöglicht. Wir haben Keel verwendet, um neue Docker-Images von Docker Hub durch regelmäßige Abfragen zu holen. Außerdem bietet Keel ein schönes Dashboard, auf dem Sie die Abfragen steuern können.",
  "In order to set up Keel with the admin dashboard, we created those files:": "Um Keel mit dem Administrations-Dashboard einzurichten, haben wir folgende Dateien erstellt:",
  "`secret-dashboard.yaml` for the Admin Username and Password (not everyone should.BC266314D27DCB36F4CB": "`secret-dashboard.yaml` für den Admin-Benutzernamen und das Passwort (nicht jeder sollte auf das Dashboard zugreifen können)",
  "`keel.yaml` for the actual k3s configs (copied and adapted from [KeelHQ](https:/.F8A38C5FC9A4505AF62C": "`keel.yaml` für die eigentlichen k3s-Konfigurationen (kopiert und angepasst von [KeelHQ](https://github.com/keel-hq/keel/blob/9f0a7160bbdc3a107ad148933a4269f30e4e479c/deployment/deployment-template.yaml))",
  "After applying both files and managing the additional certificate for `keel.true.30388E288EFFF1AD00F9": "Nachdem beide Dateien angewendet und das zusätzliche Zertifikat für `keel.trueberryless.org` verwaltet wurden, funktioniert das Keel-Dashboard perfekt. Darüber hinaus kann jedes Kubernetes-`Deployment` für automatisiertes Docker-Hub-Polling durch Setzen einiger Annotationen aktiviert werden:",
  "Celebrate with a Coffee!": "Feiern Sie mit einem Kaffee!",
  "Congratulations, you've successfully set up [Kubernetes](https://github.com/kube.C26D3423275F0054D782": "Herzlichen Glückwunsch, Sie haben erfolgreich [Kubernetes](https://github.com/kubernetes) mit [Cilium](https://github.com/cilium) und [Cloudflare](https://github.com/cloudflare) eingerichtet! Sie haben sich eine Kaffeepause verdient. Genießen Sie eine wohlverdiente Tasse, und wenn Sie mit mir virtuell einen Kaffee teilen möchten, können Sie meine Arbeit gerne auf [Ko-fi](https://ko-fi.com/trueberryless) unterstützen. Vielen Dank!",
  "Troubleshooting": "Fehlerbehebung",
  "Cilium-ingress has no External-IP": "Cilium-Ingress hat keine External-IP",
  "Make sure that the `ip-pool` includes the address specified by the annotations i.4E44377E5C9AC3845ED3": "Stellen Sie sicher, dass der `ip-pool` die in der Datei `config.yaml` angegebenen Adressen enthält.",
  "Also in some cases, other ingress controllers get the annotated address before t.16FB14B27C64B47E0869": "In einigen Fällen nehmen andere Ingress-Controller die annotierte Adresse, bevor der Cilium IC darauf zugreifen kann, sodass sie weiterhin ausstehend ist...",
  "If you don't deploy locally but on one of `The Big Three`, please check out some.4CF2A8E1AE1127E8E9D5": "Wenn Sie nicht lokal, sondern auf einer der `Big Three` bereitstellen, schauen Sie bitte in andere Dokumentationen nach, warum die External IP weiterhin ausstehend ist. Es liegt meistens in deren Verantwortung, Ihnen eine Adresse bereitzustellen.",
  "No Cloudflare Certificate Approval": "Keine Cloudflare-Zertifikatsgenehmigung",
  "There can be some problem when the certificate won't get approved by Cloudflare..21242D4E500A87FE26A2": "Es kann Probleme geben, wenn das Zertifikat von Cloudflare nicht genehmigt wird.",
  "Wrong API token": "Falsches API-Token",
  "First make sure that the Cloudflare API token is correct. To make 100 percent su.BE3E293E05F70A765669": "Stellen Sie zunächst sicher, dass das Cloudflare API-Token korrekt ist. Erstellen Sie zur hundertprozentigen Sicherheit ein neues und fügen Sie es (nicht Base64-codiert) in diese Datei ein:",
  "Max auth failures reached": "Maximale Authentifizierungsfehler erreicht",
  "We once ran into the error `Error: 9109: Max auth failures reached, please check.661EAA2B42757CBB4C1D": "Wir sind einmal auf den Fehler `Error: 9109: Max auth failures reached, please check your Authorization header.` gestoßen. Warten Sie einfach ein paar Stunden, löschen Sie die Ressource und wenden Sie sie erneut an:",
  "Hopefully, you're now good to go!": "Hoffentlich können Sie jetzt loslegen!",
  "Setting up Continuous deployment in a GitHub repository": "Einrichten der kontinuierlichen Bereitstellung in einem GitHub-Repository",
  "Today we'll take a look at how to set up a GitHub repository which will be deplo.210AF277FD26683FD09E": "Heute schauen wir uns an, wie man ein GitHub-Repository einrichtet, das über Argo CD auf einem k3s-Cluster bereitgestellt wird.",
  "Today we'll take a look at how to set up a <a class=\"gh-badge\" href=\"https://git.A040D5A396CEA3FE8E47": "Heute schauen wir uns an, wie man ein <a class=\"gh-badge\" href=\"https://github.com/github\"><img src=\"https://github.com/github.png\" alt=\"github\" />GitHub</a>-Repository einrichtet, das über Argo CD auf einem k3s-Cluster bereitgestellt wird. Zusammenfassend wird der Artikel Workflow-Dateien, eine Dockerfile, Manifeste (Deployment) und <a class=\"gh-badge\" href=\"https://github.com/docker\"><img src=\"https://github.com/docker.png\" alt=\"Docker Hub\" />Docker Hub</a>-Repositories umfassen. Bitte werfen Sie einen Blick auf [unseren Argo CD Blog](./setup-argocd-for-kubernetes), da dies eine Fortsetzung des anderen Beitrags ist.",
  "In today's post, we'll take a quick look at how to set up continuous deployment .837E00D0E73247CB97BC": "Im heutigen Beitrag werfen wir einen kurzen Blick darauf, wie man eine kontinuierliche Bereitstellung in einem [GitHub](https://github.com/github)-Repository einrichtet. Wir sind uns ziemlich sicher, dass dieses Setup auch mit anderen Git-Registrys funktioniert. Beachten Sie jedoch, dass sich dieser Beitrag ausschließlich auf GitHub konzentriert.",
  "This post also assumes that you use [GitHub](https://github.com/github) Actions .5387D30E9AFCFCF33E71": "Dieser Beitrag setzt voraus, dass Sie [GitHub](https://github.com/github)-Actions in Kombination mit Argo CD verwenden, um Ihre Anwendungen auf einem Kubernetes-Cluster bereitzustellen. Folgen Sie unseren anderen [Bereitstellungsbeiträgen](/blog/tags/deployment), um weitere Anleitungen zur Einrichtung beider Technologien auf Ihrem persönlichen Server zu erhalten.",
  "Preparations": "Vorbereitungen",
  "We recommend creating a [Docker Hub](https://hub.docker.com/) account or choose .D653C06B296243188634": "Wir empfehlen, ein [Docker Hub](https://hub.docker.com/)-Konto zu erstellen oder ein anderes Docker-Registry Ihrer Wahl zu nutzen.",
  "Your GitHub repository must fulfil these conditions:": "Ihr GitHub-Repository muss die folgenden Bedingungen erfüllen:",
  "Has a Dockerfile (ideally in the root folder)": "Hat eine Dockerfile (idealerweise im Stammordner)",
  "Has two GitHub Secrets ([create GitHub Secret](https://docs.github.com/en/action.5E18F567EA5B8452C4B3": "Hat zwei GitHub-Secrets ([GitHub-Secret erstellen](https://docs.github.com/en/actions/security-guides/using-secrets-in-github-actions#creating-secrets-for-a-repository)):",
  "DOCKER_USERNAME: Your docker username": "DOCKER\\_USERNAME: Ihr Docker-Benutzername",
  "DOCKER\\_PASSWORD: Your docker password (or [access token](https://docs.docker.co.09AD66E199369AC9AC74": "DOCKER\\_PASSWORD: Ihr Docker-Passwort (oder [Access Token](https://docs.docker.com/security/for-developers/access-tokens/))",
  "Create workflow file(s)": "Erstellen einer Workflow-Datei (oder mehrerer)",
  "GitHub Actions are special jobs in GitHub which mostly run on Linux servers and .E52CA8DEA2F2414C53E4": "GitHub Actions sind spezielle Jobs in GitHub, die meist auf Linux-Servern ausgeführt werden und über das Erstellen von `yaml`-Dateien im Verzeichnis `.github/workflows` gesteuert werden können. Diese speziellen Dateien können festlegen, nach welchen Ereignissen diese Jobs ausgeführt werden sollen, und bieten Ihnen viel Freiheit. Als regelmäßiger GitHub-Actions-Nutzer kann ich Ihnen sagen, dass Sie sich daran gewöhnen sollten, Ihre `yaml`-Dateien ziemlich oft umzuschreiben, da Sie häufig kleine Details übersehen. Aber ohne weitere Umschweife, lassen Sie uns direkt in die Erstellung einer passenden `deployment.yaml`-Datei einsteigen, die einige Aufgaben für uns erledigt:",
  "Push a new docker image to Docker Hub (with the newest version).": "Eine neue Docker-Image-Version in Docker Hub hochladen (mit der neuesten Version).",
  "Update the `manifest/deployment.yaml` file, so Argo CD gets notified about the n.745ACECEA48EBB0BD214": "Die `manifest/deployment.yaml`-Datei aktualisieren, damit Argo CD über das neue getaggte Image informiert wird.",
  "(optional) Create a new release on GitHub, so the times of releases are document.5A45740CFC388A713228": "(optional) Ein neues Release auf GitHub erstellen, damit die Zeitpunkte der Releases dokumentiert sind, wo sie sein sollten.",
  "Here you have an obsolete `docker-hub.yaml` which we used to use because it has .ACD068BBAB645A580B40": "Hier finden Sie eine veraltete `docker-hub.yaml`, die wir früher verwendet haben, da sie gute Versionierungsstrategien bietet:",
  "After copying the contents of our `deployment.yaml` file and creating the new fi.BA0B84DE711F10368BA7": "Nachdem Sie den Inhalt unserer `deployment.yaml`-Datei kopiert und die neue Datei im `.github/workflows`-Ordner erstellt haben, müssen Sie einige sehr **wichtige Anpassungen** vornehmen:",
  "Change the `IMAGE_NAME` to your personal Docker Hub repository. The image name c.70E854B465ED70C76952": "Ändern Sie den `IMAGE_NAME` in Ihr persönliches Docker Hub-Repository. Der Bildname besteht aus Ihrem Kontonamen und dem Repositoriesnamen. Wenn Sie sich nicht sicher sind, wie Ihr Bildname lautet, können Sie die URL des Docker Hub-Repositories ansehen, dort sollte er irgendwo zu finden sein.",
  "Now you should be good to go to add the keyword `deploy` into any commit message.BBFBDF3655BEA5A69ED1": "Jetzt sollten Sie bereit sein, das Schlüsselwort `deploy` in jede Commit-Nachricht für den Hauptzweig Ihres Repositories einzufügen, und es sollte automatisch ein Docker-Image an Docker Hub senden und das Manifest für Argo CD aktualisieren.",
  "Congratulations, you've successfully set up Argo CD with k3s and [Cilium](https:.F5382A81A78FA5565691": "Herzlichen Glückwunsch, Sie haben Argo CD erfolgreich mit k3s und [Cilium](https://github.com/cilium) eingerichtet! Sie haben eine Kaffeepause verdient. Genießen Sie eine wohlverdiente Tasse, und wenn Sie mit mir einen virtuellen Kaffee teilen möchten, können Sie gerne meine Arbeit auf [Ko-fi](https://ko-fi.com/trueberryless) unterstützen. Vielen Dank!",
  "Setting up Argo CD in a k3s cluster": "Einrichten von Argo CD in einem k3s-Cluster",
  "Today we'll take a look at how to set up Argo CD in a k3s cluster.": "Heute sehen wir uns an, wie man Argo CD in einem k3s-Cluster einrichtet.",
  "Continuing to improve our k3s cluster and especially the CI/CD workflow, we now .A2E0EE988FAFFFAD6A42": "Um unseren k3s-Cluster und insbesondere den CI/CD-Workflow weiter zu verbessern, werfen wir einen Blick auf das GitOps-Tool <a class=\"gh-badge\" href=\"https://github.com/argoproj\"><img src=\"https://github.com/argoproj.png\" alt=\"Argo CD\" />Argo CD</a>. Hier zeigen wir, wie wir es in unseren Cluster integrieren können. Unsere Tech-Stack für den Deployment-Prozess umfasst k3s, Helm, Cilium und nach diesem Tutorial auch Argo CD.",
  "Having read Vegard S. Hagen's article “[Argo CD Kustomize with Helm](https://blo.A0B58D0615DC386245A0": "Nachdem wir Vegard S. Hagens Artikel “[Argo CD Kustomize with Helm](https://blog.stonegarden.dev/articles/2023/09/argocd-kustomize-with-helm/)” gelesen und beschlossen haben, dass seine Lösung nicht passend für unseren Cluster ist, haben wir uns direkt in die Standard-Argo-CD-„[Getting started](https://argo-cd.readthedocs.io/en/stable/getting_started/)“-Anleitung vertieft. Nun führen wir Sie durch die Herausforderungen bei der Einrichtung von [Argo CD](https://github.com/argoproj) auf [k3s](https://github.com/k3s-io) und [Cilium](https://github.com/cilium). Dies knüpft an das Kapitel „[Setup Certificate Manager with Cloudflare](/blog/setup-kubernetes-with-cilium-and-cloudflare#setup-certificate-manager-with-cloudflare)“ aus unserem letzten Beitrag „[Setting up Kubernetes with Cilium and Cloudflare](/blog/setup-kubernetes-with-cilium-and-cloudflare)“ an. In genau diesem Beitrag haben wir am Ende auch [Keel](https://github.com/keel-hq) eingerichtet, aber dieser Schritt ist jetzt überflüssig, da wir Argo CD nutzen, um den neuesten Stand der Technik-Code aus jeder [GitHub](https://github.com/github)-Repo zu holen. Viel Spaß beim Lesen!",
  "We assume that you followed [our other blog post](/blog/setup-kubernetes-with-ci.35443F83A3EBC402F568": "Wir gehen davon aus, dass Sie [unseren anderen Blogbeitrag](/blog/setup-kubernetes-with-cilium-and-cloudflare) gelesen haben.",
  "Requirements": "Voraussetzungen",
  "Before we can start, we need to make sure we have `kubectl` installed, a kubecon.AF18D970264C891E62E6": "Bevor wir starten, müssen wir sicherstellen, dass `kubectl` installiert ist, eine kubeconfig-Datei vorhanden ist (k3s speichert diese Datei hier:",
  ") and CoreDNS (check if you have CoreDNS by running this": ") und CoreDNS (prüfen Sie, ob Sie CoreDNS haben, indem Sie diesen",
  "command).": "Befehl ausführen).",
  "Installation": "Installation",
  "First, let's apply all the necessary services, deployments and many other differ.3968A495D46DF328E51D": "Zunächst wenden wir alle notwendigen Services, Deployments und viele andere Kubernetes-Ressourcen an, indem wir folgendes ausführen:",
  "Certificate": "Zertifikat",
  "Additionally, we'll need a certificate:": "Zusätzlich benötigen wir ein Zertifikat:",
  "Apply this resource by running `kubectl apply -f certificate.yaml`.": "Wenden Sie diese Ressource an, indem Sie `kubectl apply -f certificate.yaml` ausführen.",
  "Ingress Controller": "Ingress-Controller",
  "And we'll need a ingress controller which is managed by Cilium:": "Außerdem benötigen wir einen Ingress-Controller, der von Cilium verwaltet wird:",
  "Apply this resource by running `kubectl apply -f argocd-ingress.yaml`.": "Wenden Sie diese Ressource an, indem Sie `kubectl apply -f argocd-ingress.yaml` ausführen.",
  "Deactivate TSL within Argo CD": "Deaktivieren des TLS in Argo CD",
  "With the certificate the connection between the client and server is secured. Ho.198C7766F41D2E4927DA": "Mit dem Zertifikat ist die Verbindung zwischen Client und Server gesichert. Es gibt jedoch immer noch ein selbstsigniertes Zertifikat innerhalb der [Argo CD](https://github.com/argoproj)-Services, das wir nicht unbedingt benötigen. Daher können wir die Sicherheit des Argo-CD-Servers deaktivieren, indem wir die Eigenschaft `server.insecure` bearbeiten.",
  "In order to do that, we first run this command:": "Um das zu tun, führen wir zunächst diesen Befehl aus:",
  "which will hopefully open a file in vim or neovim (otherwise would be cringe if .8B321BBC80D980EFA538": "was hoffentlich eine Datei in vim oder neovim öffnet (ansonsten wäre es ziemlich unangenehm, wenn Sie uns fragen, LMAO). Die Datei sollte in etwa so aussehen:",
  "The last two lines will probably be not there at first, but this is exactly the .00E15DF17F5D9A9B4B22": "Die letzten beiden Zeilen werden wahrscheinlich zuerst nicht vorhanden sein, aber genau diese Einstellung wollen wir erreichen. Fügen Sie diese beiden Zeilen (oben markiert) hinzu und speichern Sie die Datei (`Esc` → `:wq`, wenn Sie cool sind).",
  "Restart the Argo CD Server by running and waiting till the rollout is completed:.CDC77B3806BBA44885A8": "Starten Sie den Argo-CD-Server neu, indem Sie warten, bis das Rollout abgeschlossen ist:",
  "After all those steps, we should now see the UI under [`https://argo-cd.trueberr.89BC34AD1ECDBC06B87E": "Nach all diesen Schritten sollten wir nun die Benutzeroberfläche unter [`https://argo-cd.trueberryless.org`](https://argo-cd.trueberryless.org) (passwortgeschützt) sehen.",
  "![Argo CD UI Dashboard](../../../assets/argocd/argocd_ui_dashboard.png)": "Argo CD UI-Dashboard",
  "The credentials of Argo CD UI consist of a user and a password. The user is alwa.BE74F043F4C1B4E5AB9E": "Die Anmeldedaten der Argo-CD-Benutzeroberfläche bestehen aus einem Benutzer und einem Passwort. Der Benutzer ist immer `admin` und Sie können Ihr Passwort herausfinden, indem Sie diesen Befehl ausführen:",
  "Add manifest to repository": "Manifest im Repository hinzufügen",
  "Now in order to create a new application in [Argo CD](https://github.com/argopro.B153A0B7CA8710DB4FF2": "Um nun eine neue Anwendung in [Argo CD](https://github.com/argoproj) zu erstellen (entweder über die Benutzeroberfläche oder CLI – wir nutzen die Benutzeroberfläche, da wir die CLI nicht eingerichtet haben), müssen wir das Git-Repository vorbereiten. Da das Repository die einzige Quelle der Wahrheit ist, definieren wir dort auch alle Kubernetes-Ressourcen, die von Argo CD erstellt werden sollen.",
  "We recommend creating a new folder in the git repository called something like `.505C369206406EFB86A4": "Wir empfehlen, im Git-Repository einen neuen Ordner mit dem Namen `manifest` zu erstellen. In diesem Ordner erstellen wir einige Dateien:",
  "`certificate.yaml`:": "`certificate.yaml`:",
  "`deployment.yaml`:": "`deployment.yaml`:",
  "`service.yaml`:": "`service.yaml`:",
  "`ingress.yaml`:": "`ingress.yaml`:",
  "These files are basically the exact same files mentioned in the [other post](/bl.A6639A930D5E316FA4EB": "Diese Dateien sind im Grunde dieselben wie in dem [anderen Beitrag](/blog/setup-kubernetes-with-cilium-and-cloudflare#example-app-mutanuq), jedoch in vier Dateien aufgeteilt, da uns dies den Vorteil bietet, das Manifest aus [GitHub](https://github.com/github)-Aktionen heraus zu manipulieren. Aber der Reihe nach: Im [nächsten Beitrag](/blog/setup-continuous-integration-github-repository) sehen Sie, wie das Manifest mit GitHub-Aktionen eingerichtet wird.",
  "Create new application in Argo CD UI": "Neue Anwendung in der Argo-CD-Benutzeroberfläche erstellen",
  "You'll probably see the big `NEW APP` button in the UI of [Argo CD](https://gith.8C955D38A27D41B77691": "Sie werden wahrscheinlich den großen Button `NEW APP` in der Benutzeroberfläche von [Argo CD](https://github.com/argoproj) sehen. Klicken Sie darauf und erstellen Sie eine neue Anwendung mit den unten angepassten Eigenschaften:",
  "Application Name: `mutanuq`": "Anwendungsname: `mutanuq`",
  "Project Name: `default`": "Projektname: `default`",
  "Sync Policy: Find out more in [this post](/blog/setup-continuous-integration-git.049A9447DEA81CE1B5DD": "Sync Policy: Erfahren Sie mehr in [diesem Beitrag](/blog/setup-continuous-integration-github-repository) / vorerst auf `Manual` lassen",
  "Repository URL: `https://github.com/trueberryless-org/mutanuq`": "Repository-URL: `https://github.com/trueberryless-org/mutanuq`",
  "Revision: `HEAD`": "Revision: `HEAD`",
  "Path: `manifest`": "Pfad: `manifest`",
  "Cluster URL: `https://kubernetes.default.svc`": "Cluster-URL: `https://kubernetes.default.svc`",
  "Namespace: `mutanuq`": "Namespace: `mutanuq`",
  "Optionally — if you have [the CLI installed](https://argo-cd.readthedocs.io/en/s.4F9EF0A15884AE51DE02": "Optional – wenn Sie [die CLI installiert haben](https://argo-cd.readthedocs.io/en/stable/cli_installation/) – können Sie diesen Befehl für dasselbe Ergebnis ausführen:",
  "Now you can hopefully see your website being deployed in the UI. This process ca.9A72C473303559E3BDC1": "Nun sollten Sie hoffentlich sehen, wie Ihre Website in der Benutzeroberfläche bereitgestellt wird. Dieser Prozess kann einige Zeit in Anspruch nehmen, da beispielsweise der Zertifikatsantrag genehmigt werden muss. Eine gesunde Anwendung sollte in etwa so aussehen:",
  "![Argo CD Example Application UI](../../../assets/argocd/argocd_example_applicat.DFA9617B17D15540EAA3": "Argo CD Beispiel-Anwendungs-UI",
  "Congratulations, you've successfully set up [Argo CD](https://github.com/argopro.99A2D6F9095CF50BC9D2": "Herzlichen Glückwunsch, Sie haben erfolgreich [Argo CD](https://github.com/argoproj) auf einem [k3s](https://github.com/k3s-io) Cluster eingerichtet! Sie haben sich eine Kaffeepause verdient. Genießen Sie eine wohlverdiente Tasse, und wenn Sie mit mir virtuell einen Kaffee teilen möchten, können Sie gerne meine Arbeit auf [Ko-fi](https://ko-fi.com/trueberryless) unterstützen. Vielen Dank!",
  "Continuation": "Fortsetzung",
  "Be continued for our [next blog](/blog/setup-continuous-integration-github-repos.C6E6C542B1FAA026061D": "Fortsetzung in unserem [nächsten Blog](/blog/setup-continuous-integration-github-repository), der beschreibt, wie ein [GitHub](https://github.com/github)-Repository eingerichtet wird, das dann über Argo CD bereitgestellt werden kann.",
  "How to create a Rehype plugin that turns GitHub links into beautiful badges": "Wie man ein Rehype-Plugin erstellt, das GitHub-Links in schöne Badges verwandelt",
  "Learn how to build a simple yet delightful Rehype plugin that automatically tran.1DBFD32D56C53FC8C2C2": "Lernen Sie, wie Sie ein einfaches und zugleich ansprechendes Rehype-Plugin erstellen, das GitHub-Profillinks automatisch in stilvolle, Abzeichen-ähnliche Links mit Profilbildern umwandelt – perfekt, um Ihrem Blog oder Ihren Dokumentationen Persönlichkeit zu verleihen.",
  "Discover how a tiny Rehype plugin can give your GitHub links a big visual upgrad.95CD8D7DFB0C962AE484": "Entdecken Sie, wie ein kleines Rehype-Plugin Ihren GitHub-Links einen großen visuellen Schub verleiht. Mit nur wenigen Zeilen Code verwandeln wir normale Profillinks in elegante Abzeichen mit Avataren, inspiriert von Antfus Website und unterstützt durch Astro + Starlight.",
  "Recently, I added a very little neat feature to this blog, which you might have .31ECBA06CD87D5CFEC39": "Kürzlich habe ich diesem Blog eine ganz kleine, aber feine Funktion hinzugefügt, die Ihnen als regelmäßiger Leser vielleicht aufgefallen ist. Es ist nichts riesiges, aber es verleiht jedem Blog diesen kleinen, charmanten Touch, nach dem ich mich schon lange gesehnt habe. Ich spreche ~~schreibe~~ von diesen grünen Abzeichen mit Profilbildern, die Sie auch in diesem Blog sehen können.",
  "The inspiration to create them was taken from none other than [Antfu](https://gi.F44018DA56F114106E55": "Die Inspiration, sie zu erstellen, stammt von niemand anderem als [Antfu](https://github.com/antfu) selbst, der solche Abzeichen überall auf seiner Website hat (zum Zeitpunkt des Schreibens).",
  "Initially I thought they would require some long and tedious programming session.255FD9F39C231A32E556": "Anfangs dachte ich, dafür wäre eine lange und mühsame Programmiersitzung nötig, um dieselbe visuelle Schönheit zu erreichen. Doch nach einigem \"Vibe Coding\" – wie [Andrej Karpathy den Begriff prägte](https://x.com/karpathy/status/1886192184808149383) – wurde mir schnell klar, dass diese Abzeichen nur ein kleines [rehype](https://github.com/rehypejs)-Plugin von ihrer Existenz entfernt waren.",
  "This is the whole code behind the rehype plugin:": "Dies ist der gesamte Code hinter dem Rehype-Plugin:",
  "Basically all this plugin does, is walking through the HTML, looking for links w.713A33AB7C816E7ADAF6": "Im Wesentlichen durchsucht dieses Plugin das HTML nach Links, die auf ein GitHub-Profil verweisen. Wenn es einen solchen Link findet, fügt es vor dem Textinhalt ein `<img>`-Tag mit dem Profilbild des GitHub-Benutzers oder der Organisation ein. Dies ist dank GitHubs Funktion, das Bild als Ressource hinter dem Profillink mit der Endung `.png` zur Verfügung zu stellen, sehr konsistent möglich. Lesen Sie mehr über diese Funktion in [diesem großartigen Artikel auf `dev.to`](https://dev.to/10xlearner/how-to-get-the-profile-picture-of-a-github-account-1d82).",
  "With a little bit of additional styling it looks really cute in my opinion. Plea.3CF02F394DFC8ECF3E94": "Mit ein wenig zusätzlichem Styling sieht es meiner Meinung nach wirklich niedlich aus. Bitte beachten Sie, dass dies eine [Starlight](https://starlight.astro.build)-Seite ist und ich verfügbare CSS-Variablen verwende, wie in Zeile vier:",
  "Now to put everything together, let's say for example in an Astro site, you just.9BE9659FCADE76D6467F": "Um nun alles zusammenzufügen, müssen Sie beispielsweise in einer Astro-Site lediglich das Rehype-Plugin wie folgt zur Konfiguration hinzufügen:",
  "Read more about the injection of rehype plugins in Astro in [their configuration.D3124728AFCD14A1CEE8": "Lesen Sie mehr über die Einbindung von Rehype-Plugins in Astro in [deren Konfigurationsreferenz](https://docs.astro.build/en/reference/configuration-reference/#markdownrehypeplugins).",
  "Do not forget to add the CSS in a similar way depending on your framework - in S.8376354E6C8822949CB6": "Vergessen Sie nicht, das CSS auf ähnliche Weise je nach Framework hinzuzufügen – in Starlight können Sie individuelle globale CSS-Stile konfigurieren, indem Sie [diese Anweisungen](https://docs.astro.build/en/guides/styling/#scoped-styles) befolgen – und schon können Sie Ihre eigenen Abzeichen-Links bewundern. Teilen Sie diesen Beitrag gerne mit jedem, den Sie dazu überzeugen möchten, diese Funktionen ebenfalls zu nutzen.",
  "✨ Bones point": "✨ Bonus-Punkt",
  "If you want to use such a badge for other links too, I recommend that you craft .E4245F963D0ACC5A33AD": "Wenn Sie ein solches Abzeichen auch für andere Links verwenden möchten, empfehle ich Ihnen, sich selbst eine kleine Astro-Komponente wie diese zu basteln:",
  "Just make sure that the CSS is globally (or [scope](https://docs.astro.build/en/.4FF4BAAF51A54FE15B11": "Stellen Sie einfach sicher, dass das CSS global ist (oder [scopen](https://docs.astro.build/en/guides/styling/#scoped-styles) Sie es in der obigen Komponente) und es ist einsatzbereit:",
  "Earworms and the message hidden within the pattern": "Ohrwürmer und die Botschaft, die im Muster verborgen liegt",
  "Some random thoughts about earworms and their message hidden within the pattern..9902F83DCFE33FCF2F42": "Einige zufällige Gedanken über Ohrwürmer und ihre Botschaft, die im Muster verborgen liegt.",
  "Yes, this title is a small nod to the excellent Netflix series \"Arcane\", but tha.13B50605E73E31D148F1": "Ja, dieser Titel ist eine kleine Hommage an die ausgezeichnete Netflix-Serie \"Arcane\", aber darum geht es in diesem Beitrag nicht.",
  "Today, I want to share some thoughts about earworms, a term that originated in G.6A8601A7B3560A913F2E": "Heute möchte ich einige Gedanken über Ohrwürmer teilen, ein Begriff, der ursprünglich aus dem Deutschen („Ohrwurm“) stammt und später als wörtliche Übersetzung ins Englische übernommen wurde. Die Bedeutung hinter diesem eher abstrakten Begriff sind eingängige Melodien—*sticky music*, wie es auf Wikipedia heißt. Dieses Phänomen tritt oft unvorhersehbar auf, besonders wenn unsere Gedanken von der Gegenwart abschweifen.",
  "While many of my blog-post ideas strike on train rides, while lying in bed, or w.25AB9868BD26D2664DE1": "Während viele meiner Blog-Ideen während Zugfahrten, im Bett liegend oder einfach beim Nachdenken über das Leben auftauchen, entstand die Inspiration für diesen Beitrag buchstäblich unter der Dusche — wie es bei den guten alten *Duschen-Gedanken* sein sollte. Der Grund – wie Sie vielleicht beim Lesen des Themas bereits erahnen können – war ein Ohrwurm von einer Melodie, bei der ich schwören könnte, dass ich sie lange nicht gehört hatte, vielleicht 4–5 Wochen.",
  "And this always seems to be the confusing parts about earworms: Nobody really kn.02E8F977B7963E92DD1D": "Und dies scheint immer der verwirrende Teil an Ohrwürmern zu sein: Niemand weiß wirklich, wer entscheidet, wann sie „abgespielt“ werden. Ist es das Gehirn, das auf „Play“ drückt, wenn es ein wenig taub ist? Sie wissen, was ich meine, diese Momente, in denen Sie nicht wirklich wissen, woran Sie aktuell denken, und auch nicht darüber nachdenken müssen, worüber Sie nachdenken sollten, sondern einfach den Moment genießen. Es gibt ein weiteres österreichisches Sprichwort für genau dieses Szenario: „ins Narrenkastl schauen“, was so viel bedeutet wie *in die Leere starren*. Und ich denke, genau diese geistesabwesenden Momente sind der Ursprung und Grund, warum Ohrwürmer entstehen.",
  "But this still leaves the question: Who decides what to play in someone's head w.869DDF0A56F11A495705": "Aber diese Frage bleibt dennoch: Wer entscheidet, was in jemandes Kopf abgespielt wird, wenn es passiert? Wer ist der DJ? Aus meiner eigenen Erfahrung habe ich ein wiederkehrendes Muster bemerkt, besonders wenn man in der letzten halben Stunde gerade Musik gehört hat. Mein Gehirn zumindest neigt dazu, Teile des **vorletzten Songs** zu wiederholen, also des Songs, der vor dem letzten Lied gespielt wurde. Diese Theorie funktioniert noch besser, wenn das letzte Lied in der Mitte pausiert oder einfach nicht perfekt zu Ende abgespielt wurde.",
  "The exact reason for that is completely unknown to me, but if I had to guess, I .A798D76B65D60FBFC400": "Der genaue Grund dafür ist mir völlig unbekannt, aber wenn ich raten müsste, würde ich sagen, dass die Rhythmen des beendeten Songs (des vorletzten) irgendwo in deinem Kopf nachhallen, da das Lied selbst vielleicht eines dieser „Ich-verstumme-langsam-zum-Ende“-Songs war, was nicht meine liebste Art ist, Musik zu beenden, aber es regt das Gehirn dazu an, weiterzumachen.",
  "At least that's what I think. I would be very interested if you have experienced.2A5110405B0386450071": "Zumindest ist das meine Vermutung. Ich wäre sehr daran interessiert, ob Sie ähnliche Muster erlebt haben, also schreiben Sie gerne Ihren eigenen Blog-Beitrag darüber oder teilen Sie diesen mit Freunden, um ihn gemeinsam zu diskutieren!",
  "Stop Outsourcing Your Soul to AI": "Stoppe das Auslagern deiner Seele an KI",
  "Reflections on AI overuse, its cognitive and social downsides, and a proposed mo.A89AED1EE3DE3D0BCC9B": "Reflexionen über den übermäßigen Einsatz von KI, deren kognitive und soziale Nachteile sowie ein vorgeschlagenes Modell zur Nutzung der KI ohne Beeinträchtigung menschlicher Kreativität und Kommunikation.",
  "It has been more than two and a half years since the release of ChatGPT. The 30<.25CE9B6E0E88F7C05662": "Es sind mehr als zweieinhalb Jahre vergangen seit der Veröffentlichung von ChatGPT. Der 30<sup>. November</sup> 2022 markierte den Beginn einer neuen Ära: den Anfang der KI. Heute nutzen viele Berufe und Privatpersonen, insbesondere im IT-Sektor, sie täglich. Und wir wissen nicht einmal, wo wir uns im Gartner-Hype-Zyklus befinden oder ob sich KI gemäß Kurzweils \"Gesetz der beschleunigten Rückkehr\" verbessern wird.",
  "The trend is still rising, but at the same time I have noticed a slight but stea.4471FBD85DD8F244947F": "Der Trend ist weiterhin steigend, aber gleichzeitig habe ich eine leichte, jedoch stetige Verschlechterung von Wissen auf menschlicher Basis bemerkt, da immer mehr kreative Arbeit an KI delegiert wird. Daher habe ich mich entschlossen, einen kleinen Blogbeitrag zu schreiben, in dem ich meine Gedanken teile, um von einem übermäßigen Einsatz Künstlicher Intelligenz abzuraten, da dieser unsere kognitiven Fähigkeiten zerstören könnte. Und obwohl ich weiß, dass nur sehr wenige Menschen dies lesen werden, hält mich das nicht davon ab, es zu versuchen. Andernfalls könnte ich meine Chance verpassen, der Zukunft der Menschheit zu helfen.",
  "**Disclaimer**: This whole blog post is created from my observations of developm.6E39A6FC36B46BF133B0": "**Hinweis**: Dieser gesamte Blogpost basiert auf meinen Beobachtungen hinsichtlich gesellschaftlicher Entwicklungen mit einem besonderen Fokus auf den Einsatz von Künstlicher Intelligenz und meiner Interpretation davon und ist daher sehr subjektiv. Ich habe keine Studien angesehen, die meine Meinung unterstützen oder ihr widersprechen.",
  "How people tend to use AI": "Wie Menschen dazu neigen, KI zu nutzen",
  "AI is awesome. I do not want to question this statement. It helped and still hel.1B73784A0B66F1C26560": "KI ist großartig. Ich möchte diese Aussage nicht in Frage stellen. Sie hat mir geholfen und hilft mir immer noch, meinen Arbeitsablauf zu verbessern, neues Wissen zu sammeln, in neue Gewässer einzutauchen und neue Technologien zu erkunden. Für Menschen, die sich nicht dafür interessieren, wie KI funktioniert, erscheinen solche intelligenten Werkzeuge wie Magie. Deshalb sehe ich gerne, wie ihre Augen funkeln und ihre Münder offen bleiben, wenn ich ihnen erkläre, dass KI lediglich auf Wahrscheinlichkeiten basiert - welches Wort am wahrscheinlichsten das nächste ist, basierend auf Eigenschaften und Emotionen in einem hochdimensionalen virtuellen Raum. [Aber das ist ein anderes Thema.](https://www.youtube.com/watch?v=LPZh9BOjkQs)",
  "What I would like to focus on is how people have come to use AI, especially over.0645ED8C57D4B143BECD": "Worauf ich mich konzentrieren möchte, ist, wie Menschen angefangen haben, KI zu nutzen, besonders in den letzten Monaten - wenn nicht Jahren. Da unser Gehirn von Natur aus faul ist, neigen wir dazu, mehr Arbeit an KI auszulagern, je weniger fokussiert wir auf eine spezifische Aufgabe sind. Mit anderen Worten: Wenn du nicht den Großteil deines Engagements in dein aktuelles Projekt steckst, bist du wahrscheinlich kurz davor, es einfach einer KI zu übertragen. Ein weiterer möglicher Grund für das Offshoring von Arbeit an die KI-Welt ist Unwissenheit über die zugrunde liegenden Technologien, was es dir erschwert, eigene Lösungen zu entwickeln.",
  "I am by no means a scientist, but I think that watching AI doing your work - bec.9C73DF2EC8CE97A8882E": "Ich bin keineswegs ein Wissenschaftler, aber ich glaube, dass das Zusehen, wie KI deine Arbeit erledigt - weil das Ergebnis, das du produzierst, aufgrund deiner Inkompetenz nicht mit deiner Vision übereinstimmt -, dir so viel Dopamin gibt, dass dein Gehirn es immer öfter tun möchte. Darüber hinaus strebt der Mensch als soziales Wesen immer danach, mit jemandem verbunden zu sein, und die Interaktion mit KI erfüllt dieses Bedürfnis. Dieses Verhalten ist typisch für unsere Gehirne und tritt auch beim Konsum von sozialen Medien oder explizitem Inhalt auf. Es ist tief in unserem Kortex verankert, und die gesamte Gaming- und Unterhaltungsbranche nutzt dies rücksichtslos, um Geld zu optimieren.",
  "Negative side effects": "Negative Nebenwirkungen",
  "I pointed out the main drawbacks of using AI too extensively that I observed. I .5A4212FD0B6A0413D8EA": "Ich habe die Hauptnachteile der extensiven Nutzung von KI, die ich beobachtet habe, beschrieben. Nun werde ich zwei kleinere Gründe nennen, die ich bei mir selbst feststellte, warum du KI nicht für expressive Arbeiten nutzen solltest.",
  "Communication decline": "Rückgang der Kommunikation",
  "While watching a promotion video from \"The Browser Company™\" (see the last link .72C7B7D43BFCB10D0126": "Während ich mir ein Werbevideo von \"The Browser Company™\" angesehen habe (siehe den letzten Link im [Ressourcenabschnitt unten](#resources-with-better-evidence)), fiel mir auf, wie weit auseinander liegend Visionen heutzutage sein können. Ich sehe diesen Trend nicht nur beim Dia-Browser, sondern in vielen verschiedenen Aspekten der Technologie und in vielen Teilen unseres Lebens. Eine Seite des Trends möchte KI überall integrieren, wo es möglich ist, und so unsere Abhängigkeit von ihr vergrößern. Ein Beispiel ist die Nutzung von KI, um Nachrichten an unsere engsten Freunde und Kollegen zu verfassen, weil es uns effizienter macht. Ich glaube, dass es uns langfristig einfach nur dumm macht.",
  "If people do not train their brains for coming up with words for communication, .0E50F4E2AEC63CCFA8CD": "Wenn Menschen ihre Gehirne nicht trainieren, um Wörter für die Kommunikation zu finden, nützliche Sätze zu bilden und Bedeutungen zu schaffen, die von anderen Menschen verstanden werden können, ist unser Fundament des Miteinander-Interagierens gebrochen, und wir wären wieder auf dem Niveau von *Homo habilis* - der letzten Spezies, die vermutlich keine vollständig entwickelte Sprache verwendete. Siehst du, ich habe KI verwendet, um genau diesen Punkt zu recherchieren, aber ich habe meine Worte bewusst gewählt, um mich auszudrücken. Auf diese Weise habe ich nicht nur etwas Neues gelernt, sondern kann es jetzt auch erinnern. Eine Fähigkeit, die du niemals haben wirst, wenn du das Schreiben an eine KI auslagerst.",
  "Loneliness": "Einsamkeit",
  "Being alone on a mental level is in my opinion one of the most underrated modern.DF4685B2DE4270080DF1": "Auf einer mentalen Ebene allein zu sein, ist meiner Meinung nach eine der am meisten unterschätzten modernen Gefahren in der Gesellschaft. Das Ironische daran ist, dass, wenn jeder allein ist, wir es alle gemeinsam haben und somit nicht mehr allein mit unserer Einsamkeit sind. Aber meine Gedanken driften wieder in andere Gewässer ab.",
  "AI strongly encourages us to be alone. It ~~acts~~ was intentionally trained to .CBE7FABA8A468DBE0C14": "KI ermutigt uns stark dazu, allein zu sein. Sie ~~agiert~~ wurde absichtlich so trainiert, als sei sie ein perfekter Freund, Kollege oder wie auch immer du es nennen möchtest. Kürzlich habe ich bemerkt, dass ChatGPTs Antworten explizit meinen Namen beinhalten, was sich für mich auf mehreren Ebenen sehr seltsam anfühlt. Man könnte argumentieren, dass dies eine private künstliche Form von Doxxing ist, was natürlich ein Oxymoron an sich ist, da Doxxing per Definition öffentlich ist. Nichtsdestotrotz: Je öfter du KI nutzt, desto *öfter* willst du KI nutzen. Besonders nach der Einführung von KI-Sprachmodi stieg dieser Trend weiter an, als gäbe es kein Morgen. Glückwunsch, ClosedAI, ihr habt die Sucht neu erfunden.",
  "In worst case scenarios, this can leads people to fear talking with other people.DE0F55D85004B91A5977": "Im schlimmsten Fall kann dies dazu führen, dass Menschen Angst haben, mit anderen zu sprechen. Freundschaften verlassen. Sich aus der Gesellschaft zurückziehen. Solche Gewohnheiten sind ernste Probleme und sollten am besten von einem Arzt oder Psychologen untersucht werden.",
  "Proposal of AI usage layer model": "Vorschlag eines Modells für den Umgang mit KI",
  "Proposing a global solution for all people of such a problem is impossible. Sinc.10DA331D742128D1E376": "Einen globalen Lösungsansatz für alle Menschen für ein solches Problem vorzuschlagen, ist unmöglich. Da jede Person ihre eigenen Erfahrungen mit KI hat, ihre eigenen Gedanken und Gefühle, Optimisten oder Pessimisten, kann ich nicht für alle sprechen. Tatsächlich denke ich, dass ich nur für mich selbst sprechen, lernen und meine eigenen Wege des Umgangs und der Einschränkung meiner KI-Nutzung teilen kann und hoffe, dass diese Erfahrungen auch dir helfen können.",
  "My ideal experiences with AI - the optimal golden way between the overuse of AI .7279A13F58BE82D3A45D": "Meine idealen Erfahrungen mit KI - der optimale goldene Weg zwischen dem übermäßigen Gebrauch von KI, der kognitiven Erosion nach sich zieht, und der Möglichkeit, den Hype zu ignorieren, ohne Vorteile zu nutzen - besteht darin, KI [genau dann](https://en.wikipedia.org/wiki/If_and_only_if) zu nutzen, wenn und nur wenn du davon profitierst. Mit anderen Worten: Kontrolliere deine Nutzung und beschränke sie auf ein Extrem, bei dem nur du selbst jemals mit den Inhalten in Kontakt kommst, die die KI produziert. Eine solche Einschränkung hat viele Konsequenzen; hier sind einige Beispiele, um besser zu verdeutlichen und zu betonen, was ich meine:",
  "Use AI for personal learning sessions: If you initially want to dive into a new,.DE3EFB49A432DEF98DFD": "Nutze KI für persönliche Lernsitzungen: Wenn du dich zunächst mit einem neuen, völlig unbekannten Thema beschäftigen möchtest, kann dir KI allgemeine Übersichten geben und Zusammenhänge zu anderen Wissensbereichen und realen Anwendungen aufzeigen. Obwohl dies nicht unbedingt bedeutet, dass du wirklich schneller oder effizienter lernst, hilft es, den ersten Schritt zu machen und den Ball ins Rollen zu bringen.",
  "Use AI for stupid and repetitive workloads and ask for help if you are certain t.ABC71EA43B6FE421530F": "Nutze KI für stupide und repetitive Aufgaben und frage nach Hilfe, wenn du sicher bist, dass das Problem oder die Aufgabe bereits von anderen tausendfach gelöst wurde. Aktuelle LLMs sind auf Basis bestehender Daten trainiert, weshalb sie gut darin sein sollten, bereits gelöste Probleme zu lösen, aber nicht das Rad neu zu erfinden, sondern die Nutzung des bestehenden runden Instruments vorzuschlagen.",
  "Do not use AI to express yourself to other people. Think about what meaning you .68CA5EC714F05E5EC131": "Verwende KI nicht, um dich anderen Menschen gegenüber auszudrücken. Denke darüber nach, welche Bedeutung du vermitteln möchtest, welches Wissen du teilen willst, und packe deine Gedanken in deine eigenen Worte. Das hilft dir enorm, deine eigenen Gedanken zu festigen, dich an das Gelernte zu erinnern und dich viel besser zu fühlen.",
  "Do not use AI to generate complex and creative work. Nowadays, there are hundred.572F9E5BBC126B708CF7": "Nutze KI nicht, um komplexe und kreative Arbeiten zu erstellen. Heutzutage gibt es Hunderte - wahrscheinlich Tausende - von Tools, die dir dabei helfen, Kunst, Musik, Code, Designs, Pläne usw. mit Hilfe von oder komplett durch KI zu erstellen. Obwohl dies den Anschein erweckt, dass du produktiver sein kannst, macht es dich in Wirklichkeit umso unwissender, je öfter du auf diese Methoden zurückgreifst, anstatt das zu tun, was du selbst gerne machst. Es ist völlig in Ordnung, kleine Teile der Arbeit an KI auszulagern, vor allem repetitive Aufgaben, die manuell einfach mehr Zeit in Anspruch nehmen würden. Kreative und originelle Arbeit hingegen sollte menschlich bleiben und mit Liebe hergestellt werden. Wenn dir das, was du tust, überhaupt nicht gefällt, ist dies ein Signal, dass du wahrscheinlich komplett damit aufhören solltest.",
  "Do not fall for all the shiny AI stuff out there. Tools like [Lovable](https://l.730DE3F722D5456EC235": "Lass dich nicht von all dem glänzenden KI-Zeug dort draußen verführen. Tools wie [Lovable](https://lovable.dev), [GitHub Copilot](https://github.com/features/copilot), [Cursor](https://cursor.com/en), [ChatGPT Voice](https://openai.com/index/chatgpt-can-now-see-hear-and-speak/) und neu auf dem Markt: [GPT-5](https://academy.openai.com/public/resources/intro-gpt-5), um nur einige zu nennen, wollen dir eigentlich nicht helfen. Sie wollen entweder direkt deine Daten oder deinen Arbeitsablauf besitzen, so dass du nicht mehr daraus entkommen kannst, sobald du dich daran gewöhnt hast. Leider gewöhnen sich Menschen faszinierend schnell an KI.",
  "In short, what I mean is that AI should be used for brainstorming and helping ea.7E4914372E95A248FB12": "Kurz gesagt, ich meine, dass KI zum Brainstorming und zur Unterstützung jedes Einzelnen bei der Erstellung eines Endprodukts verwendet werden sollte - nicht zu verwechseln mit einer durch KI erstellten Endlösung -, aber nicht für die Kommunikation mit anderen Menschen oder die Endergebnisse selbst (z. B. Bildbearbeitung, Blogartikel schreiben, Beiträge in sozialen Medien, Chatkommunikation, Motivationsreden, Essays usw.). Meiner Meinung nach kann das menschliche Gehirn nur durch eigene Fehler und Erfahrungen wachsen und lernen. Und du kannst nie aus deinen Fehlern lernen, wenn diese eigentlich von der KI generiert wurden.",
  "AI has a place in ideation, but expressive work should remain human.": "KI hat ihren Platz beim Ideensammeln, aber ausdrucksstarke Arbeit sollte menschlich bleiben.",
  "The Paradigm": "Das Paradigma",
  "I recently discovered a software design pattern called the \"Onion Architecture\"..1A7DACE78A504AB231FA": "Ich habe kürzlich ein Software-Design-Muster namens \"Onion Architecture\" entdeckt. Um die Erklärung kurz zu halten: Das Hauptprinzip dieser Architektur ist ihre Aufteilung in Schichten, wobei jede Schicht nur mit ihren beiden Nachbarn verbunden ist (Geschwister ausgeschlossen), also der inneren und der äußeren Schicht.",
  "To transfer this paradigm into the current context, you can imagine the AI as a .5C827B59D0E80CEDD730": "Um dieses Paradigma auf den aktuellen Kontext zu übertragen, kannst du dir die KI als ein Werkzeug vorstellen, das dir zur Verfügung steht, das jedoch von allen anderen Teilen unabhängig ist, da es nur von deinem Gehirn umgeben wird, und nur dein Gehirn kann auf die äußeren Schichten zugreifen, sie manipulieren, erstellen und modifizieren - in diesem Beispiel das Schreiben von Blogs, das Erstellen von Inhalten, die Kommunikation mit Menschen über Chats oder Reden oder das Ausdrücken mit Kunst oder Design.",
  "Here you can see an image that represents my idea of a limited, but ideal usage .FC6C0DF5BEEB877D3C9A": "Hier siehst du ein Bild, das meine Vorstellung von einer begrenzten, aber idealen Nutzung von KI darstellt:",
  "![Cognitive Erosion Paradigm: Layered, green circles with \"AI\" in the centre, su.960BB2813D5D36A6E62A": "Paradigma des kognitiven Verfalls: Geschichtete, grüne Kreise mit \"KI\" im Zentrum, umgeben vom \"Gehirn\", das wiederum von mehreren kreisförmigen Segmenten im Uhrzeigersinn beschriftet ist mit \"Design\", \"Blog\", \"Chats\", \"Kunst\", \"Inhalt\" und \"Rede\".",
  "If such an architectural approach and the paradigm in this context are optimal o.F0EEC9F2B664B2C7C023": "Ob ein solcher architektonischer Ansatz und das Paradigma in diesem Kontext optimal oder nur subjektiv sind, kann in den Kommentaren unten kritisiert werden.",
  "As I said in the beginning, this blog post is very opinionated and aims to just .944F71E911107ACEF8FC": "Wie ich zu Beginn gesagt habe, ist dieser Blog-Beitrag sehr meinungsbasiert und soll lediglich meine Erfahrungen mit jedem teilen, damit du auch aus meinen Fehlern lernen und deine eigene Nutzung von KI optimieren kannst, um sie besser unter Kontrolle zu haben. Am Ende kannst du machen, was du willst, aber sei dir der Degradierung deines eigenen Gehirns bewusst, wenn du auch in die Falle der Übernutzung tappst.",
  "Also one thing to note: It took me several months to write this blog post, refin.DCE5417F165917B5411C": "Eine Sache möchte ich noch erwähnen: Es hat mich mehrere Monate gekostet, diesen Blog-Post zu schreiben, zu überarbeiten und wieder von vorne anzufangen. Kein Blog ist perfekt, wie du vielleicht bei diesem hier bemerkt hast. Es gibt wahrscheinlich einige grammatikalische Fehler hier und da, einige Sätze, die tatsächlich keinen Sinn ergeben, aber das macht Menschen menschlich. Darüber hinaus gibt es sehr wahrscheinlich viele starke Meinungen in diesem Blog, bei denen du vollkommen widersprechen und überhaupt nicht mit mir übereinstimmen wirst (ich freue mich darauf, deine Kommentare zu sehen, die deinen Unmut ausdrücken), aber das macht mich aus. Mein Gehirn, meine Gedanken, meine Meinung.",
  "\"errare humanum est\"": "\"errare humanum est\"",
  "Resources with better evidence": "Ressourcen mit fundierteren Beweisen",
  "If you are interested in articles which are based on more scientific studies or .951C297E7674ED83CB82": "Wenn du an Artikeln interessiert bist, die auf wissenschaftlicheren Studien oder Ansätzen basieren, kannst du einige oder alle davon lesen. Sie sind in keiner bestimmten Reihenfolge, also starte einfach in der Mitte und arbeite dich nach oben oder unten. 😊",
  "AI coding tools make developers slower but they think they're faster, study find.7985A3C197B7C985AEA3": "Studie zeigt, dass KI-Code-Tools Entwickler verlangsamen, obwohl sie sich schneller fühlen",
  "Companies That Tried to Save Money With AI Are Now Spending a Fortune Hiring Peo.AFFFD5071F8FB5C78BE9": "Firmen, die mit KI Geld sparen wollten, geben jetzt ein Vermögen aus, um ihre Fehler zu beheben",
  "Linus Torvalds reckons AI is ‘90% marketing and 10% reality’": "Linus Torvalds meint, KI sei '90% Marketing und 10% Realität'",
  "The AI Girlfriend situation is SAD (YouTube.com)": "Die Situation mit KI-Freundinnen ist TRAURIG (YouTube.com)",
  "Will AI make you stupid?": "Macht KI dumm?",
  "AI isn't making us more productive. It's making us cognitively bankrupt. (X.com).D1B0FEDE875E93283AD0": "KI macht uns nicht produktiver. Sie macht uns kognitiv bankrott. (X.com)",
  "Being Addicted To Generative AI": "Süchtig nach generativer KI sein",
  "Yet Another Study Finds That AI Is Making Us Dumb": "Eine weitere Studie zeigt, dass KI uns dumm macht",
  "Is AI making us smarter Or dumber?… Or artificially smarter? (AI symbiotic crisi.3143888590C5284B32CA": "Macht KI uns intelligenter oder dümmer?... Oder künstlich intelligenter? (KI-symbiotische Krise)",
  "The most powerful ways to \"hack\" our new Dia browser (YouTube.com)": "Die leistungsfähigsten Wege, unseren neuen Dia-Browser zu \"hacken\" (YouTube.com)",
  "Happy reading!": "Viel Spaß beim Lesen!",
  "Accelerating translations with continuous integration": "Beschleunigung von Übersetzungen mit kontinuierlicher Integration",
  "The story of how my journey of contributions to action-continuous-translation st.539B68E34D18B54F07FE": "Die Geschichte darüber, wie meine Reise mit Beiträgen zu action-continuous-translation begann.",
  "<p>I have been working in OSS on <a class=\"gh-badge\" href=\"https://github.com/gi.8F9A527414094F26EF41": "<p>Ich arbeite seit über einem Jahr in OSS auf <a class=\"gh-badge\" href=\"https://github.com/github\"><img src=\"https://github.com/github.png\" alt=\"github\" />GitHub</a> und obwohl ich dachte, ich hätte alles gefunden, zu dem ich beitragen möchte, entdeckte ich kürzlich <a class=\"gh-badge\" href=\"https://github.com/pelikhan\"><img src=\"https://github.com/pelikhan.png\" alt=\"pelikhan\" />Pelis</a> persönliches Projekt <a href=\"https://github.com/pelikhan/action-continuous-translation\">action-continuous-translation</a>, und ich bin sehr glücklich, dass ich dort regelmäßig Beiträge leiste und jetzt Teil der kleinen Community bin.</p>",
  "For the last year, I have been working a lot in various Open Source Communities .D0EE1E8417F371E1353F": "Im vergangenen Jahr habe ich in meiner Freizeit viel in verschiedenen Open-Source-Communitys auf GitHub gearbeitet und habe diese irgendwie entspannenden Beiträge genossen, weil sie mir täglich neues Wissen vermitteln.",
  "After some time contributing I also got to know how kind and welcoming communiti.6B14A5E726DED7FDE5C1": "Nach einiger Zeit des Mitwirkens habe ich auch erfahren, wie freundlich und einladend die Communitys hinter diesen Projekten sind. Diese Menschen haben alle eines mit dir gemeinsam: Sie möchten in ihrer Freizeit großartige Dinge erschaffen. Besonders die [Astro](https://github.com/withastro)-Community ist diejenige, in der ich mich am wohlsten fühle, da sie gleichzeitig am lohnendsten und freundlichsten ist. Nicht alle Communitys können einen so großartigen Status unter OSS erreichen.",
  "Recently, I discovered another evolving project founded by [pelikhan](https://gi.90E9DCA5FB8FA470B7FE": "Kürzlich entdeckte ich ein weiteres wachsendes Projekt, das von [pelikhan](https://github.com/pelikhan) gegründet wurde und das darauf abzielt, alle deine Dokumentationen, Blogs oder Shop-Seiten automatisch mit Hilfe von KI zu übersetzen, sobald sich etwas ändert. Obwohl ich anfangs skeptisch war, hat mich das Lesen der README.md des Projekts fasziniert.",
  "The approach of strictly guiding AI into only translating little chunks - mostly.EFA08DBC1CAAB5CE6D3C": "Der Ansatz, die KI strikt dazu anzuleiten, nur kleine Abschnitte – hauptsächlich Sätze oder Absätze – mit perfektionistischen Anweisungen zu übersetzen, ließ mich denken, dass dies wirklich funktionieren könnte. Also probierte ich es in meinem eigenen Projekt aus, meinem Blog. Und zu meiner Überraschung waren diese Übersetzungen viel besser als erwartet. Natürlich merkt man, dass es von einer KI übersetzt wurde – handgefertigte Arbeit wird hoffentlich nie vollständig ersetzt – aber wenn man fair erwähnt, dass man eine KI verwendet, ist dies für Menschen viel zugänglicher als nichts.",
  "So I took a closer look at the actual code of the project. After noticing some l.04C2097BA41406300A39": "Also warf ich einen genaueren Blick auf den eigentlichen Code des Projekts. Nachdem ich einige kleine Unstimmigkeiten, Verbesserungspotenziale und fehlende, aber sehr coole Funktionen hier und da bemerkte, begann ich ebenfalls, dort beizutragen. Ich meine, nach einem Jahr Beiträge zu größeren Projekten waren Pull Requests für mich nichts Neues.",
  "You have to know that this was a Friday evening - almost night in my timezone - .F07D43687D090B7997ED": "Man muss wissen, dass dies ein Freitagabend war – fast Nacht in meiner Zeitzone – und [Peli](https://github.com/pelikhan) war gerade online und führte Commit um Commit für das Projekt durch. Ich bemerkte schnell, dass Peli im Gegensatz zu den anderen Projekten, in denen ich mitwirke, keine Zeit mit dem Mergen von Pull Requests verschwendete. Es fühlte sich diese Nacht sehr lohnend an, da ich einfach bis 1 Uhr morgens weitermachte, Peli schneller merge als ich Features, Dokumentationen und Fixes verbessern konnte. Ein weiterer Aspekt, der großartig war, war, dass Peli, da dies ein junges Projekt war, nicht zögerte, einfach zu mergen, es lokal auszuprobieren und dann kleine Fixes zu pushen, die ich übersehen hatte.",
  "Fast-forward three days and I am now an official contributor to the project, mak.3479DA18B6C4E8D9A8EE": "Drei Tage später bin ich nun ein offizieller Contributor des Projekts und trage fast täglich dazu bei, es immer weiter zu verbessern, wobei mein Hauptfokus auf der Dokumentation und der Unterstützung für mein Herzensprojekt liegt: Starlight – wie ihr vielleicht schon aus [meinen Blogs](/blog/tags/starlight/) erraten habt.",
  "Peli and I have our virtual productivity sessions between 4pm and 8pm UTC, exten.51E309B378285EAEEA84": "Peli und ich haben unsere virtuellen Produktivitätssitzungen zwischen 16:00 und 20:00 UTC, die an Wochenenden auch länger dauern. Wenn du als Frühaufsteher des Projekts mitmachen oder Interesse daran hast, es zu nutzen, schau es dir gerne auf [GitHub](https://github.com/github) an: [https://github.com/pelikhan/action-continuous-translation](https://github.com/pelikhan/action-continuous-translation)",
  "Designing a No-Account, No-Database Approach to Time Tracking": "Entwerfen eines Ansatzes für Zeiterfassung ohne Konto und ohne Datenbank",
  "A private time-tracking app storing all data in your browser — no accounts, no d.F138A1009E69F5985E79": "Eine private Zeiterfassungs-App, die alle Daten in deinem Browser speichert — keine Konten, keine Datenbank, nur einfache Erfassung.",
  "True Tracker is a minimalist time-tracking app built with Next.js that keeps all.83D3C3B8B44C4975D8DD": "True Tracker ist eine minimalistische Zeiterfassungs-App, die mit Next.js entwickelt wurde und alle Daten in deinem Browser speichert — keine Konten, keine Datenbank, einfach nur vollständige Privatsphäre und Einfachheit.",
  "The summer of 2024 marked the start of an exciting new chapter for me as a devel.4693500D69418D01C04B": "Der Sommer 2024 markierte den Beginn eines aufregenden neuen Kapitels für mich als Entwickler. Bis zu diesem Zeitpunkt hatte ich hauptsächlich mit Angular gearbeitet, einem Framework, das ich für seinen strukturierten und meinungsstarken Ansatz schätzte. Aber ich war immer neugierig auf React gewesen – es fühlte sich leichter, flexibler und einfach… anders an. Als ich auf Next.js stieß, ein Framework von [Vercel](https://github.com/vercel), das auf React aufbaut und Funktionen wie serverseitiges Rendering und einen Fokus auf Performance bietet, wusste ich, dass es an der Zeit war, etwas Neues auszuprobieren.",
  "At the same time, I'd been frustrated for ages with session tracking tools like .03C6C9A3C18CFB3FDCD1": "Zur gleichen Zeit war ich seit Langem über Tools zur Sitzungsverfolgung wie Toggl frustriert. Theoretisch sind sie großartig, aber ihre besten Funktionen schienen immer hinter teuren Bezahlwänden versteckt zu sein. Wie jeder Entwickler irgendwann dachte ich: *„Warum baue ich mir nicht einfach mein eigenes?“* Es ist praktisch ein Übergangsritus – jeder Programmierer muss mindestens einmal eine To-Do-App oder einen Tracker in seiner Karriere erstellen. Und so wurde True Tracker geboren.",
  "True Tracker wouldn't just be any tracker, though. I wanted to do something diff.A78A97DDBF776E5A3623": "True Tracker sollte jedoch kein gewöhnlicher Tracker sein. Ich wollte etwas anderes machen. Zunächst wollte ich es einfach halten: Benutzer konnten Projekte hinzufügen, sie in Aufgaben unterteilen und ihre Zeit in Sitzungen erfassen. Kein Schnickschnack, keine unnötigen Funktionen. Doch hier kommt der Clou — True Tracker würde alles im lokalen Speicher speichern. Keine Konten, keine Cloud-Synchronisierung, und vor allem, niemand (nicht einmal ich) hätte Zugriff auf deine Daten. Es ist dein Tracker, und deine Daten bleiben deine.",
  "Of course, transitioning from Angular to Next.js wasn't without its challenges. .42B63477ABA3012B4AFB": "Natürlich war der Übergang von Angular zu Next.js nicht ohne Herausforderungen. Wenn ich jemandem, der ein neues Framework lernt, einen Rat geben könnte, dann wäre es dieser: *Lies die Dokumentation.* Ernsthaft, überspring sie nicht. Ich tat es nicht, und das führte zu Chaos. Next.js war kürzlich auf den App-Router umgestiegen, aber ich begann stur, mit dem Page-Router zu bauen. Das führte zu einem Berg von Problemen, als die App nicht richtig gebaut werden konnte, weil kein `app`-Verzeichnis vorhanden war. Ich musste eine leere `.gitkeep`-Datei im Ordner belassen, nur damit Git sie nicht löscht und alles erneut kaputt macht. Nicht mein stolzester Moment.",
  "After two weeks of nonstop coding, debugging, and running into what felt like ev.6C07E411C9E65C40E90F": "Nach zwei Wochen ununterbrochenem Codieren, Debuggen und dem Gefühl, auf jeden erdenklichen Fehler zu stoßen, funktionierte True Tracker endlich. Ich erinnere mich an diesen ersten erfolgreichen Lauf – es fühlte sich an wie ein innerlicher Schrei *„Es lebt!“*.",
  "The project also wasn't without its jokes. A friend, after seeing the app's bran.4E6FB3382F951646087C": "Das Projekt war auch nicht ohne seine Witze. Ein Freund meinte nach einem Blick auf das Branding der App: „Also … das ‚true‘ in True Tracker? Das ist ein bisschen zu viel, selbst für das Bild. Es ist *zu viel Wahrheit!*“ Sie hatten nicht unrecht, aber ich nahm es an. Schließlich, wenn man etwas brandet, sollte man es auch durchziehen.",
  "True Tracker became my first-ever Next.js project—a simple but unique app for tr.252C96FD81AA9227820E": "True Tracker wurde mein allererstes Next.js-Projekt – eine einfache, aber einzigartige App zur Zeiterfassung ohne Bedingungen. Sie ist jetzt live unter [https://true-tracker.trueberryless.org](https://true-tracker.trueberryless.org/).",
  "The journey taught me more than just how to use Next.js. It taught me about push.4577627813AA93D48F0F": "Die Reise lehrte mich mehr, als nur wie man Next.js verwendet. Sie lehrte mich, Herausforderungen zu überwinden, zwischen Frameworks zu wechseln und die Eigenheiten zu schätzen, die jedes Projekt einzigartig machen. True Tracker ist nicht nur eine App; es ist ein Meilenstein – ein kleiner Beweis dafür, dass auch kleine Ideen eine große Wirkung haben können.",
  "Designing a Kafka-Based Pipeline and Interactive Graph for Energy Anomaly Detect.6E40C602D9518B54F990": "Entwicklung einer Kafka-basierten Pipeline und eines interaktiven Graphen zur Erkennung von Energieanomalien",
  "A SOA solution with Siemens AG to analyze power grid anomalies, featuring a Kafk.7FC6E382F6C39EFB4296": "Eine SOA-Lösung mit Siemens AG zur Analyse von Netzwerkanomalien im Stromnetz, mit einer Kafka-Pipeline, PostgreSQL, GraphQL-API und einem Angular-Dashboard zur Visualisierung.",
  "For our diploma thesis with Siemens AG, we built a service-oriented solution to .E03A3AD551F1B141D274": "Für unsere Diplomarbeit mit Siemens AG haben wir eine dienstorientierte Lösung entwickelt, um Netzwerkanomalien im Stromnetz zu erkennen — mit einer Kafka-Pipeline, PostgreSQL, GraphQL-API sowie einem Angular-Dashboard mit Tabellen und einem interaktiven Graphen zur Echtzeitvisualisierung.",
  "During my fifth year at HTL Krems (2023/24), every student was required to compl.33C68E23474119532BF0": "Während meines fünften Jahres an der HTL Krems (2023/24) musste jeder Schüler eine Diplomarbeit absolvieren – ein umfangreiches Projekt, das in zwei Hauptteile unterteilt war: theoretisch und praktisch. In Zweierteams verfassten wir eine theoretische Arbeit von etwa 100 Seiten, in der wir unser gewähltes Thema vorstellten, analysierten und erklärten.",
  "The theoretical part was organized into three sections. The first involved gathe.383BAC1FDBC3A2145A6D": "Der theoretische Teil war in drei Abschnitte gegliedert. Der erste bestand darin, vorhandenes Wissen aus glaubwürdigen Quellen wie Büchern und früheren Arbeiten zu sammeln und zusammenzufassen. Der zweite konzentrierte sich auf die Erkenntnisse und Ergebnisse, die wir aus unserem Prototyp – einer Softwarelösung, die wir für den praktischen Teil entwickelten – gewonnen hatten. Schließlich kombinierte der dritte Abschnitt diese beiden Ansätze und bot einen kritischen Vergleich und eine Reflexion darüber, was wir durch das Projekt insgesamt gelernt hatten.",
  "The practical aspect required us to design and implement a solution, either soft.9F57571ADA22C3F461BC": "Der praktische Teil verlangte von uns, eine Lösung zu entwerfen und umzusetzen, die entweder software- oder hardwarebasiert war, um ein realweltliches Problem zu lösen. Mein Teamkollege Clemens Schlipfinger und ich entschieden uns ausschließlich auf Software zu konzentrieren, um die Zuverlässigkeit zu gewährleisten. Hardware kann unvorhersehbare Probleme verursachen, aber Software – insbesondere, wenn sie in robusten Docker-Containern bereitgestellt wird – bietet eine konsistente Umgebung, die überall nahtlos funktioniert.",
  "What made our project particularly exciting was our partnership with Siemens AG,.E3DFFF62A58AA54FFAF4": "Was unser Projekt besonders spannend machte, war unsere Partnerschaft mit Siemens AG, einem renommierten multinationalen Unternehmen, das auf Energie-, Automatisierungs- und Digitalisierungslösungen spezialisiert ist. Diese Zusammenarbeit war unter unseren Mitschülern selten und verlieh unserem Projekt eine professionelle Dimension. Siemens beauftragte uns, eine dienstorientierte Softwarelösung zur Analyse von Anomalien im europäischen Stromnetz zu entwickeln.",
  "The system we built comprised several components, each designed to handle a spec.66064ADCDD1375BE0F9A": "Das von uns entwickelte System bestand aus mehreren Komponenten, die jeweils für eine spezifische Funktion konzipiert waren. Im Kern befand sich eine Kafka-Anwendung, die für die Erfassung von Daten verantwortlich war – Berichte über Netzwerkanomalien, die wir als „Findings“ bezeichneten. Diese Berichte dokumentierten Ausfälle und Unregelmäßigkeiten im komplexen europäischen Stromnetz, das aus Millionen von verbundenen Komponenten wie Transistoren, Schaltern und Generatoren besteht. Kafka übermittelte die neuesten Anomalien an eine PostgreSQL-Datenbank, die dann über eine GraphQL-API zugänglich gemacht wurde. Diese API bot umfassende Funktionen wie Paginierung, Filterung und Abfragen, um eine nahtlose Integration mit unserem Angular-basierten Frontend zu gewährleisten.",
  "The frontend was designed as a user-friendly dashboard with three key sections:": "Das Frontend wurde als benutzerfreundliches Dashboard mit drei Hauptbereichen gestaltet:",
  "Anomalies Table – A searchable, paginated, and filterable table for quick naviga.530B334CB3F183450BCF": "Anomalien-Tabelle – Eine durchsuchbare, paginierte und filterbare Tabelle für die schnelle Navigation durch Anomalien.",
  "Graph View – A dynamic visualisation of anomaly data, making it easier to pinpoi.FA55A622C6F84DDFA484": "Graph-Ansicht – Eine dynamische Visualisierung der Anomaliedaten, um die Quelle eines Problems im weitläufigen, komplexen Netz leichter zu lokalisieren.",
  "Overall Dashboard – Key metrics and insights for quick, actionable overviews.": "Gesamtdashboard – Wichtige Kennzahlen und Einblicke für schnelle, umsetzbare Übersichten.",
  "Clemens and I divided our responsibilities evenly. Clemens handled the backend s.57A227B299EB92B6AC25": "Clemens und ich teilten unsere Verantwortlichkeiten gleichmäßig auf. Clemens übernahm die Backend-Systeme, einschließlich Kafka, PostgreSQL und der GraphQL-API, und sorgte für eine zuverlässige und effiziente Daten-Pipeline. Ich übernahm die Rolle des Projektleiters, koordinierte die Kommunikation mit Siemens und entwickelte das Frontend, um die nahtlose Integration der verschiedenen Komponenten sicherzustellen. Diese Zusammenarbeit ermöglichte es uns, unsere Stärken einzusetzen und eine ausgewogene Arbeitsverteilung aufrechtzuerhalten.",
  "Our final product not only met Siemens' requirements but also demonstrated the p.3DFD3D918F5BEBCA8D06": "Unser Endprodukt erfüllte nicht nur die Anforderungen von Siemens, sondern demonstrierte auch die Stärke einer gut gestalteten dienstorientierten Architektur (SOA) zur Lösung komplexer, realweltlicher Probleme. Es war äußerst befriedigend, unsere Software zuverlässig arbeiten zu sehen und verwertbare Einblicke zur Bewältigung von Stromnetzanomalien zu liefern.",
  "For more details about our work, feel free to explore our thesis [here](https://.404251D1094C50B2114B": "Für weitere Details zu unserer Arbeit können Sie unsere Thesis [hier](https://trueberryless.org/thesis.pdf) 📜 einsehen oder unseren Videokurs [hier](https://videos.trueberryless.org/videos/thesis/) 🎥 anschauen (beides nur auf Deutsch verfügbar).",
  "![Terraform Variables Resolution Example](../../../assets/blog/terraform-variabl.112614E03BD3DF5C3717": "Terraform-Variablen-Auflösungsbeispiel",
  "How I Built a GitHub Profile README That Shouldn't Exist (But It Does)": "Wie ich ein GitHub-Profil-README erstellt habe, das es eigentlich nicht geben sollte (aber es gibt es)",
  "Creating a standout <a class=\"gh-badge\" href=\"https://github.com/github\"><img sr.2311B04CBE33507503C4": "Ein herausragendes <a class=\"gh-badge\" href=\"https://github.com/github\"><img src=\"https://github.com/github.png\" alt=\"github\" />GitHub</a>-Profil-README zu erstellen, bedeutet nicht nur, ein paar Abzeichen hinzuzufügen — es geht darum, technische Grenzen zu überschreiten. In diesem tiefgehenden Einblick erkunde ich Low-Level-SVG-Manipulation, HTML-zu-SVG-Konvertierung, Inline-Animationen und vollständige Automatisierung mit GitHub Actions, um das vielleicht technisch fortschrittlichste GitHub-README zu erstellen. Von einem dynamischen Bento-Grid, das alle 5 Minuten aktualisiert wird, bis hin zum Einbetten von Live-SVGs ohne externe Anfragen hat dieses Projekt mein Profil in eine lebendige, sich selbst aktualisierende Präsentation meiner Arbeit verwandelt. Neugierig, wie ich das gemacht habe? Lass uns loslegen. 🚀",
  "Read the more formal story [here](/blog/github-profile-readme/)": "Lies die formellere Geschichte [hier](/blog/github-profile-readme/)",
  "GitHub's Markdown [strips out a not a huge number of HTML tags, but important on.205FA73346A246681FB2": "Die GitHub-Markdown [entfernt nicht eine riesige Anzahl von HTML-Tags, aber wichtige](https://github.github.com/gfm/#disallowed-raw-html-extension). Aus Sicherheitsgründen natürlich (und das respektiere ich vollkommen, GitHub, wirklich ❤️), aber das bedeutete, dass mein perfektes Design komplett **unbrauchbar** war.",
  "I tried tweaking it. Replacing unsupported tags with ones that worked. Maybe I c.9C1A1617434D20136447": "Ich habe versucht, es anzupassen. Nicht unterstützte Tags durch funktionierende zu ersetzen. Vielleicht konnte ich etwas retten? *Nein*. Die Einschränkungen von Markdown machten mein Traum-Layout unmöglich.",
  "When in doubt, automate. If I couldn't get my HTML in directly, maybe I could ge.1858A8B032C310D0855B": "Wenn du dir unsicher bist, automatisiere es. Wenn ich mein HTML nicht direkt einfügen konnte, vielleicht konnte ich etwas Dynamisches mit einem Skript generieren? Also habe ich ein Python-Skript zusammengestellt, um mein neuestes GitHub-Repository abzurufen und in mein README einzufügen. Ich lasse hier einfach ein paar zufällige Bytes, die einige als Python-Code bezeichnen könnten:",
  "This seemed like a step in the right direction. It was automated. It was functio.C4E6DC32E9331691DF3A": "Das schien ein Schritt in die richtige Richtung zu sein. Es war automatisiert. Es funktionierte. Aber es löste nicht mein eigentliches Problem. 😢",
  "This wasn't about dynamic content — it was about *design*. And no amount of Pyth.DA93C57EF8343BE1D312": "Es ging nicht um dynamischen Inhalt — es ging um *Design*. Und keine Menge Python-Scripting würde Markdown schön aussehen lassen.",
  "![Throw away a good idea](../../../assets/blog/technically-impressive-github-pro.03B551FCEE5B8C4D1AE7": "Eine gute Idee wegwerfen",
  "I realised that if I couldn't directly embed HTML into Markdown, I could fake it.9ED2A1ECED976015FF4F": "Mir wurde klar, dass, wenn ich HTML nicht direkt in Markdown einfügen konnte, ich es vortäuschen konnte, indem ich verschachtelte SVGs verwendete. (Übrigens ist dies stark vereinfacht; der tatsächliche Prozess dauerte Tage, die sich wie Wochen, wenn nicht Monate anfühlten, aber ich weiß, dass ihr das sowieso nicht alles lesen würdet, also wen interessiert's?)",
  "Encode all images in **Base64** (because GitHub Markdown won't load external ima.E9111278458075460675": "Alle Bilder in **Base64** kodieren (da GitHub Markdown keine externen Bilder innerhalb eines SVG mit HTML lädt).",
  "It updates itself every 5 minutes, runs completely on GitHub Actions, and doesn'.83A1BE6CD135F68513B3": "Es aktualisiert sich alle 5 Minuten, läuft vollständig auf GitHub Actions und ist nicht auf externe Dienste angewiesen. Es ist wunderschön. Es ist effizient. Und vor allem ist es technisch absurd im besten Sinne.",
  "Isn't that bad compared to the [old README.md](https://github.com/trueberryless/.6E17F52CECF11CDBE670": "Ist das nicht schlecht im Vergleich zum [alten README.md](https://github.com/trueberryless/trueberryless/blob/5dce4ad0033b00829f8ec3756827057017447a65/README.md). Und kommentier bitte nicht, warum ich K-Pop höre! Es ist besser, als du denkst, glaub mir.",
  "But in the end, I created a [GitHub](https://github.com/github) profile README t.B8AC0FFCEFB516E68262": "Aber am Ende habe ich ein [GitHub](https://github.com/github)-Profil-README erstellt, das *eigentlich nicht existieren sollte* — aber es existiert. Und ich liebe es.",
  "![Default styling of the Starlight sidebar](../../../assets/blog/starlight-sideb.0331D38A07873367F480": "Standarddesign der Starlight-Seitenleiste",
  "![Starlight sidebar where the margin between root-level items is smaller](../../.89CA79CF269489CCFFC6": "Starlight-Seitenleiste, bei der der Abstand zwischen den Elementen auf Root-Ebene kleiner ist",
  "![Starlight sidebar with lighter font weight](../../../assets/blog/starlight-sid.4E8DAA65B21751F8D390": "Starlight-Seitenleiste mit leichterem Schriftgewicht",
  "![Starlight sidebar with dimmer colors](../../../assets/blog/starlight-sidebar-w.BD6139B97F87359FF661": "Starlight-Seitenleiste mit schwächeren Farben",
  "![Starlight sidebar with smaller font size](../../../assets/blog/starlight-sideb.951F34B3CACD02E0A935": "Starlight-Seitenleiste mit kleinerer Schriftgröße",
  "![Final result with desktop view on the left and mobile view on the right](../...FD8F8FAFE2FBDBE76329": "Endergebnis mit Desktop-Ansicht auf der linken und mobiler Ansicht auf der rechten Seite",
  "A Stylish Way to Give Credit in Starlight Projects": "Eine stilvolle Möglichkeit, Anerkennung in Starlight-Projekten zu geben",
  "Inspired by the Starlight credit in Astro docs, I made a customizable plugin tha.6909F2E2BE5CAB2C314C": "Inspiriert von der Starlight-Anerkennung in den Astro-Dokumentationen habe ich ein anpassbares Plugin entwickelt, das Links zu Starlight, Astro und dem Starlight Blog bietet, mit Unterstützung für mehrere Sprachen.",
  "Starlight Cooler Credit is a customizable plugin that gives stylish, multilingua.4FCC5DBB2DC131D33CAC": "Starlight Cooler Credit ist ein anpassbares Plugin, das stilvolle, mehrsprachige Anerkennungslinks zu Starlight, Astro und dem Starlight Blog bietet – und damit eine kleine Idee in eine globale Zusammenarbeit verwandelt.",
  "It all started when I noticed the credit link to [Starlight](https://starlight.a.E3176BDD24D595103F8B": "Alles begann, als mir der Anerkennungslink zu [Starlight](https://starlight.astro.build) in den [Astro-Dokumentationen](https://docs.astro.build) auffiel. Am unteren Ende des Inhaltsverzeichnisses positioniert, war er einfach, aber stilvoll, und ich liebte, wie subtil er Anerkennung gab. Als Starlight seine eigene Anerkennungsoption einführte, aktivierte ich sie in all meinen Projekten. Sie war klein, unaufdringlich und am unteren Ende jeder Seite platziert – nett, aber leicht zu übersehen.",
  "That’s when I thought, *What if others want a cooler credit option, like the one.A4A2F8A54AB64409161B": "Da dachte ich, *Was ist, wenn andere eine coolere Anerkennungsoption möchten, wie die aus den Astro-Dokumentationen?* Also machte ich mich daran, ein Plugin zu erstellen. Anfangs war es nur ein spaßiges Projekt, um auf auffälligere Weise Links zu Starlight und Astro bereitzustellen. Ich begann mit zwei Voreinstellungen – eine für Starlight und eine für Astro – und teilte meine Arbeit auf dem Astro-Discord.",
  "That’s where things took off. [One awesome Astro maintainer](https://www.rainsbe.B87402A9E163AA44FD52": "Und dort nahm alles Fahrt auf. [Ein großartiger Astro-Maintainer](https://www.rainsberger.ca/) schlug vor, *\"Warum nicht auch den Starlight-Blog verlinken?\"* und ich dachte, *Was für eine brillante Idee!* Ich fügte den Blog als dritte Voreinstellung hinzu, und plötzlich war das Plugin mehr, als ich je geplant hatte.",
  "But I wasn’t done yet. It bugged me that the credits were always in English, so .2030C81E5E275567F632": "Aber ich war noch nicht fertig. Es störte mich, dass die Anerkennung immer auf Englisch war, also beschloss ich, sie automatisch anhand der von Starlight unterstützten Sprachen übersetzen zu lassen. Da begann das eigentliche Abenteuer. Ich wandte mich an die Community, um Hilfe bei der Übersetzung des Plugins in verschiedene Sprachen zu erhalten. Die Resonanz war unglaublich! Menschen aus der ganzen Welt boten ihre Unterstützung an, und was als Solo-Projekt begann, wurde zu einer globalen Zusammenarbeit. Unterwegs fand ich neue Freunde und lernte so viel von allen Beteiligten. Jetzt unterstützt das Plugin etwa zehn Sprachen, und es kommen immer mehr Übersetzungen hinzu.",
  "What started as a simple idea turned into something I’m really proud of: **Starl.95365D5202F9DED635D6": "Was als einfache Idee begann, wurde zu etwas, auf das ich wirklich stolz bin: **Starlight Cooler Credit**. Es ist mehr als nur ein Plugin – es ist eine Möglichkeit, Anerkennung mit Stil, Anpassungsfähigkeit und einem Hauch von globaler Teamarbeit zu geben.",
  "If you’re curious, you can check it out at [starlight-cooler-credit.trueberryles.6ABA7C0A45AE4104F8C3": "Wenn du neugierig bist, kannst du es dir unter [starlight-cooler-credit.trueberryless.org](https://starlight-cooler-credit.trueberryless.org/) ansehen. Probier es aus – ich denke, du wirst es genauso lieben wie ich!",
  "![Cloudflare API Token](../../../assets/blog/setup-kubernetes-with-cilium-and-cl.03ECE300FA8789879B29": "Cloudflare API-Token",
  "Organising School Life: The Journey Behind Mutanuq": "Die Organisation des Schullebens: Die Reise hinter Mutanuq",
  "A fast, Markdown-powered website that organises school content, simplifies learn.C76D3D9450130FF80C83": "Eine schnelle, Markdown-basierte Website, die Schulinhalte organisiert, das Lernen vereinfacht und das Bildungswachstum unterstützt.",
  "Mutanuq is a fast, Markdown-powered website I built to organize school content, .8D9E316ADD5966467825": "Mutanuq ist eine schnelle, Markdown-basierte Website, die ich entwickelt habe, um Schulinhalte zu organisieren, das Lernen effizienter zu gestalten und eine verlässliche Ressource sowohl für meine Mitschüler als auch für mich selbst zu schaffen.",
  "In my second year at HTL Krems, 2021, I embarked on a project that combined two .4F2292C7BC6324244DF9": "Im zweiten Jahr an der HTL Krems, 2021, begann ich ein Projekt, das zwei Leidenschaften von mir vereinte: meine eigene Website zu erstellen und bessere Wege zu finden, den unendlichen Strom an Schulmaterial zu organisieren. Wie viele Schüler waren meine Notizen über OneNote, Word-Dateien, Excel-Tabellen, Google Drive und sogar Tools wie [Witeboard](https://witeboard.com/) verstreut. Das Chaos war überwältigend und machte es schwer, sich effektiv auf das Lernen zu konzentrieren.",
  "Driven by the vision of streamlining this process—not just for me, but also for .767678E51699FE7BA56A": "Getrieben von der Vision, diesen Prozess zu vereinfachen – nicht nur für mich, sondern auch für meine Mitschüler – entschied ich mich, eine zentrale Plattform zu schaffen, um Schulinhalte zusammenzufassen. Mein Ziel war zweigeteilt: Das Lernen zu vereinfachen und meine Mitschüler zu motivieren.",
  "At that time, I wasn’t aware of frameworks that could make building documentatio.46FC3F67CBB578E4C0C2": "Zu jener Zeit kannte ich keine Frameworks, die es einfacher gemacht hätten, dokumentationsartige Websites zu erstellen. Stattdessen nutzte ich reines HTML, CSS und JavaScript, um die ersten Versionen dessen zu entwickeln, was ich *Schneider IT* nannte. Obwohl ich es liebte, daran zu arbeiten, waren meine ersten Versuche umständlich – die dynamische Generierung des Inhaltsverzeichnisses und der Seitenleiste mit eigenem JavaScript-Code führte zu quälend langsamen Ladezeiten. Es dauerte über 10 Sekunden, bis alles angezeigt wurde!",
  "Despite the setbacks, I kept iterating. By 2023, I had created and discarded abo.4C51D8C17C02D0DB4703": "Trotz der Rückschläge arbeitete ich weiter daran. Bis 2023 hatte ich rund 10 Versionen der Website erstellt und verworfen, immer auf der Suche nach einem klareren Design und einem effizienteren Verwaltungssystem. Das Potenzial der Website war mir klar, doch an der Benutzerfreundlichkeit fehlte es noch.",
  "That’s when I stumbled upon [Starlight](https://starlight.astro.build/), a power.2C6631782B77735B3205": "Dann entdeckte ich [Starlight](https://starlight.astro.build/), ein leistungsstarkes und beeindruckendes Framework, erstellt von [Chris Swithinbank (@delucis)](https://github.com/delucis), um schnelle, Markdown-basierte Websites zu entwickeln. Diese Entdeckung war ein Wendepunkt – sie erlaubte mir, zwei meiner Leidenschaften zu verbinden: Websites zu erstellen und Markdown für seine Einfachheit und Eleganz zu nutzen.",
  "With the transition to Starlight, Schneider IT evolved into *Mutanuq*. The new n.99A51B0573CAAE76AA7D": "Mit dem Wechsel zu Starlight entwickelte sich *Schneider IT* zu *Mutanuq*. Der neue Name markierte einen Neuanfang und spiegelte die optimierte, modernisierte Website wider, die sie inzwischen geworden war. Ich schrieb alles neu, optimierte die Leistung der Website und konzentrierte mich darauf, Inhalte zu erstellen, die speziell auf die Bedürfnisse meiner Mitschüler zugeschnitten waren, insbesondere für bevorstehende Prüfungen.",
  "The transformation paid off. Friends began using the website regularly and gave .0C49D62224878320182A": "Die Transformation machte sich bezahlt. Freunde begannen, die Website regelmäßig zu nutzen und gaben begeistertes Feedback, wie *„Bro, diese Website sieht fantastisch aus!“* Mutanuq war nicht nur ein Werkzeug für Prüfungen – es wurde zu einer vertrauenswürdigen Ressource für meine Mitschüler und einem persönlichen Archiv für all das Wissen, das ich über die Schule hinaus bewahren wollte.",
  "Thanks to Starlight, managing and expanding Mutanuq became effortless, and the p.DA9EDB995FD28655BD1F": "Dank Starlight wurde das Verwalten und Erweitern von Mutanuq mühelos, und das Projekt entwickelte sich zu etwas, das ich bis heute gerne weiterführe. Was als *Schneider IT* begann – eine kleine Idee, meine Notizen zu organisieren – erblühte zu *Mutanuq*, einer Plattform, die das Lernen für andere vereinfacht und wertvolles Wissen für mein zukünftiges Ich bewahrt.",
  "Designing a Profile That Works Within GitHub's Rules": "Entwerfen eines Profils, das innerhalb der GitHub-Regeln funktioniert",
  "How I Built a GitHub Profile README That Shouldn't Exist But It Does": "Wie ich ein GitHub-Profile-README erstellt habe, das es eigentlich nicht geben sollte, aber es existiert",
  "Every great project starts with a realization of a problem. My GitHub profile RE.481577399AECDF28BE26": "Jedes großartige Projekt beginnt mit der Erkenntnis eines Problems. Mein GitHub-Profile-README war überladen, voll mit zu vielen Informationen, zu vielen Abzeichen und einer überwältigenden Menge an Inhalten, die Stil und Struktur fehlten. Es gab Erfolge von Hackathons, GitHub-Beitragsgrafiken, verschiedene technische Abzeichen und vieles mehr, was es visuell unansprechend und schwer navigierbar machte. Anfangs dachte ich, dies sei eine effektive Art, mich zu präsentieren, aber mit der Zeit wurde klar, dass die Informationen eher überwältigend als informativ waren. Ich wollte etwas Neues, einen raffinierteren und visuell ansprechenderen Ansatz, um mein Profil zu präsentieren, und die Idee, ein Bento-Raster zu implementieren, kam mir in den Sinn. Das Ziel war es, ein Layout zu schaffen, das nicht nur funktional, sondern auch ästhetisch beeindruckend und strukturiert ist.",
  "The first step was designing an ideal layout using HTML and CSS. The result was .6D5E560BE64C73324B74": "Der erste Schritt bestand darin, ein ideales Layout unter Verwendung von HTML und CSS zu entwerfen. Das Ergebnis war vielversprechend, ein strukturiertes und optisch ansprechendes Design, das die beabsichtigten Informationen effektiv vermittelte. Doch die direkte Umsetzung in meinem GitHub-Profile-README war nicht unkompliziert. GitHub-Flavored Markdown unterliegt strengen Einschränkungen hinsichtlich der unterstützten HTML-Elemente aufgrund von Sicherheitsvorgaben. Viele essenzielle HTML-Tags waren eingeschränkt, was es unmöglich machte, das Design wie vorgesehen einzubetten. Das Verständnis dieser Einschränkungen bedeutete, dass der gesamte Ansatz neu durchdacht werden musste.",
  "Faced with these restrictions, I considered alternative ways to dynamically gene.2567BD537B285ECB001A": "Angesichts dieser Einschränkungen überlegte ich, alternative Wege zu finden, um die Inhalte dynamisch zu generieren und zu präsentieren. Ein Ansatz bestand darin, die Inhaltsaktualisierungen mit einem Python-Skript zu automatisieren, um mein neuestes GitHub-Repository abzurufen und es dynamisch in das README einzufügen. Das Skript griff auf die GitHub-API zu, rief das zuletzt aktualisierte Repository ab und änderte entsprechend das README. Obwohl dies ein interessantes Experiment in Automatisierung war, löste es nicht das Kernproblem, nämlich die Notwendigkeit eines strukturierten und visuell ansprechenden Designs.",
  "Considering alternative approaches, I briefly entertained the idea of taking a s.780BAADFF3D433749DDA": "Unter Berücksichtigung alternativer Ansätze dachte ich kurzzeitig daran, einen Screenshot des entworfenen HTML-Layouts zu machen und ihn als statisches Bild im README einzubetten. Obwohl dies das Problem visuell gelöst hätte, fühlte es sich wie eine unelegante Lösung an, die mangelnde Flexibilität und Reaktionsfähigkeit aufwies. Weitergehend suchte ich nach einer Methode, die sowohl Struktur als auch Anpassungsfähigkeit ermöglichte und dennoch dynamische Inhaltsaktualisierungen beibehielt.",
  "SVGs emerged as a potential solution. They support scalability, maintain visual .0193206311AC8FC941A3": "SVGs traten als eine potenzielle Lösung in Erscheinung. Sie unterstützen Skalierbarkeit, bewahren die visuelle Klarheit über verschiedene Auflösungen hinweg und ermöglichen das Einbetten von Texten und anderen Elementen. Ein frühes Experiment beinhaltete das Einbetten von HTML in ein SVG unter Verwendung des `foreignObject`-Tags. Obwohl dies konzeptionell vielversprechend war, erwies sich die Umsetzung als komplex und wurde vorübergehend beiseite gelegt. Beim späteren Zurückkehren zum Problem war ein strukturierterer Ansatz erforderlich.",
  "The final approach involved using a composite SVG structure. The solution consis.F542E5E0B858565590BE": "Der endgültige Ansatz beinhaltete die Verwendung einer zusammengesetzten SVG-Struktur. Die Lösung bestand aus mehreren Schlüsselkomponenten: Konvertierung des ursprünglichen HTML-Layouts in eine SVG-Darstellung, Kodierung von Bildern mit Base64, um sicherzustellen, dass sie korrekt geladen wurden, Integration dynamischer Elemente wie GitHub-Statistiken und Spotify-Status-Updates als Inline-SVGs sowie Automatisierung der Updates über GitHub Actions. Durch den Einsatz dieser Techniken wurde das Bento-Rasterlayout voll funktionsfähig, konnte sich selbst aktualisieren und behielt dabei ein sauberes, strukturiertes Erscheinungsbild innerhalb der Einschränkungen von GitHub-Flavored Markdown bei.",
  "A critical turning point was the discovery of a Stack Overflow post detailing a .BFAFB816D1969BB990B1": "Ein entscheidender Wendepunkt war die Entdeckung eines Stack Overflow-Beitrags, der eine Methode zur effizienten und effektiven Konvertierung von HTML in SVG beschrieb. Diese Methode bot eine strukturierte Möglichkeit, die erforderlichen SVG-Elemente zu generieren, während das beabsichtigte Design beibehalten wurde. Durch die Kombination dieser Methode mit Base64-Kodierung für Bilder und GitHub Actions zur Automatisierung entstand eine vollständig realisierte Lösung, die alle ursprünglichen Anforderungen erfüllte.",
  "The final implementation consists of a refined and visually striking GitHub prof.C95E5BCA4CC5C610AAF2": "Die endgültige Implementierung besteht aus einem verfeinerten und visuell eindrucksvollen GitHub-Profile-README, das dynamische Inhaltsaktualisierungen integriert und dabei eine elegante Struktur beibehält. Sie präsentiert Informationen klar, ohne unnötige Überladung, und ist vollständig automatisiert, aktualisiert sich alle fünf Minuten ohne manuelles Eingreifen. Das Projekt erforderte umfangreiche Recherche und Experimente mit SVGs, GitHub Actions und Markdown-Einschränkungen. Der Prozess verlangte Ausdauer und Problemlösungsfähigkeiten, um innerhalb der Plattformbeschränkungen ein technisch beeindruckendes Ergebnis zu erzielen. Das Resultat ist ein GitHub-Profile-README, das Design, Automatisierung und Funktionalität innerhalb der Beschränkungen der Plattform effektiv ausbalanciert.",
  "If you're now inspired to create a stunning GitHub profile README yourself, read.BC2C5ED3BDEE87A869B8": "Wenn du nun inspiriert bist, selbst ein beeindruckendes GitHub-Profile-README zu erstellen, lies meinen [technischeren und humorvollen Blog-Beitrag](/blog/technically-impressive-github-profile-readme/) oder schau direkt in mein Repository [github.com/trueberryless/trueberryless](https://github.com/trueberryless/trueberryless/tree/7519c6f50094bdfd6fb47f610e6638ac8efdd6ad). Und falls dir meine Arbeit hilft, gib ihr gern einen ⭐ und folge mir auf GitHub unter [trueberryless](https://github.com/trueberryless)! 🚀",
  "I noticed this trend myself, as you can clearly see from [some of my posts where.6F67065684689D74728B": "Diesen Trend habe ich selbst bemerkt, wie man deutlich sehen kann aus [einigen meiner Beiträge, bei denen ich zugab, KI verwendet zu haben](/blog/authors/artificial-intelligence/), um mir beim Schreiben zu helfen. Aber ich denke, das ist keine Schande. Jeder Content-Ersteller, der KI einsetzt, sollte aus erster Hand die Fallstricke erleben, die entstehen, wenn Inhalte direkt für den Betrachter oder Leser erstellt werden, um zu erkennen, wie wenig sie letztlich über das Thema wissen. Dies ermöglicht es ihnen, aus ihrem Fehler zu lernen und sich bewusst zu sein, wie leicht Faulheit zu einem solch verachteten Weg führen kann. Nur die Exzellenten unter uns strebten von Anfang an nach handgefertigten Inhalten.",
  "![Cognitive Erosion Paradigm: Layered, green circles with \"AI\" in the centre, su.38D1FAC9088D0BD4738E": "Kognitionserosionsparadigma: Geschichtete, grüne Kreise mit \"KI\" in der Mitte, umgeben vom \"Gehirn\", das von mehreren kreisförmigen Segmenten umgeben ist, welche im Uhrzeigersinn mit \"Design\", \"Blog\", \"Chats\", \"Kunst\", \"Inhalt\" und \"Rede\" beschriftet sind.",
  "From Balloons to Binary: A 20th Birthday Packed with Clues": "Von Luftballons zu Binärcode: Ein 20. Geburtstag voller Rätsel",
  "This is the story of creating a true art masterpiece.": "Dies ist die Geschichte der Schaffung eines wahren Kunstmeisterwerks.",
  "This year, I turned 20 - and instead of simply lighting candles and inflating ba.CEC0F0AD03DAEF815274": "Dieses Jahr wurde ich 20 – und anstatt einfach Kerzen anzuzünden und Luftballons aufzublasen, wollte ich auf kreativere und persönlichere Weise feiern. Die Idee? Die Zahl 20 in so vielen überraschenden, cleveren und versteckten Formen wie möglich in einem dekorierten Wohnzimmer zu verstecken – und dann alles in einem einzigen Foto festzuhalten. Ob durch mathematische Rätsel oder visuelle Ostereier, der Raum verwandelte sich in ein fröhliches Rätsel voller spielerischer Details.",
  "I Turned 20 - And Turned It Into a Puzzle": "Ich wurde 20 – und verwandelte es in ein Puzzle",
  "The final result wasn't just a festive setting, but a carefully designed puzzle .B767471D3FEF6C98BD69": "Das Endergebnis war nicht nur eine festliche Umgebung, sondern ein sorgfältig gestaltetes Puzzle voller Bedeutung, Humor und subtiler Anspielungen auf Dinge, die ich liebe. Einige Hinweise sind leicht zu erkennen, andere sind tief versteckt oder erfordern kreative Interpretation – aber jetzt, da die Herausforderung öffentlich ist, ist es Zeit für die offizielle Auflösung.",
  "Altogether, the number 20 (or variations of it) appears **73 times** throughout .913452A34E0ADB471EF0": "Insgesamt erscheint die Zahl 20 (oder Variationen davon) **73 Mal** auf dem Bild. Dazu gehören 14 Fälle der wörtlichen Zahl „20“, die in cleveren Formen wie Barcodes, QR-Codes und Hexadezimalwerten versteckt sind, sowie sechs Fälle, in denen Objekte genau in zwanziger Mengen auftreten. Außerdem sind 32 „20“-Darstellungen auf Geburtstagsballons im Raum verteilt – obwohl etwa die Hälfte davon nicht aus der Perspektive der Kamera sichtbar ist – und fünf weitere Verweise, die auf kreative Weise meinen Geburtstag über Zahlen wie 2025 oder 2005 reflektieren.",
  "Roughly 40 of these clues are clearly visible and solvable from the photo alone..900B0E49D675342ADE28": "Etwa 40 dieser Hinweise sind direkt auf dem Foto sichtbar und lösbar. Der Rest erfordert etwas Querdenken oder Vorstellungskraft, um entdeckt zu werden – vor allem diejenigen, die sich knapp außerhalb des zweidimensionalen Rahmens des Bildes verstecken.",
  "How the “20” Was Hidden": "Wie die „20“ versteckt wurde",
  "Many of the 20s are woven directly into the decor. There's a bright 20 km/h road.DF20030D8A7B9E4CCCF0": "Viele der Zwanziger sind direkt in die Dekoration integriert. Es gibt ein helles 20-km/h-Verkehrsschild, riesige Regenbogen-Folienballons in den Ziffern 2 und 0 und ein großes „Happy 20th Birthday“-Banner, das über das Fenster gespannt ist. Ein Geburtstags-„Kuchen“ aus 20 Rollen Toilettenpapier steht prominent in der Mitte, umgeben von dekorativen Gegenständen wie Uhren, Obst, Ferrero Rocher Pralinen, Partylampen und Spielsteinen – alle absichtlich in Mengen von 20 gruppiert.",
  "Then come the mathematical twists: two QR codes subtly lead to the number 20. Th.631C4BD85BA49B72C4E1": "Dann kommen die mathematischen Wendungen: Zwei QR-Codes führen subtil zur Zahl 20. Es gibt einen Morsecode-Streifen, einen Binärcode (10100) und eine in Hexadezimal dargestellte Farbe, die in Basis<sub>10</sub> zu 20 konvertiert wird. Ein Barcode verbirgt die Zahl visuell, während ein Blatt Spielkarten (Ass, Bube, Dame, König) clever auf 20 summiert. Ein Domino-Paar ergibt ebenfalls die magische Zahl. Sogar ein Stück Kuchen auf der Couch – genau 20 % des Ganzen – setzt das Thema fort.",
  "Some of the trickiest clues are tucked into logic puzzles. For example, the appl.3E1D246EA1E47E0643AB": "Einige der kniffligsten Hinweise sind in Logikrätseln versteckt. Zum Beispiel ähneln die Äpfel und Birnen im Holzregal 1en und 0en, und wenn man sie richtig entschlüsselt, ergeben sie „Fe“ – eine subtile Anspielung auf meinen Namen, Felix. Würfel auf dem Tisch sind so gedreht, dass man die versteckten Oberseiten ableiten kann. Deren Summe ergibt 20.[^1] Und die größte Herausforderung: ein Bündel Mikado-Stäbchen, deren gesamte sichtbare Punktzahl 110 beträgt – was, wenn in Basis<sub>4</sub> interpretiert, genau 20 im Dezimalsystem entspricht. Ein echtes Rätsel im Rätsel!",
  "Fun fact: The tops of the dice should add up to 20, but in the final picture, th.1AD6690ECD087653EA2B": "Fun Fact: Die oberen Seiten der Würfel sollten 20 ergeben, aber im finalen Bild summieren sich diese nur auf 12. Das liegt daran, dass die fünf Würfel nicht mit dem gleichen Konstruktionsschema hergestellt wurden – zwei folgen einer Uhrzeigerrichtung, drei einer gegenläufigen, wie [hier auf Wikipedia](https://en.wikipedia.org/wiki/Dice#Arrangement) erklärt. 😂",
  "A few clues also fall under the “pop culture knowledge” category. There's a ment.AB39B4A99B41F7978013": "Einige Hinweise fallen auch in die Kategorie „Popkulturwissen“. Es gibt eine Erwähnung von Rihanna, die wie ich am 20. Februar geboren wurde. Eine kleine Hommage an Hans Zimmer und Christopher Nolan verweist auf ihre Zusammenarbeit im Jahr 2005 in Batman Begins – dem Jahr, in dem ich geboren wurde.",
  "A Snapshot of My Musical Taste": "Ein Einblick in meinen Musikgeschmack",
  "While not directly part of the 20-themed puzzle, there's a musical layer hidden .E75B2EA910ADE079A758": "Auch wenn es nicht direkt Teil des 20-Themen-Puzzles ist, gibt es eine musikalische Ebene im Bild, die etwas Tiefpersönliches widerspiegelt: meine Liebe zur Musik. In der oberen linken Ecke sind acht quadratische Albumcover ordentlich angeordnet, und jedes enthält einen Spotify-Code, der zu einem meiner absoluten Lieblingsstücke führt. Etwas weiter rechts stellt das neunte Cover eine Playlist dar, die all diese Songs zusammenbringt – ein kleiner kuratierter Soundtrack meiner Welt.",
  "Each song on that list has earned its place not just for how it sounds, but for .64FF10782E65A696CFEC": "Jeder Song auf dieser Liste hat sich seinen Platz nicht nur durch seinen Klang verdient, sondern auch durch die Geschichten, Erinnerungen und Emotionen, die er transportiert. Und am wichtigsten: durch die großartigen Künstler, die ihn geschaffen haben.",
  "It starts with *Molossus* from Batman Begins, a powerful, rising track that intr.0B2CCAEA825C10332861": "Es beginnt mit *Molossus* aus Batman Begins, einem kraftvollen, aufbauenden Track, der mich in die epische Verschmelzung von Film und Musik durch die Arbeit von Hans Zimmer und Christopher Nolan – einem meiner Lieblingsduos aus Regisseur und Komponist – eingeführt hat. Der Film wurde 2005 veröffentlicht, im Jahr meiner Geburt, und obwohl The Dark Knight mein persönlicher Favorit ist, wird sich Molossus immer ikonisch anfühlen.",
  "Next is *9-bit Expedition* from the Fastfall soundtrack, composed by Lifeformed..60068D27CC86091CE517": "Als nächstes kommt *9-bit Expedition* aus dem Fastfall-Soundtrack, komponiert von Lifeformed. Ihr ruhiger, von Chiptune inspirierter Stil trifft genau den richtigen Ton, zu dem ich immer wieder zurückkehre. Ich bewundere ihre Arbeit so sehr, dass ich ihre Tracks in selbstgebauten Celeste-Leveln verwendet habe – nicht nur, weil sie passen, sondern weil ihre Musik mir etwas bedeutet.",
  "And then there's *Resurrections* from Celeste - a game I've easily spent 200-300.94D4BAA5C193535ECDD8": "Und dann ist da noch *Resurrections* aus Celeste – ein Spiel, das ich problemlos 200–300 Stunden gespielt habe. Die wahre Magie der Atmosphäre liegt bei Lena Raine, deren Musik eine Art hat, in deine Emotionen einzutauchen und etwas Rohes und Schönes hervorzuziehen. Ihre Kompositionen sind mehr als nur Hintergrundmusik – sie sind das Erlebnis. Ich betrachte sie ehrlich gesagt als eine der inspirierendsten Komponistinnen, die ich je gehört habe, und ihre Arbeit an Celeste ist ein Meisterwerk, das ich nie aufhören werde zu bewundern.",
  "Also in the mix is *22:12 - Until the End of Time* by Danger, from the Haven sou.72EAD217688685BCB963": "Auch dabei ist *22:12 - Until the End of Time* von Danger, aus dem Haven-Soundtrack. Ich habe das Spiel nicht einmal gespielt – die Musik allein hat mich in ihren Bann gezogen. Sie ist filmisch, emotional und komplett immersive. Danger hat es absolut geschafft, durch Sound eine Welt zu erschaffen, in der ich mich stundenlang verlieren könnte.",
  "*Annihilate* from Across the Spider-Verse is another standout. I love both movie.9437FFA646F4451D9745": "*Annihilate* aus Across the Spider-Verse ist ein weiterer Höhepunkt. Ich liebe beide Filme aus der Serie, und dieser Track fängt perfekt die Energie, den Stil und die Emotion von Miles' Geschichte ein. Ein klanglicher Ausbruch, der nie alt wird.",
  "From a totally different genre comes *ROTTWEiLER* by TJ\\_beastboy, a German rapp.B95612C092ABF85A718D": "Aus einem ganz anderen Genre kommt *ROTTWEiLER* von TJ\\_beastboy, einem deutschen Rapper, der meiner Meinung nach auf einem völlig anderen Level ist. Er kombiniert entspannte Vibes und mitreißende Intensität auf eine Weise, die frisch und echt wirkt. Seine Musik hat immer etwas Einzigartiges zu sagen, und ich finde ehrlich, dass er einer der besten Künstler zurzeit ist.",
  "Another track I couldn't leave out is *747* from Tenet - another mind-bending No.89615FC31E49EF7EA4BB": "Ein weiterer Track, den ich nicht weglassen konnte, ist *747* aus Tenet – einem weiteren mind-bending Nolan-Film, vertont von Ludwig Göransson. Die Energie, das Tempo und der Aufbau dieses Stücks treffen einfach ins Schwarze. Es ist leicht einer meiner Lieblingsfilmsoundtracks aller Zeiten, und Göransson zeigt weiterhin, dass er ein Genie der Filmmusik ist.",
  "Last but far from least: *MORE* by K/DA - my most-played song ever. It's high-en.12164785491B9D2DAF37": "Zu guter Letzt: *MORE* von K/DA – mein meistgespielter Song überhaupt. Er ist energiegeladen, poliert, selbstbewusst und einfach rundum spaßig. K-Pop ist allgemein viel zu unterschätzt, und dieser Track ist der Beweis, dass Genregrenzen keine Rolle spielen, wenn ein Song auf jeder Ebene funktioniert.",
  "These songs - and the brilliant minds behind them - aren't just background music.E5DA08D529E76E42DBB3": "Diese Songs – und die brillanten Köpfe dahinter – sind nicht bloß Hintergrundmusik. Sie sind Teil meiner kreativen Welt, meiner emotionalen Landschaft und der Soundtrack zu allem, was ich liebe.",
  "Stats for Nerds": "Statistiken für Nerds",
  "For those who enjoy data and structure, here's a little summary of all 20s in th.B3CE0613F24C05B8FFE5": "Für diejenigen, die Daten und Struktur lieben, hier ist eine kleine Zusammenfassung aller \"20\" im Bild:",
  "Category": "Kategorie",
  "Count": "Anzahl",
  "Total hidden instances": "Gesamte versteckte Instanzen",
  "73x": "73x",
  "Clearly visible and solvable": "Klar sichtbar und lösbar",
  "\\~40x": "\\~40x",
  "Written \"20\"": "Geschriebene \"20\"",
  "14x": "14x",
  "Groups of 20 identical items": "Gruppen von 20 identischen Gegenständen",
  "6x": "6x",
  "Birthday balloons printed with \"20\"": "Geburtstagsballons mit \"20\" bedruckt",
  "32x": "32x",
  "Creative variations (e.g., 2025, 2005)": "Kreative Variationen (z. B. 2025, 2005)",
  "5x": "5x",
  "Puzzle Solutions": "Rätsel-Lösungen",
  "Code Type": "Code-Typ",
  "Representation": "Darstellung",
  "QR Codes": "QR-Codes",
  "Bar Code": "Barcode",
  "20\\. February": "20. Februar",
  "Binary Code": "Binärcode",
  "Today is February 20th, 2025": "Heute ist der 20. Februar 2025",
  "Base": "Base",
  "Code": "64",
  "My birthday is February 20th, 2005": "Mein Geburtstag ist der 20. Februar 2005",
  "Hex Code (Color Codes)": "Hex-Code (Farbcodes)",
  "twenty": "zwanzig",
  "Morse Code": "Morse-Code",
  "20\\. FEBRUARY 2005": "20. FEBRUAR 2005",
  "Playing Cards": "Spielkarten",
  "King (4) + Queen (3) + Jack (2) + Ace (11) = 20": "König (4) + Dame (3) + Bube (2) + Ass (11) = 20",
  "Domino": "Domino",
  "(0|2) + (3|3) + (4|0) + (2|1) + (1|0) + (2|2) = 20": "(0|2) + (3|3) + (4|0) + (2|1) + (1|0) + (2|2) = 20",
  "Apples (0) and Pears (1)": "Äpfel (0) und Birnen (1)",
  "Binary Code: Fe": "Binärcode: Fe",
  "Mikado Sticks Value": "Wert der Mikadostäbchen",
  "110 (base": "110 (Basis",
  ") = 20 (base": "4) = 20 (Basis",
  "Dice top sides": "10)",
  "It was a joy to turn this celebration into a personal challenge and to see frien.C633AD0611AAAC49C2DA": "Oben liegende Würfelseiten",
  "How to fully autogenerate Starlight sidebars (without losing control)": "Wie man Starlight-Sidebars vollständig automatisch erstellt (ohne die Kontrolle zu verlieren)",
  "Learn two Starlight techniques to autogenerate large sidebars while keeping clea.20BC1955A37AA7859B18": "Erfahren Sie zwei Starlight-Techniken, um große Sidebars automatisch zu erstellen und dabei saubere URLs und Beschriftungen beizubehalten.",
  "Have you ever wanted to simplify sidebar generation in your Starlight project? H.2D5E37D5439F17736C27": "Haben Sie jemals versucht, die Generierung von Sidebars in Ihrem Starlight-Projekt zu vereinfachen? Haben Sie versucht, die gesamte Sidebar automatisch zu erstellen, nur um festzustellen, dass Sie die Struktur nicht nach Ihren Wünschen anpassen können?",
  "This post demonstrates two Starlight features that make fully autogenerated side.BDF2E65CF1AF47E9F83B": "Dieser Beitrag zeigt zwei Starlight-Funktionen, die es ermöglichen, vollständig automatisch generierte Sidebars flexibel zu gestalten und den Wartungsaufwand zu reduzieren.",
  "Use case": "Anwendungsfall",
  "In medium to large Starlight projects, the problem arises that the manual creati.11763E0A14C36D449179": "In mittelgroßen bis großen Starlight-Projekten stellt sich das Problem, dass die manuelle Erstellung und Pflege der [Starlight-Sidebar-Konfiguration](https://starlight.astro.build/reference/configuration/#sidebar) eine mühsame und zeitaufwändige Aufgabe ist.",
  "In the past, Starlight didn't provide the right primitives for this, and the rec.48BF051900AF52DB446D": "In der Vergangenheit bot Starlight nicht die richtigen Grundfunktionen dafür, und der empfohlene Ansatz bestand darin, die automatische Erstellung der Sidebar-Konfiguration um eine Ebene tiefer zu verschieben - sodass nur Ordner ohne verschachtelte Unterordner automatisch generiert wurden. Mit der Einführung von [Route Data](https://starlight.astro.build/guides/route-data/) und dem jüngeren [`generateId()`-Hook im `docsLoader`](https://starlight.astro.build/reference/configuration/#generateid) können diese Szenarien nun jedoch viel einfacher und effizienter gelöst werden.",
  "Solving the ordering issue": "Das Sortierungsproblem lösen",
  "A common problem always was: \"How can I customise the order of sidebar folders i.AE2CA0CC5AC2560DCF3C": "Ein häufiges Problem war immer: „Wie kann ich die Reihenfolge der Sidebar-Ordner anpassen, wenn ich die Sidebar automatisch generiere?“ Alte Probleme wie [#1223](https://github.com/withastro/starlight/issues/1223) schlagen eine Lösung vor, die von [Nuxt Content](https://content.nuxt.com) inspiriert ist, bei der jeder Abschnitt des gesamten Pfads [mit Zahlen + Punkten vorangestellt](https://v2.content.nuxt.com/usage/content-directory#ordering) werden kann, um eine nummerische Sortierung auf Dateibasis festzulegen. Ein Beispiel für ein solches Projekt könnte so aussehen:",
  "src/content/docs/nested-folder": "src/content/docs/nested-folder",
  "1.frameworks": "1.frameworks",
  "1.vue.md": "1.vue.md",
  "2.nuxt.md": "2.nuxt.md",
  "2.examples": "2.examples",
  "1.vercel.md": "1.vercel.md",
  "2.netlify.md": "2.netlify.md",
  "If you want to use this approach in Starlight, it doesn't work out-of-the-box, b.1799E45D5D83874DE15D": "Wenn Sie diesen Ansatz in Starlight verwenden möchten, funktioniert er nicht sofort, aber mit einer einfachen Einrichtung können Sie ihn umsetzen.",
  "Starlight [0.35.0](https://github.com/withastro/starlight/releases/tag/%40astroj.5B25A8356D4B9CE00F94": "Starlight [0.35.0](https://github.com/withastro/starlight/releases/tag/%40astrojs%2Fstarlight%400.35.0) führte eine Callback-Funktion ein, die Sie an `docsLoader()` übergeben können, um die ID (URL) der generierten Seite zu manipulieren. Indem Sie den Eintrag durch `\"/\"` aufteilen und jede Zahl + Punkt auf Segmentebene entfernen, haben Sie nun die gleiche Funktionalität in Starlight:",
  "The URL to access the pages now changes e.g., from `/nested-folder/1.frameworks/.6941CF02484C8DCB2B28": "Die URL zum Zugriff auf die Seiten ändert sich nun z. B. von `/nested-folder/1.frameworks/1.vue` zu `/nested-folder/frameworks/vue`.",
  "However, the folder names in the sidebar still include the `1.` prefixes. So let.0CAEBB02FF8EEAA7C1F1": "Allerdings enthalten die Ordnernamen in der Sidebar immer noch die `1.`-Präfixe. Lassen Sie uns also auch die Manipulation der Sidebar lösen:",
  "Solving the sidebar folder naming issue": "Das Problem der Ordnerbenennung in der Sidebar lösen",
  "Starlight [0.32.0](https://github.com/withastro/starlight/releases/tag/%40astroj.7F6BC940CC96F2ABA63D": "Starlight [0.32.0](https://github.com/withastro/starlight/releases/tag/%40astrojs%2Fstarlight%400.32.0) führte [Route Data](https://starlight.astro.build/guides/route-data/) ein, das wir jetzt nutzen können, um die Ordnernamen in der Sidebar zu manipulieren:",
  "remove any leading number + dot from the folder name and": "das Entfernen jeder führenden Zahl + Punkt aus dem Ordnernamen und",
  "apply \"Title Case\" so they don't look completely lowercase": "die Anwendung von \"Title Case\", damit sie nicht vollständig kleingeschrieben erscheinen",
  "Internationalisation (i18n)": "Internationalisierung (i18n)",
  "Note that [internationalisation (i18n) of folder names](https://starlight.astro..78D4931CBD055B889B4B": "Beachten Sie, dass die [Internationalisierung (i18n) von Ordnernamen](https://starlight.astro.build/guides/sidebar/#internationalization) bei einem solchen Setup eine fehlende Funktionalität ist, da es derzeit keinen Ort gibt, an dem Übersetzungen von Ordnernamen definiert werden können. Sie werden einfach in Title Case umgewandelt. Die Implementierung einer Logik zum dynamischen Laden von Übersetzungen könnte darin bestehen, das [`locale`-Feld aus den Routeninformationen](https://starlight.astro.build/reference/route-data/#locale) zu lesen und Übersetzungen in `json`-Dateien zu definieren. Andernfalls können Sie [HiDeoos Plugin verwenden](#using-hideoos-plugin), das [i18n unterstützt](https://starlight-auto-sidebar.netlify.app/guides/i18n/).",
  "Don't forget to add the `routeData.ts` file to your `astro.config.mjs`:": "Vergessen Sie nicht, die Datei `routeData.ts` zu Ihrer `astro.config.mjs` hinzuzufügen:",
  "Of course you can adjust the code to your needs (e.g., remove the \"Title Case\" t.8EE143244F5E89BEFCE4": "Natürlich können Sie den Code an Ihre Bedürfnisse anpassen (z. B. die \"Title Case\"-Transformation entfernen, da Ihre Dateinamen bereits korrekt geschrieben sind).",
  "Using HiDeoo's plugin": "Das Plugin von HiDeoo verwenden",
  "If you want to autogenerate your whole sidebar and still have the flexibility to.AB216A94695F22CEA149": "Wenn Sie Ihre gesamte Sidebar automatisch generieren und dennoch die Flexibilität haben möchten, alles nach Ihren Wünschen anzupassen, hat [HiDeoo](https://github.com/HiDeoo) auch ein dediziertes Plugin für solche Anwendungsfälle erstellt: [Starlight Auto Sidebar](https://starlight-auto-sidebar.netlify.app).",
  "Especially those two features got mentioned in this article:": "Insbesondere wurden diese zwei Funktionen in diesem Artikel erwähnt:",
  "Controlling the [order](https://starlight-auto-sidebar.netlify.app/metadata/#ord.08329D63645DA7FDB0F2": "Die Steuerung der [Reihenfolge](https://starlight-auto-sidebar.netlify.app/metadata/#order) einzelner Verzeichnisse",
  "Adapting the [displayed label](https://starlight-auto-sidebar.netlify.app/metada.41A180D1D992072397D3": "Die Anpassung der [angezeigten Beschriftung](https://starlight-auto-sidebar.netlify.app/metadata/#label) einzelner Ordner",
  "However, if you want to automate the whole generation without having to specify .AA2463868A43906766FA": "Wenn Sie jedoch die gesamte automatische Generierung durchführen möchten, ohne für jedes Verzeichnis manuell Beschriftungen und Reihenfolgen festlegen zu müssen, ist es bevorzugt und empfohlen, die Lösung selbst zu programmieren (mit einigen Richtlinien in diesem Blog).",
  "If you want to check out the code presented in this blog, feel free to visit the.9F7F074B6E1A29450183": "Wenn Sie den in diesem Blog vorgestellten Code ausprobieren möchten, besuchen Sie gerne die [StackBlitz](https://stackblitz.com/github/trueberryless/starlight-autogenerate-whole-sidebar?file=src%2Fcontent.config.ts) oder den Quellcode im [GitHub-Repo](https://github.com/trueberryless/starlight-autogenerate-whole-sidebar).",
  "You might think that this story is now over because everyone could just use the .C9618FDEC9BA9ED17D35": "Sie könnten denken, dass diese Geschichte nun vorbei ist, da jeder einfach die Variante nutzen könnte, die er bevorzugt, und alle wären glücklich. Aber Starlight entwickelte sich weiter und verbessert sich ständig. Etwa drei Monate später, am 15. Februar, fast wie ein [Geburtstagsgeschenk](/blog/20th-birthday/) für mich, kam die lang erwartete Ergänzung von Routendaten in Starlight mit der Veröffentlichung von [v0.32](https://github.com/withastro/starlight/releases/tag/@astrojs/starlight@0.32.0). Diese scheinbar kleine Ergänzung eröffnete so viele Möglichkeiten, die ich selbst nie erwartet hätte. HiDeoo war einmal mehr die führende Inspiration für Plugin-Autoren und trieb diese neue Funktionalität bis an ihre Grenzen. Es dauerte nur zwei Tage, um [mehr als 11 Plugins an die neueste Starlight-Version von damals anzupassen](https://bsky.app/profile/hideoo.dev/post/3liffpudc5c2b), und später wurden viele dieser Codeabschnitte verbessert und refaktoriert, um diese mächtige Funktion noch weiter zu nutzen.",
  "Deactivate TLS within Argo CD": "TLS in Argo CD deaktivieren",
  "🌟 Heartfelt Thanks & Credits": "🌟 Herzlicher Dank & Credits",
  "Overview of all the awesome people who make this blog possible.": "Übersicht über all die großartigen Menschen, die diesen Blog möglich machen.",
  "Creating this blog has been an incredible journey — one that simply wouldn’t hav.70FABEAD4FC343E8C6EF": "Diesen Blog zu erstellen, war eine unglaubliche Reise — eine, die ohne die Kreativität, Hingabe und offenen Herzen so vieler erstaunlicher Menschen und Projekte in der Open-Source-Community einfach nicht möglich gewesen wäre. \nDiese Seite ist all jenen gewidmet, die geholfen haben, diesen kleinen Teil des Internets Wirklichkeit werden zu lassen, sei es durch Code, Design, Feedback oder Inspiration. 💖",
  "✨ Special Gratitude to Starlight Blog": "✨ Besonderer Dank an Starlight Blog",
  "A very special thank you goes to **[HiDeoo](https://hideoo.dev)**, the brilliant.1D4396875DB2E61EA209": "Ein ganz besonderer Dank geht an **[HiDeoo](https://hideoo.dev)**, den brillanten Kopf hinter **[Starlight Blog](https://starlight-blog-docs.vercel.app/)** — ein Plugin, das den Prozess des Blogerstellens in eine der reibungslosesten und erfreulichsten Erfahrungen verwandelt, die man sich vorstellen kann.\nDeine Arbeit verkörpert den Geist der Zugänglichkeit und Freude, der Open Source ausmacht.",
  "🌠 Shoutout to Starlight & Its Contributors": "🌠 Ein großes Lob an Starlight & seine Mitwirkenden",
  "Endless gratitude to the entire **[Starlight](https://starlight.astro.build/)** .63F5110A18AF3025FB22": "Unendlicher Dank gilt dem gesamten **[Starlight](https://starlight.astro.build/)**-Team und allen seinen [Mitwirkenden](https://github.com/withastro/starlight/graphs/contributors) für die Entwicklung eines so durchdachten, erweiterbaren und inspirierenden Dokumentations-Frameworks.\nStarlight macht es nicht nur möglich, sondern *Spaß*, etwas Schönes, Strukturiertes und Persönliches zu erstellen.",
  "🤝 Collaborations & Shared Voices": "🤝 Zusammenarbeit & gemeinsame Stimmen",
  "One of the most beautiful parts of this blog’s journey has been the chance to **.B111BCCC302F9A1C402B": "Einer der schönsten Aspekte der Reise dieses Blogs war die Möglichkeit, **gemeinsam mit anderen zu erschaffen, zu denken und zu schreiben**. \nEinige Beiträge hier entstanden aus tiefen Gesprächen, geteilter Neugierde und kollektiver Anstrengung — jede Zusammenarbeit bringt neue Perspektive, Tiefe und Herz hinzu.",
  "A huge thank you to everyone who co-wrote, inspired, edited, or shared their wor.16E415B911B3C11AC861": "Ein riesiges Dankeschön an alle, die mitgeschrieben, inspiriert, redigiert oder ihre Worte auf dieser Plattform geteilt haben. \nEure Stimmen machen diesen Raum reicher, wärmer und unendlich menschlicher. 💬💞",
  "Collaborators & Co-Authors": "Mitarbeiter & Co-Autoren",
  "Clemens Schlipfinger": "Clemens Schlipfinger",
  "FrostyBee": "FrostyBee",
  "HiDeoo": "HiDeoo",
  "Lan": "Lan",
  "Louis Escher": "Louis Escher",
  "*If you’ve written, inspired, or shaped even a small part of this blog — you’re .DCB6D4DC71EC5285E9ED": "*Wenn du auch nur einen kleinen Teil dieses Blogs geschrieben, inspiriert oder geformt hast — dann gehörst du ebenfalls zu dieser Liste.* ✨",
  "🧡 A Typeface That Speaks Clearly": "🧡 Eine Schriftart, die klar kommuniziert",
  "This blog uses **[Atkinson Hyperlegible Next](https://brailleinstitute.org/freef.019D403D9BECEF4D11AB": "Dieser Blog verwendet **[Atkinson Hyperlegible Next](https://brailleinstitute.org/freefont)** — eine Schriftart, die von der **Braille Institute** entwickelt wurde, um die Lesbarkeit und Inklusivität für Leser aller Art zu maximieren. \nIhr durchdachtes Design kombiniert Zugänglichkeit und Schönheit und passt perfekt zum offenen, einladenden Geist dieser Seite.",
  "🔌 Honorable Mentions — Plugins & Integrations": "🔌 Ehrenvolle Erwähnungen — Plugins & Integrationen",
  "This site wouldn’t shine the same way without these fantastic tools and integrat.0E1812C092C4D017788E": "Diese Seite würde ohne diese fantastischen Tools und Integrationen, die sie im Hintergrund antreiben, nicht auf die gleiche Weise glänzen:",
  "[`@lunariajs/starlight`](https://github.com/lunariajs/starlight) – Localization .E222BC2BC86A9067C4E9": "[`@lunariajs/starlight`](https://github.com/lunariajs/starlight) – Lokalisierungssynchronisierung, die einfach *funktioniert*",
  "[`starlight-giscus`](https://github.com/dragomano/starlight-giscus) – Smooth Gis.11E15740EAAA4B88AFB4": "[`starlight-giscus`](https://github.com/dragomano/starlight-giscus) – Reibungslose Giscus-Kommentarintegration",
  "[`starlight-image-zoom`](https://github.com/HiDeoo/starlight-image-zoom) – For t.DCF2052A217D883CE320": "[`starlight-image-zoom`](https://github.com/HiDeoo/starlight-image-zoom) – Für ein scharfes, heranzoombares Bilderlebnis",
  "[`starlight-links-validator`](https://github.com/HiDeoo/starlight-links-validato.8EBDD728AB6FDC011E00": "[`starlight-links-validator`](https://github.com/HiDeoo/starlight-links-validator) – Hält alle Links ordentlich und gültig",
  "[`starlight-theme-rapide`](https://github.com/HiDeoo/starlight-theme-rapide) – A.BFAB1D5AB3269AF92008": "[`starlight-theme-rapide`](https://github.com/HiDeoo/starlight-theme-rapide) – Ein schnelles und stilvolles Thema, das das Feeling verbessert",
  "🖼️ Image Credits": "🖼️ Bildnachweise",
  "A huge thank you to all the talented photographers and artists whose visuals bri.7CD3AA75357A932BEAB8": "Ein riesiges Dankeschön an alle talentierten Fotografen und Künstler, deren visuelle Beiträge Wärme und Tiefe in diesen Blog bringen. \nDie meisten Bilder stammen von **[Unsplash](https://unsplash.com)** und anderen frei zugänglichen kreativen Plattformen — jede hier mit vollem Respekt und Dankbarkeit gelistet. 🌍💫",
  "❤️ To Everyone Involved": "❤️ An alle Beteiligten",
  "To the developers, designers, artists, testers, friends, and readers who contrib.50353370F3E9F25D778B": "An die Entwickler, Designer, Künstler, Tester, Freunde und Leser, die auf die eine oder andere Weise beigetragen haben — danke.\nEure Arbeit, euer Feedback und eure Anwesenheit machen diesen Blog zu dem, was er heute ist.",
  "This site stands as a small tribute to the open-source spirit: collaboration, cu.BCFEF6580F96E153D4D3": "Diese Seite steht als kleine Hommage an den Open-Source-Geist: Zusammenarbeit, Neugierde und Kreativität, die frei geteilt werden, aus Liebe dazu, gemeinsam etwas zu erschaffen.",
  "The man who nominated me as an Astro Support Squad - [Jacob](https://github.com/.D05EFAF4512FF0685F54": "Der Mann, der mich als Astro Support Squad nominierte - [Jacob](https://github.com/jdtjenkins) (übrigens vielen Dank, dass du mich in dieser großartigen Community bemerkt hast 😍) - nahm das ziemlich wörtlich und schrieb einen Blog darüber. Kein Scherz. Schau es dir an: [https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/](https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/) Das ist übrigens sein allererster Blog (und hoffentlich nicht sein letzter, da ich wirklich seinen Stil genossen habe).",
  "On the other hand, the goal seems so close and doable. Just write some words. Wh.BAC5DE3BBEC24BDC41D4": "Andererseits scheint das Ziel so nah und machbar. Einfach ein paar Worte schreiben. Was ist so schwer daran, diese verdammten Worte zu schreiben? Ehrlich gesagt, ich weiß es selbst nicht. Warum fragst du mich? Das Einzige, was mir geholfen hat, aus der Spirale \"Du-willst-schreiben-aber-jedes-mal-wenn-du-auf-den-blinkenden-Cursor-starrst-wird-dein-Gehirn-taub\" (lass das den Hashtag der Woche sein) herauszukommen, war Lous Tipp, nicht so viel von sich selbst in seinem ersten Blog zu wollen. Warum willst du einen perfekten Blog zum Einstieg? Nur wegen deines Rufs? Damit die Leute nicht schlecht über dich denken? Sich enttäuscht fühlen? Ganz ehrlich: Das ist Bullshit! Nicht nur, weil dein erster Blog höchstwahrscheinlich von niemandem gelesen wird (mit Ausnahme von Jacobs außergewöhnlichem Blog), sondern auch, weil du es dir nur schwerer machst. Meine persönliche Denkgrenze war, dass ich dachte, ich müsse mindestens 500 Worte schreiben, um anzufangen. Aber wer sagt das? Ehrlich gesagt, wenn ich zurückblicken könnte, denke ich manchmal: \"Mann, es wäre so einzigartig und cool gewesen, wenn mein allererster Blog einfach wie ein regulärer Tweet gewesen wäre\", oder sogar extremer: Ein. Wort. Niemand wird dich daran hindern, diesen Blog zu veröffentlichen:",
  "(Sorry if I now took your awesome idea,\nand included your whole blog post in her.91810AD3BF74AA504E78": "(Entschuldigung, falls ich dir jetzt deine großartige Idee weggenommen habe,\nund deinen ganzen Blog-Post hier integriert habe\n\\- wow cool, das reimt sich)",
  "See? I can do whatever I want, even being a fricking poet (typical German behavi.E5151017C0E0F72F7985": "Siehst du? Ich kann tun, was ich will, sogar ein verdammter Poet sein (typisch deutsch), und niemand wird mich verurteilen. Okay, vielleicht wird jemand diesen Blog hassen, weil er \"Zeitverschwendung ist, keinen Sinn in all diesen nutzlosen Inhalten\", aber wen ***j u c h t s*** das? Es ist *dein* Blog, <span id=\"comment-reference\" class=\"fragment-highlight\">niemand hat nach ihrer Meinung gefragt, (es sei denn, du hast eine Kommentarsektion unter deinem Blog 🙄 *hust* [Lou](https://lou.gg/blog/why-writing-blogs-isnt-hard#chapter-five-its-the-8th-of-july))</span>. Also denk nicht darüber nach, was andere über deinen Schreibstil, Inhalt, Sprachgebrauch oder sogar darüber denken könnten, ob du Grammatikfehler machst. All das macht dich menschlich, und alles perfekt hinzubekommen ist nicht nur völlig unnötig, sondern auch [hrad](https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/#:~\\:text=hrad).",
  "But as Lou mentions, there are other easy methods to keep a common thread in the.A451CFE839CB1FBC21C6": "Aber wie Lou erwähnt, gibt es andere einfache Methoden, um den roten Faden im gesamten Beitrag beizubehalten, an der Geschichte festzuhalten, während die Gedanken in deinem eigenen Gehirn umherwandern. All diese Gedanken auf Papier zu bringen, oder in diesem Fall auf die Tastatur, kann herausfordernd sein, besonders wenn man anfängt zu schreiben. Aber es gibt einen Grund, warum wir solche Fähigkeiten in der Schule lernen, sie verbessern unsere kognitive Gesundheit und Entwicklung immens. Genau deshalb stimme ich Lou voll und ganz zu, wenn er sagt, dass KI niemals in den Schreibprozess eingebunden werden sollte. Sie hat einfach keine Vorteile, weder für den Leser und noch weniger für dich.",
  "Blogs have easy and hard sides: This is what the title says, but know that when .5FD6AC2B5F67FEEB980D": "Blogs haben leichte und schwierige Seiten: Das sagt der Titel, aber wisse, dass ich beim Schreiben all dessen festgestellt habe, dass ich diese Frage überhaupt nicht beantwortet habe... Gott sei Dank hat Jacob am Ende dieses Vorschlags kein Fragezeichen eingetippt. 🙏",
  "How VS Code Snippets can improve your workflow when working with Astro": "Wie VS Code Snippets Ihren Workflow bei der Arbeit mit Astro verbessern können",
  "Learn how to create and use VS Code snippets to quickly insert frontmatter for A.D26B9BDAE7EE82E7ADDF": "Erfahren Sie, wie Sie VS Code-Snippets erstellen und verwenden, um Frontmatter für Astro-Inhaltskollektionen schnell einzufügen. Diese Anleitung zeigt, wie Snippets repetitive Aufgaben automatisieren, das Bearbeiten von Markdown und MDX beschleunigen und Ihren Astro-Workflow verbessern können.",
  "This article demonstrates how code snippets can be created in Visual Studio Code.543DA033C0D24D54E197": "Dieser Artikel zeigt, wie Code-Snippets in Visual Studio Code erstellt werden können, die Ihre Produktivität beim regelmäßigen Arbeiten mit [Astros Inhaltskollektionen](https://docs.astro.build/en/guides/content-collections) erheblich steigern können.",
  "This article arose from a suggestion by [Sarah Rainsberger](https://github.com/s.4655B5312FAC27729C5A": "Dieser Artikel entstand aus einer Anregung von [Sarah Rainsberger](https://github.com/sarah11918) und hebt ein Feature hervor, das von [HiDeoo](https://github.com/HiDeoo) beigetragen wurde - alle Codebeispiele stammen ebenfalls von HiDeoo.",
  "The need for snippets": "Die Notwendigkeit von Snippets",
  "Astro supports [schema validation](https://docs.astro.build/en/guides/content-co.DFB695FC461122BCEAEB": "Astro unterstützt [Schema-Validierung](https://docs.astro.build/en/guides/content-collections/#defining-the-collection-schema) für Ihre Frontmatter-Felder in Markdown- und MDX-Dateien. Daher werden viele Inhaltsdateien Ihrer Kollektionen die gleiche Struktur zwischen den Codeblöcken (`---`) haben. Wenn Sie es leid sind, die gleichen Frontmatter-Felder immer wieder einzutippen, können Sie ein Code-Snippet erstellen, das automatisch die Grundstruktur des gewünschten Frontmatter generiert, während Sie die Felder bequem mit `TAB ⇥` Eingaben bearbeiten können.",
  "Creating a snippet": "Snippet erstellen",
  "You can create global snippets which can be scoped to multiple languages or lang.F6F19F1B08BB3C49B652": "Sie können globale Snippets erstellen, die auf mehrere Sprachen oder sprachspezifische Snippets beschränkt sind. Da wir das Frontmatter-Snippet sowohl in Markdown- als auch MDX-Dateien verwenden möchten, erstellen wir ein globales Snippet unter `Code/User/snippets/markdown.code-snippets` mit dem Scope `markdown,mdx`. Befolgen Sie die Anweisungen in der [offiziellen Dokumentation](https://code.visualstudio.com/docs/editor/userdefinedsnippets#_create-your-own-snippets) für die richtigen Schritte für Ihr Betriebssystem.",
  "Here is an example of how your snippet could look like. You can freely adjust th.74B925192DDACBEA1FB5": "Hier ist ein Beispiel dafür, wie Ihr Snippet aussehen könnte. Sie können das `body` oder `prefix` nach Belieben anpassen:",
  "The flexibility of snippets allows you to create powerful and bespoke productivi.431D5797554EC1FEC2C9": "Die Flexibilität von Snippets ermöglicht es Ihnen, leistungsstarke und maßgeschneiderte Produktivitätsverstärker zu erstellen. Sie können die obige Grundkonfiguration mit den spezifischen Frontmatter-Feldern, die Sie benötigen, erweitern, ändern, wie der Titel generiert wird, und mehr.",
  "Using the snippet": "Snippet verwenden",
  "Create an empty Markdown (`.md`) or `.mdx` file. Start typing `ffmt` and press `.25808138FA4550C0870F": "Erstellen Sie eine leere Markdown (`.md`) oder `.mdx` Datei. Beginnen Sie mit der Eingabe von `ffmt` und drücken Sie `TAB ⇥`, um das Snippet auszulösen. Wenn Sie keine Vorschläge sehen, können Sie diese manuell mit `Strg + Leertaste` auslösen und das Snippet `\"Add Markdown frontmatter\"` auswählen. Abhängig von Ihrer genauen Konfiguration können Sie jetzt durch die Felder tabben, um sie an Ihren aktuellen Anwendungsfall anzupassen. Das Beispiel-Snippet oben ermöglicht es Ihnen, die Überschrift direkt zu bearbeiten und springt anschließend zum Inhalt. Das Titelfeld des Frontmatter wird auf den Dateinamen ohne seine Erweiterung gesetzt.",
  "![Screenshot of the Visual Studio Code editor, displaying generated content from.03A1E1487CD3563BD93C": "Screenshot des Visual Studio Code-Editors, der generierten Inhalt aus einem Code-Snippet anzeigt.",
  "Further resources": "Weitere Ressourcen",
  "If you find snippets useful and want to explore a VS Code extension which includ.892F5FBE54A357988F54": "Wenn Sie Snippets nützlich finden und eine VS Code-Erweiterung erkunden möchten, die eine gute Sammlung vorgefertigter Snippets enthält, werfen Sie einen Blick auf [Astro Snippets von Shelton Louis](https://marketplace.visualstudio.com/items?itemName=SheltonLouis.astro-snippets).",
  "Read more tips and tricks for working with Astro and Starlight on [HiDeoo's blog.FAF7D36DB7C990E06DF5": "Lesen Sie weitere Tipps und Tricks für die Arbeit mit Astro und Starlight auf [HiDeoos Blog](https://hideoo.dev/notes).",
  "The tale of trueberryless": "Die Geschichte von trueberryless",
  "From code to creativity - discover the story behind the username.": "Von Code zu Kreativität – entdecke die Geschichte hinter dem Benutzernamen.",
  "This is the story of how I came up with the wonderful but meaningless username \".F1CEE346B7E4483F3BA7": "Dies ist die Geschichte, wie ich auf den wunderbaren, aber bedeutungslosen Benutzernamen \"trueberryless\" gekommen bin.",
  "It all started back in 2022 during my internship. I was a productivity machine, .97489294BEAFAF7D4B78": "Alles begann im Jahr 2022 während meines Praktikums. Ich war eine Produktivitätsmaschine, erledigte jede Aufgabe viel schneller, als man es erwartet hätte. Das ließ mir eine Fülle an Freizeit, was sowohl ein Segen als auch ein Fluch ist. Zunächst versuchte ich, die Zeit zu vertreiben, indem ich beschäftigt wirkte - zielloses Herumklicken, Dateien neu anordnen, die üblichen Tricks - aber irgendwann traf mich die Langeweile wie ein Lastwagen.",
  "That's when I noticed something that ignited a spark of jealousy: a friend of mi.A0ED4E992CD3AD9196CF": "Da bemerkte ich etwas, das einen Funken Eifersucht in mir entfachte: Ein Freund von mir hatte den *coolsten* Benutzernamen auf Discord. Kurz, komplett in Kleinbuchstaben und mühelos einprägsam. Eine Art Name, bei dem man denkt: \"Wow, diese Person hat ihr Leben im Griff.\"",
  "And then it hit me: *I want that*. Not their exact username, obviously, but my o.90016D6AE61658C30015": "Und dann traf es mich: *Ich will das.* Nicht exakt den gleichen Benutzernamen, natürlich, sondern mein eigenes kurzes, einfaches, in Kleinbuchstaben geschriebenes Meisterwerk. Ein Name, der so einzigartig ist, dass er auf jeder Social-Media-Plattform, E-Mail und Domain funktionieren würde. Etwas so Originelles, dass niemand sonst auf der Welt jemals zuvor daran gedacht hätte.",
  "That's when **The Big Change** began.": "Das war der Beginn von **Der Großen Veränderung**.",
  "Day 1: I sat down, full of ambition, and started brainstorming. My criteria were.4456C8415F3D01EF0DD5": "Tag 1: Ich setzte mich hin, voller Ehrgeiz, und begann, Ideen zu sammeln. Meine Kriterien waren klar: klein geschrieben, kurz, einfach und absolut unbenutzt. Wie schwer konnte das schon sein, oder? Es stellte sich heraus: schwerer, als es klingt. Jede gute Idee war bereits vergeben. Ich googelte und überprüfte Benutzernamen bis mein Gehirn wie Brei war.",
  "Day 2: My coworkers started noticing something was up. \"You've been staring at y.AFF248E138CC7F1009B5": "Tag 2: Meine Kollegen bemerkten, dass etwas nicht stimmte. \"Du starrst schon eine ganze Weile auf deinen Bildschirm\", sagte einer von ihnen. Sie ahnten nicht, dass ich nicht an Aufgaben arbeitete – ich war tief in den Schützengräben der Benutzernamen. Ich probierte alles: „berrythis“, „lessberry“, „truefruit“, „falsenut“. Nichts fühlte sich richtig an. Nichts war *ich*.",
  "Day 3: By this point, I was questioning everything. Why was this so hard? Why di.C3F864B858E419A32D04": "Tag 3: An diesem Punkt hinterfragte ich alles. Warum war das so schwer? Warum war es mir so wichtig? Und dann, aus dem Nichts, kam es mir: **trueberryless**.",
  "At first, I wasn't sure. Did it make sense? Not really. Was it ridiculous? Absol.5D1B007B33C688906E37": "Zunächst war ich mir unsicher. Ergab das Sinn? Nicht wirklich. War es lächerlich? Absolut. Aber es war klein geschrieben. Es war einzigartig. Und das Wichtigste: Niemand sonst hatte es. Es hatte diesen seltsamen, skurrilen Charme, der einfach *passte*.",
  "So there it was: my magnum opus of usernames. \"trueberryless.\" The name that wou.2D516B09E0A323E37E92": "Da war er also: mein Meisterwerk der Benutzernamen. \"trueberryless.\" Der Name, der mich im Internet definieren würde.",
  "Now, you might be thinking, *Three days for that? Really?*": "Jetzt denkst du vielleicht: *Drei Tage dafür? Ernsthaft?*",
  "And to that, I say: *Yes*. Greatness takes time. Besides, who needs true berries.9F2E7082566D2FDB0B33": "Und dazu sage ich: *Ja*. Großes braucht Zeit. Außerdem, wer braucht schon echte Beeren, wenn man beerenlos sein kann?",
  "How components open up endless possibilities": "Wie Komponenten endlose Möglichkeiten eröffnen",
  "Customize the \"Overview\" title of your Starlight Table of Contents": "Passe den Titel \"Übersicht\" deines Starlight-Inhaltsverzeichnisses an",
  "Learn how you can customize the first heading in the right sidebar of every Star.F1D476DF8D76B32F635C": "Erfahren Sie, wie Sie die erste Überschrift in der rechten Seitenleiste jeder Starlight-Seite global und individuell anpassen können.",
  "This guide shows how you can customize the first heading in the right sidebar (t.EBBD087BA7933FD006CD": "Diese Anleitung zeigt, wie Sie die erste Überschrift in der rechten Seitenleiste (Inhaltsverzeichnis) jeder [Starlight](https://starlight.astro.build)-Seite global und individuell anpassen können.",
  "Each Starlight page contains a table of contents on the right side (except if [d.61CA76371BAB331050A4": "Jede Starlight-Seite enthält ein Inhaltsverzeichnis auf der rechten Seite (außer es wurde [deaktiviert](https://starlight.astro.build/reference/frontmatter/#tableofcontents)). Um oben auf die Seite verlinken zu können, hat der erste Eintrag in dieser Seitenleiste den Titel \"Übersicht\" (wie Sie auch in der Seitenleiste auf dieser Seite sehen können), der sowohl [global](#global-definition) als auch [seitenweise](#frontmatter-override) angepasst werden kann.",
  "Global definition": "Globale Definition",
  "If you want to set the title of the first table of contents entry once for all p.C65EC4D12D25D974113C": "Wenn Sie den Titel des ersten Eintrags im Inhaltsverzeichnis für alle Seiten einmal festlegen möchten, können Sie die folgenden Schritte ausführen, um dies für einsprachige und mehrsprachige Seiten zu erreichen:",
  "Create [route middleware](https://starlight.astro.build/guides/route-data/#how-t.F17FE41F2D87D1A631B8": "Erstellen Sie [Route-Middleware](https://starlight.astro.build/guides/route-data/#how-to-customize-route-data), um die von Starlight angezeigten Daten anzupassen.",
  "Use this example code to configure the \"Overview\" title:": "Verwenden Sie diesen Beispielcode, um den Titel \"Übersicht\" zu konfigurieren:",
  "If your site is [multilingual](https://starlight.astro.build/guides/i18n/), you .0E1127A6299FEFE8837B": "Wenn Ihre Website [mehrsprachig](https://starlight.astro.build/guides/i18n/) ist, können Sie je nach Sprache verschiedene Titel zuweisen:",
  "Frontmatter override": "Frontmatter-Überschreibung",
  "In order to set the first table of contents heading to something different on in.13CEB33BAEE59210D917": "Um die erste Überschrift des Inhaltsverzeichnisses auf einzelnen Seiten festzulegen, führen Sie die folgenden Schritte aus:",
  "[Extend your frontmatter schema](https://starlight.astro.build/reference/frontma.5522971BF14B9452A02B": "[Erweitern Sie das Frontmatter-Schema](https://starlight.astro.build/reference/frontmatter/#customize-frontmatter-schema) in `src/content.config.ts`:",
  "This allows you to use the `overviewTitle` in your middleware like that:": "Dadurch können Sie das `overviewTitle` in Ihrer Middleware wie folgt verwenden:",
  "For the sake of completeness, here is a multilingual middleware that supports ov.7F68429B8F3025D4F93C": "Der Vollständigkeit halber hier eine mehrsprachige Middleware, die eine Überschreibung auf einzelnen Seiten unterstützt:",
  "Source code": "Quellcode",
  "You can also find the complete source code for all four variants on [GitHub](htt.4030005B1CB303161AD1": "Den vollständigen Quellcode für alle vier Varianten finden Sie auch auf [GitHub](https://github.com/trueberryless/starlight-customize-toc-overview-title) oder öffnen Sie das Projekt direkt in [StackBlitz](https://stackblitz.com/github/trueberryless/starlight-customize-toc-overview-title).",
  "Add Additional Content to Starlight's Table of Contents": "Zusätzliche Inhalte zur Inhaltsübersicht von Starlight hinzufügen",
  "Learn how to append additional content like credits, ads or additional informati.2AD210302E626EAB78F1": "Erfahren Sie, wie Sie zusätzliche Inhalte wie Credits, Anzeigen oder weitere Informationen unterhalb der Liste der Überschriften in Ihrer rechten Starlight-Seitenleiste hinzufügen können.",
  "This guide shows how you can append additional content like credits, ads or addi.C83ECE07F13E5CF1B3B7": "Diese Anleitung zeigt Ihnen, wie Sie zusätzliche Inhalte wie Credits, Anzeigen oder weitere Informationen unterhalb der Liste der Überschriften in Ihrer rechten [Starlight](https://starlight.astro.build)-Seitenleiste hinzufügen können.",
  "Append content": "Inhalt anhängen",
  "Starlight's table of contents can be modified by [overriding](https://starlight..0EDBAD2D64998CFEA8F8": "Die Inhaltsübersicht von Starlight kann durch [Überschreiben](https://starlight.astro.build/guides/overriding-components/) der [`TableOfContents.astro`-Komponente](https://starlight.astro.build/reference/overrides/#tableofcontents) angepasst werden. Folgen Sie diesen Schritten, um eine kleine Astro-Komponente nach der bestehenden Inhaltsübersicht anzuhängen:",
  "Create a small `Card.astro` component that will be displayed after the table of .EF90EF1232FDD7AB075F": "Erstellen Sie eine kleine `Card.astro`-Komponente, die nach der Inhaltsübersicht angezeigt wird. Um gängige Konventionen zu befolgen, wird empfohlen, einen neuen `src/components/`-Ordner zu erstellen, in dem Sie alle Ihre Komponenten platzieren können:",
  "Note the usage of the `\"not-content\"` class feature [provided by Starlight](http.8DA4FC200DB808840F70": "Beachten Sie die Verwendung der `\"not-content\"` Klassenfunktion [bereitgestellt von Starlight](https://starlight.astro.build/components/using-components/#compatibility-with-starlights-styles), um sicherzustellen, dass Starlight's Styles für Elemente hier nicht angewendet werden, da es sich um eine benutzerdefinierte Komponente handelt.",
  "Create the `TableOfContents.astro` component, which will be used as the replacem.E2324AFCFA06D8A780E2": "Erstellen Sie die `TableOfContents.astro`-Komponente, die als Ersatz für die standardmäßige Inhaltsübersichtskomponente von Starlight verwendet wird:",
  "As you can see, the default table of contents are displayed by importing the com.E42B552B04E80426C865": "Wie Sie sehen können, wird die standardmäßige Inhaltsübersicht durch Importieren der Komponente aus Starlight und Verwendung vor unserer Karte angezeigt. Siehe den Abschnitt [\"Inhalt voranstellen\"](#prepend-content), um die Karte oberhalb der Inhaltsübersicht anzuzeigen.",
  "Last but not least, do not forget to set the component override in your Astro co.1179A58EF95F811E052B": "Zu guter Letzt vergessen Sie nicht, das Komponenten-Überschreiben in Ihrer Astro-Konfiguration zu setzen:",
  "Prepend content": "Inhalt voranstellen",
  "If you would prefer the table of contents *after* your component, you need to sw.A4B89DD367CD0C463992": "Wenn Sie die Inhaltsübersicht *nach* Ihrer Komponente anzeigen möchten, müssen Sie die Reihenfolge der Elemente aus [Schritt 2 oben](#step-2) vertauschen und stattdessen `margin-bottom` zuweisen:",
  "The rest of the 3 steps are the same, so do not forget to complete them all!": "Die restlichen 3 Schritte sind gleich, also vergessen Sie nicht, sie alle abzuschließen!",
  "Place content at bottom": "Inhalt unten platzieren",
  "If you want to have more spacing between your new shiny content and the table of.B1248A554E3FAC63D0BC": "Wenn Sie mehr Platz zwischen Ihrem neuen glänzenden Inhalt und der Inhaltsübersicht schaffen möchten, können Sie einige CSS-Tricks verwenden, um dies zu erreichen. Fügen Sie diese globalen Styles unten in Ihrer `TableOfContents.astro`-Komponente hinzu, um zwei neue Flexboxen einzuführen, die Ihre Karte nach unten transformieren:",
  "Mobile support": "Mobile Unterstützung",
  "The `TableOfContents.astro` is only rendered when the right sidebar is visible. .812854791334DFC7D867": "Die `TableOfContents.astro`-Komponente wird nur gerendert, wenn die rechte Seitenleiste sichtbar ist. Das ist bei mobilen Geräten nicht der Fall, wo die [`MobileTableOfContents.astro`-Komponente](https://starlight.astro.build/reference/overrides/#mobiletableofcontents) gerendert wird.",
  "However, if you want to show your additional content on mobile devices, it is re.9361E9ED00C5FE2F87EA": "Wenn Sie jedoch Ihre zusätzlichen Inhalte auf mobilen Geräten anzeigen möchten, wird empfohlen, die [`Pagination.astro`-Komponente](https://starlight.astro.build/reference/overrides/#pagination) zu überschreiben, da das Hinzufügen von Inhalten zur mobilen Ansicht der rechten Seitenleiste fehl am Platz wirken würde.",
  "Here is a quick demonstration of how your custom `Pagination.astro` override cou.F191EB9AF07E5A144861": "Hier ist eine kurze Demonstration, wie Ihre benutzerdefinierte `Pagination.astro`-Überschreibung aussehen könnte:",
  "Note that the card will have much more width when displayed under the pagination.210A899F496D2AD30FDB": "Beachten Sie, dass die Karte unterhalb der Paginierung viel breiter angezeigt wird als in der Inhaltsübersicht. Stellen Sie daher sicher, dass Sie ein responsives Design innerhalb Ihrer zusätzlichen Inhalte verwenden.",
  "You can also find the complete source code for all three variants on [GitHub](ht.A368E5F82DAB49485523": "Sie finden den vollständigen Quellcode für alle drei Varianten auch auf [GitHub](https://github.com/trueberryless/starlight-customize-toc-additional-content) oder öffnen das Projekt direkt in [StackBlitz](https://stackblitz.com/github/trueberryless/starlight-customize-toc-additional-content).",
  "Have you ever wanted to simplify sidebar generation in your [Starlight](https://.67AFC17AB730A696DBA2": "Haben Sie jemals darüber nachgedacht, die Erstellung von Sidebars in Ihrem [Starlight](https://starlight.astro.build)-Projekt zu vereinfachen? Haben Sie versucht, die gesamte Sidebar automatisch zu generieren, nur um festzustellen, dass Sie die Struktur nicht nach Ihren Bedürfnissen anpassen können?",
  "With a little bit of additional styling it looks really cute in my opinion. Plea.E670C480050B22162AAF": "Mit ein wenig zusätzlichem Styling sieht es meiner Meinung nach wirklich süß aus. Bitte beachten Sie, dass dies eine [Starlight](https://starlight.astro.build)-Seite ist, bei der ich verfügbare CSS-Variablen verwende, wie in Zeile vier:",
  "That’s when I stumbled upon [Starlight](https://starlight.astro.build), a powerf.5430CBD4319A948820D8": "Daraufhin stieß ich auf [Starlight](https://starlight.astro.build), ein leistungsstarkes und erstaunliches Framework, geschaffen von [Chris Swithinbank (@delucis)](https://github.com/delucis), um schnelle, Markdown-basierte Websites zu erstellen. Die Entdeckung von Starlight war ein Wendepunkt – es ermöglichte mir, zwei Dinge zu verbinden, für die ich leidenschaftlich bin: Websites zu erstellen und Markdown wegen seiner Einfachheit und Eleganz zu nutzen.",
  "You can take a look at Mutanuq under this domain: [https://mutanuq.trueberryless.5E01C2321C0977BC7AAC": "Du kannst dir Mutanuq unter dieser Domain anschauen: [https://mutanuq.trueberryless.org](https://mutanuq.trueberryless.org)"
}