{
  "Deep Thoughts - Overview": "Pensées Profondes - Aperçu",
  "Welcome to my blog. Take a look at this minimalistic overview of all my blog pos.5A38D8470D9F24600ED2": "Bienvenue sur mon blog. Découvrez cet aperçu minimaliste de tous mes articles de blog.",
  "Some aspects of creating a blog are really easy, and some are extremely difficul.997EB56977F5D63B1118": "Certains aspects de la création d'un blog sont vraiment faciles, et d'autres extrêmement difficiles !",
  "A beginner friendly introduction with some swear words on how to start writing y.BE312646252BC9A86726": "Une introduction conviviale pour les débutants avec quelques jurons sur la manière de commencer à écrire votre propre article de blog.",
  "<p>Talk a little bit about how one can become better (not master by any means, n.8C69E4E4A592E67958BE": "<p>Parlons un peu de comment on peut s'améliorer (sans pour autant devenir un maître, personne n'est parfait) dans l'écriture d'un article de blog. Ce ne sont que mes réflexions après que deux gars géniaux de la <a href=\"https://astro.build/chat\">Communauté Astro</a> (<a class=\"gh-badge\" href=\"https://github.com/jdtjenkins\"><img src=\"https://github.com/jdtjenkins.png\" alt=\"jdtjenkins\" />Jacob</a> et <a class=\"gh-badge\" href=\"https://github.com/louisescher\"><img src=\"https://github.com/louisescher.png\" alt=\"louisescher\" />Lou</a>) aient décidé d'écrire des blogs sur la difficulté ou la facilité d'écrire des articles de blog.</p><p>Veuillez lire leurs articles en premier, car celui-ci est une suite aux deux autres :</p><ol><li><a href=\"https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/\">\"Pourquoi est-il si difficile d'écrire des articles de blog ?\" - Jacob Jenkins</a></li><li><a href=\"https://lou.gg/blog/why-writing-blogs-isnt-hard\">\"Pourquoi écrire des blogs n'est pas difficile\" - Louis Escher</a></li><li><a href=\"/blog/writing-blogs-is-hard-and-easy/\">\"Certains aspects de la création d'un blog sont vraiment faciles, et d'autres extrêmement difficiles !\" - Felix Schneider</a></li></ol><p>Après cela, vous aurez complété avec succès cette trilogie géniale sur les articles de blog.</p>",
  "After a very interesting discussion in the [Astro](https://github.com/withastro).48AFE0BF2E41079C33DD": "Après une discussion très intéressante dans le [Discord](https://astro.build/chat) d'[Astro](https://github.com/withastro) - initiée par nul autre que le mainteneur principal [Alex](https://github.com/alexanderniebuhr) lui-même (au fait félicitations pour cette récente réussite 🎉) -, j'ai plaisanté en disant que quelqu'un pourrait écrire un blog sur les raisons pour lesquelles il est si difficile pour beaucoup de gens non seulement d'écrire, mais aussi de gérer un blog dans son ensemble.",
  "The man who nominated me as an Astro Support Squad - [Jacob](https://github.com/.47D0DB043E57D3E7660B": "L'homme qui m'a nommé dans l'équipe de support Astro - [Jacob](https://github.com/jdtjenkins) (au fait, merci beaucoup de m'avoir remarqué dans cette communauté incroyable 😍) - a pris cela au pied de la lettre et a écrit un blog à ce sujet. Pas de blague. Allez voir : [https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/](https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/) D'ailleurs, c'est son tout premier blog (et j'espère que ce ne sera pas le dernier, car j'ai vraiment apprécié son style d'écriture).",
  "Our beloved everywhere-helper, Blogger, Designer and StudioCMSer - [Lou](https:/.00B9B777867DC593B708": "Notre aide multitâche bien-aimée, blogueur, designer et StudioCMSer - [Lou](https://github.com/louisescher/) (merci d'avance pour tes conseils d'écriture de blog qui m'ont permis d'écrire ceci avec plus de confiance 🤩) - a sauté immédiatement sur cette vague d'enthousiasme (comme les utilisateurs de Twitch pourraient l'appeler) et a publié [sa réponse](https://lou.gg/blog/why-writing-blogs-isnt-hard) en seulement 12 heures !!! Croyez-moi, j'ai vérifié les commits, Lou a littéralement publié 4 minutes avant la fin des 12 heures.",
  "As I will include many references to both of their blogs, it's best if you read .2E1FCF6AB78B43DC2069": "Comme je ferai de nombreuses références à leurs blogs, il vaut mieux que vous lisiez les leurs en premier. Puis le mien. Ou peut-être vaut-il mieux lire seulement les leurs, je ne suis pas encore sûr de la tournure que prendra le mien.",
  "But what I can ~~say~~ write, is that mine will fully focus on just the writing .FC4D0CF3F6082890E1EC": "Mais ce que je peux ~~dire~~ écrire, c'est que le mien se concentrera entièrement sur les compétences en écriture.",
  "How to setup a blog (technical challenges)": "Comment configurer un blog (défis techniques)",
  "Whilst this blog doesn't focus on how to build a blog, deploy it and all this te.460F9C9970BD9D6ED53F": "Bien que ce blog ne traite pas de la façon de créer un blog, le déployer et gérer tout cet aspect technique, je tiens à mentionner que tout le monde peut y arriver. Comme Lou l'a mentionné, en tant que personne non technique, vous pouvez toujours simplement créer un compte sur [Medium](https://medium.com/) ou des alternatives similaires. Si vous avez quelques notions de programmation, vous pouvez laisser un peu plus de place à votre créativité et, grâce au projet génial [Starlight Blog](https://starlight-blog-docs.vercel.app/) de [HiDeoo](https://github.com/HiDeoo), il ne vous faut pas beaucoup de connaissances pour déployer votre propre site Web. De nos jours, avec l'existence de fournisseurs PaaS (Platform as a Service) comme [Netlify](https://www.netlify.com/), qui transforment le déploiement en une aventure \"Click-Ops\", il n'y a plus aucune excuse pour ne pas publier votre blog à cause de difficultés techniques.",
  "Okay, jokes aside, now: Writing skills": "D'accord, fin des blagues, passons maintenant aux compétences en écriture",
  "But this blog should focus on mainly on the \"Writing Skill\" as I said, so let's .809BFECD79628A7D6401": "Mais ce blog devrait se concentrer principalement sur la \"compétence d'écriture\", comme je l'ai dit, alors continuons sur ce sujet. Ayant moi-même eu des difficultés initiales à écrire des blogs, je peux totalement confirmer ce que Jacob dit : commencer est difficile. Ce n'est pas comme lire le [Guide de démarrage d'Astro](https://docs.astro.build/en/install-and-setup/) où il suffit de suivre les instructions et ensuite demander sur Discord ce que signifie une erreur `InvalidContentEntryDataError` <sub>veuillez utiliser le fil `#support` si vous le faites 🫶</sub> ([Si vous vous demandez encore](https://docs.astro.build/en/reference/errors/invalid-content-entry-data-error/)).",
  "On the other hand, the goal seems so close and doable. Just write some words. Wh.D4B7EBAB98F3D78C25CA": "D'un autre côté, l'objectif semble si proche et réalisable. Il suffit d'écrire quelques mots. Qu'est-ce qui est si difficile à écrire ces foutus mots ? En réalité, je ne sais pas moi-même. Pourquoi me le demandez-vous ? La seule chose qui m'a aidé à sortir de la spirale de \"Tu-Veux-Écrire-Mais-Chaque-Fois-Tu-Regards-Le-Curseur-Clignotant-Ton-Cerveau-Devient-Vide\" (faisons-en le hashtag de la semaine) était le conseil de Lou : ne pas en exiger trop de vous-même dans votre premier blog. Pourquoi voulez-vous un blog parfait pour débuter ? À cause de votre réputation ? Pour que les gens ne pensent pas mal de vous ? Ressentent de la déception ? Honnêtement : c'est des conneries ! Pas seulement parce que votre premier blog ne sera probablement lu par personne (à l'exception remarquée de l'exceptionnel blog de Jacob), mais aussi parce que vous ne faites que vous compliquer la tâche. Mon plafond mental personnel était que je pensais devoir écrire au moins 500 mots pour commencer. Mais qui dit cela ? Honnêtement, si je regarde en arrière maintenant, je pense parfois : \"Mince, ça aurait été tellement unique et cool si mon tout premier blog avait été comme un simple tweet\", ou encore plus extrême : Un. Mot. Personne ne vous empêchera de publier ce blog :",
  "Hello 👋": "Bonjour 👋",
  "(Sorry if I now took your awesome idea,\\\nand included your whole blog post in he.2C4E38E676160D62D299": "(Désolé si j'ai maintenant pris votre idée géniale,\\\net inclus votre article complet ici\\\n\\- wow cool, ça rime)",
  "See? I can do whatever I want, even being a fricking poet (typical German behavi.CA4561FAF77C16255B02": "Vous voyez ? Je peux faire ce que je veux, même être un foutu poète (comportement typiquement allemand), et personne ne me jugera. D'accord, peut-être que quelqu'un critiquera ce blog en disant que c'est \"une perte de temps, sans signification dans tout ce contenu inutile\", mais qui ***s'en soucie*** ? C'est *votre* blog, <span id=\"comment-reference\" class=\"fragment-highlight\">personne ne demande leur avis (à moins que vous ayez une section de commentaires sous votre blog 🙄 *tousse* [Lou](https://lou.gg/blog/why-writing-blogs-isnt-hard#chapter-five-its-the-8th-of-july)</span>). Alors, ne pensez pas à ce que les autres pourraient penser de votre style d'écriture, de votre contenu, de votre usage de la langue ou même si vous faites des fautes de grammaire. Tout cela vous rend humain et chercher à tout rendre parfait est non seulement complètement inutile, mais aussi [difficil](https://jacobjenkins.codes/posts/why-is-writing-blogs-so-hard/#chapter-1---i-want-it-now).",
  "Another part of writing blogs is not just getting started, but the difficulty of.784B95527E097077F971": "Un autre aspect de l'écriture de blogs n'est pas seulement de commencer, mais aussi de maintenir un flux cohérent, une idée directrice si vous voulez. En tant qu'audience de discours bien écrits, vous remarquez inconsciemment qu'ils étaient bons, satisfaisants, sublimes. Et c'est ce que j'adore dans de tels blogs ou discours. Ils semblent juste parfaits d'une manière ou d'une autre. Mais j'ai moi-même accepté que je ne puisse pas accomplir de telles performances dans mes propres créations. Et je m'en porte beaucoup mieux avec cette acceptation. Parce que le bénéfice d'accepter l'imperfection est d'accomplir les choses. Pas juste à 50 %, pas juste à 90 %. Aller jusqu'au bout. Terminer, à 100 %. Et c'est quelque chose avec lequel beaucoup de gens ont du mal, y compris mon ancien moi - en fait uniquement moi.",
  "But as Lou mentions, there are other easy methods to keep a common thread in the.18BEED3C4E5876FC95F2": "Mais comme le mentionne Lou, il existe d'autres méthodes simples pour garder un fil conducteur dans tout le post, rester fidèle à l'histoire alors que vos pensées peuvent vagabonder dans votre propre esprit. Mettre toutes ces idées sur papier, ou dans ce cas sur le clavier, peut être un défi, surtout lorsque vous commencez à écrire. Mais il y a une raison pour laquelle nous apprenons de telles compétences à l'école, elles améliorent notre santé cognitive et nos capacités de développement de façon immense. C'est aussi pourquoi je suis tout à fait d'accord avec Lou quand il dit que l'intelligence artificielle ne devrait jamais être utilisée dans le processus d'écriture. Cela n'a tout simplement aucun avantage, ni pour le lecteur, encore moins pour vous.",
  "So I don't want to repeat what Lou says, but bullet points have helped me out a .964F132C02AED6CE1634": "Donc, je ne veux pas répéter ce que dit Lou, mais les points-bullets m'ont beaucoup aidé dans le passé. Ils me donnent simplement un sentiment de structure constante, tandis que mon esprit peut jouer avec diverses idées et théories. Cela garantit que vous revenez toujours à ce que vous vouliez inclure initialement dans votre post. \"Et si vous ne pouvez pas trouver de points-bullets ?\", pourriez-vous demander. Eh bien, vous pourriez avoir besoin de plus de séances de brainstorming ou tout simplement de prendre des douches.",
  "In the end, these are some tips I can give you along the way:": "À la fin, voici quelques conseils que je peux vous donner en route :",
  "Develop your own writing style, not by training, but just writing. Sooner or lat.F84CA1A98AD5E28A3F69": "Développez votre propre style d'écriture, non pas en vous entraînant, mais simplement en écrivant. Tôt ou tard, vous remarquerez les types qui pourraient vous plaire, certaines choses que vous voulez adopter d'autres blogueurs, mais summa summarum ce que vous écrivez sera toujours à vous. Vous le partagez simplement avec le monde. C'est à vous de décider si vous souhaitez utiliser un deux-points ou un tiret ici ou là, mettre plus de points, utiliser le passé, l'impératif, des jurons ou un style plus formel. Toutes ces choses viendront automatiquement ensemble et vous définiront comme un blogueur unique. Et vos lecteurs apprécieront cette individualité plus que vous ne le pensez.",
  "Don't take on too much. Might sound easy, but everyone falls regularly into this.F956D1FB960DB4CD026C": "Ne prenez pas trop sur vous. Cela peut sembler facile, mais tout le monde tombe régulièrement dans ce piège. Ou peut-être seulement des gens comme moi, ayant un mélange d'autisme et de perfectionnisme - je ne sais pas.",
  "Although it always sounds stupid: Start writing. And if it doesn't work, start w.0018355B94E38C7B923C": "Bien que cela sonne toujours stupide : Commencez à écrire. Et si cela ne fonctionne pas, commencez à écrire la partie centrale. Parce que je sais que commencer et finir sont toujours difficiles, mais imo la partie centrale coule comme du beurre.",
  "Blogs have easy and hard sides: This is what the title says, but know that I wro.72A914EB55320A9E44E4": "Les blogs ont des côtés faciles et difficiles : C'est ce que dit le titre, mais sachez qu'après avoir écrit tout ça, je me suis rendu compte que je n'ai pas répondu à cette question du tout... Dieu merci, Jacob n'a pas mis un point d'interrogation à la fin de cette suggestion. 🙏",
  "Yeah, I guess that's it. If you want to share you thoughts, leave them in [Lou's.D2EA8444C7BDC5361790": "Oui, je suppose que c'est tout. Si vous voulez partager vos pensées, laissez-les dans [les commentaires de Lou](https://lou.gg/blog/why-writing-blogs-isnt-hard) car je n'en ai pas.",
  "Vibe-coding a VS Code Extension for Terraform projects": "Vibe-coding une extension VS Code pour des projets Terraform",
  "How I created an extension for Visual Studio Code which adds inline resolutions .94295B1957CBEE7AD731": "Comment j'ai créé une extension pour Visual Studio Code qui ajoute des résolutions en ligne aux variables dans les projets Terraform.",
  "Today, I want to talk about a small VS Code extension that I vibe-coded in a sin.6C43E09851571E31F19E": "Aujourd'hui, je veux parler d'une petite extension VS Code que j'ai codée intuitivement en une seule journée pour rendre le travail avec Terraform plus facile. Je vais d'abord expliquer ce qu'est Terraform, puis plonger directement dans les fonctionnalités et les raisons derrière cette extension. N'hésitez pas à passer à la section suivante si vous êtes déjà familier avec Terraform.",
  "What is Terraform?": "Qu'est-ce que Terraform ?",
  "Terraform is an infrastructure-as-code (IaC) tool that lets you define your enti.C1E19D8A95C63B18257A": "Terraform est un outil d'infrastructure en tant que code (IaC) qui vous permet de définir l'intégralité de votre infrastructure cloud ou sur site sous forme de code. Son langage de configuration, inventé par [HashiCorp](https://github.com/hashicorp), s'appelle HCL (HashiCorp Configuration Language) et présente une syntaxe intuitive et lisible par les humains. La *syntaxe native* a l'avantage de présenter une courbe d'apprentissage faible, d'être cohérente pour tous les fournisseurs, et agréable à lire et écrire pour les humains, tandis que la variante basée sur JSON est plus facile à générer et à analyser pour les machines.",
  "What makes Terraform very powerful are two basic features: **variables** and **m.F29F6CFC8D18A39724FE": "Ce qui rend Terraform très puissant, ce sont deux fonctionnalités de base : **les variables** et **les modules**. Les variables vous permettent de créer des ressources dont les valeurs réelles peuvent être insérées depuis un autre endroit, et les modules regroupent un certain nombre de ressources, ce qui offre l’avantage de la réutilisabilité et de l’imbrication. Bien que ces deux fonctionnalités paraissent très basiques, leur combinaison en fait une équipe de rêve. Cela parce que l'ouverture de Terraform vous permet de définir des variables d'entrée pour chaque module et également d'exporter des variables via des sorties.",
  "A simple module is therefore structured like this:": "Un module simple est structuré comme ceci :",
  "azure-resource-group/": "groupe-de-ressources-azure/",
  "main.tf": "principal.tf",
  "variables.tf": "variables.tf",
  "outputs.tf": "sorties.tf",
  "README.md": "README.md",
  "All files except `main.tf` are optional (the `README.md` isn’t Terraform-specifi.C0AA6A4205B65B850BDC": "Tous les fichiers sauf `principal.tf` sont optionnels (le `README.md` n’est pas spécifique à Terraform), mais je préfère suivre les bonnes pratiques, donc l’exemple les inclut.",
  "Let's look at a simple example. Imagine we want to manage a resource group in Az.C7130E93293C5F3835FA": "Examinons un exemple simple. Imaginez que nous voulons gérer un groupe de ressources dans Azure avec Terraform. Dans le fichier `variables.tf`, nous définissons quelles entrées nous attendons dans le module. Chacun des deux blocs représente la variable et les propriétés de la variable, comme la `description` ou le `type` :",
  "You might have noticed that the `location` variable also has a `default` propert.98D282B5427579CFCDE8": "Vous avez peut-être remarqué que la variable `location` a également une propriété `default`, ce qui rend la variable optionnelle et fournit une valeur de secours si aucune n'est spécifiée. Ces variables peuvent ensuite être utilisées dans le fichier `principal.tf`, où nous définissons les ressources réelles que nous voulons générer :",
  "In this case, we just define our simple resource group, which you can think of a.549C08D1FEC998D18486": "Dans ce cas, nous définissons simplement notre groupe de ressources, que vous pouvez imaginer comme un dossier dans Azure - explication très simpliste. Maintenant, la dernière partie que nous pouvons implémenter est le fichier `sorties.tf` :",
  "This is very useful if we want to use information like the ID of the resource gr.EB0A3E52AB5C3982D204": "Cela est très utile si nous voulons utiliser des informations comme l'ID du groupe de ressources plus tard dans d'autres parties de notre projet Terraform.",
  "As I already wrote, the `README.md` is not actually part of the Terraform defini.E6BDEA6D28A17F85099B": "Comme je l'ai déjà mentionné, le `README.md` ne fait pas vraiment partie des définitions Terraform, mais aide à comprendre l'objectif du module :",
  "As the `README.md` already suggests, we can now use this module to create an Azu.A94748FE0C01D4120745": "Comme le `README.md` le suggère déjà, nous pouvons maintenant utiliser ce module pour créer un groupe de ressources Azure n'importe où dans notre projet. Nous devons juste nous assurer que le chemin vers le dossier du module est correct et que Terraform sait comment interpréter les fichiers `main.tf`, `variables.tf` et `outputs.tf`. Dans ce cas, étant donné que nous ne spécifions pas la variable `location`, elle sera définie sur `\"westeurope\"`.",
  "I hope this section gave you a better basic understanding of what Terraform is a.8558BAB715B916ACA2AE": "J'espère que cette section vous a donné une meilleure compréhension de base de ce qu'est Terraform et de ce que vous pouvez faire avec.",
  "The tedious task of Terraform": "La tâche fastidieuse de Terraform",
  "You might have noticed that the `source` field of a module creates an awesome fl.8E968461FC7650C53259": "Vous avez peut-être remarqué que le champ `source` d’un module crée une flexibilité incroyable pour l’ensemble du projet puisque vous pouvez définir des modules n’importe où et les utiliser n’importe où dans le projet.",
  "However, this feature also has a huge drawback when it comes to maintainability:.648C608F44A24AAF64E1": "Cependant, cette fonctionnalité a aussi un énorme inconvénient en termes de maintenabilité : résoudre les valeurs réelles derrière les variables peut être très fastidieux. Bien que dans cet exemple simple, cela puisse sembler facile à gérer, plus le projet grandit, plus il devient imbriqué, et plus il est difficile et chronophage de comprendre et d'adapter le code Terraform. C'est pourquoi j'ai créé une extension.",
  "**What should the extension do?** The main goal of the extension is to provide t.8B7ACE467BC6CBF2D8B5": "**Que doit faire l'extension ?** Le principal objectif de l’extension est de fournir les valeurs réelles des variables partout où elles sont utilisées. Si un module est appelé à partir de plusieurs endroits ou simplement plusieurs fois, les informations doivent indiquer quel cas d’utilisation définit la variable avec quelle valeur. Si les modules sont profondément imbriqués, les valeurs doivent être résolues jusqu'à ce que nous atteignions les fichiers `.tfvars`. Ce sont les fichiers où vous pouvez définir des valeurs codées en dur pour les variables.",
  "How to start a VS Code extension": "Comment démarrer une extension VS Code",
  "Creating the basic template project for a VS Code extension is as easy as runnin.6F4EB3BBD45F5DF0A520": "Créer le projet modèle de base pour une extension VS Code est aussi simple que d'exécuter cette commande lorsque vous avez [Node](https://github.com/nodejs) installé :",
  "This command temporarily installs the Yeoman (a generator software), and enters .5FDA5DDC43BF09081006": "Cette commande installe temporairement Yeoman (un logiciel générateur), et entre dans un mode interactif où certaines questions doivent être répondues, comme le nom du projet, le type et la description. Dans le bloc suivant, vous pouvez voir toutes les questions et les réponses par défaut :",
  "For further information regarding VS Code extensions I want to link to [the offi.B0448C131D881366A635": "Pour plus d'informations sur les extensions VS Code, je tiens à renvoyer à [la documentation officielle](https://code.visualstudio.com/api/get-started/your-first-extension), car elle est toujours à jour contrairement à mes explications ici.",
  "3… 2… 1… Vibe-Coding!": "3… 2… 1… Vibe-Coding !",
  "I like to start new projects by asking [ChatGPT](https://github.com/openai) for .FD250EAE4277C6E99E2B": "J'aime commencer de nouveaux projets en posant des questions techniques générales à [ChatGPT](https://github.com/openai) comme :",
  "How would you suggest achieving such a project?": "Comment suggéreriez-vous de réaliser un tel projet ?",
  "How long do you estimate it will take me?": "Combien de temps estimez-vous que cela me prendra ?",
  "How difficult will it be?": "À quel point cela sera-t-il difficile ?",
  "Brainstorming with AI bots seems like a very sensible way to get a better overvi.59F0199CCC0E7F65A0D7": "Brainstormer avec des bots d'IA semble être un moyen très sensé d'avoir une meilleure vue d'ensemble des nouveaux projets, surtout lorsqu'on s'aventure dans des terrains complètement inconnus.\nCréer une extension VS Code était exactement un tel cas d'utilisation, car je n'avais jamais créé quelque chose pour VS Code ou tout autre IDE auparavant.\nAprès cette phase initiale de brainstorming, je préfère utiliser [Claude](https://github.com/anthropics) pour programmer tous les fichiers nécessaires à une telle extension, car, selon mon expérience, ce bot IA a vraiment la capacité de produire des codes impeccables. J’ai rarement rencontré des bugs ou problèmes d’exécution avec le code de Claude, alors je l’utilise exactement pour ces cas d’utilisation - les premiers pas. L’inconvénient de Claude est sa version d’essai gratuite très limitée, ce qui fait que je suis toujours prudent dans le choix de mes mots et que j’essaie de prévoir autant d'erreurs potentielles que l'IA pourrait faire.\nC’est ainsi que tout a commencé : j’ai pris le temps de formuler mon scénario et mon souhait exact dans les fenêtres de contexte limitées d’une machine à mots aléatoires appelée Claude et j’ai immédiatement reçu une implémentation massive du fichier `extension.ts`. Bien sûr, il y avait des différences évidentes entre ma vision et la communication avec ce LLM, alors j’ai dû lui dire une autre fois quelles sont les considérations importantes, et pour pouvoir recevoir davantage de code, j’ai également utilisé mon astuce magique : \"Si cela est trop grand pour un fichier, donne-moi simplement l’ensemble de `extension.ts` en plusieurs fichiers, ce qui devrait bien sûr fonctionner.\"",
  "Claude then went on a long journey.": "Claude s'est alors lancé dans un long périple.",
  "After some struggling to keep it going my tokens were all used and I had to figu.2D452B77249C8430A480": "Après quelques difficultés à le maintenir opérationnel, tous mes jetons étaient utilisés et j'ai dû terminer le reste du code moi-même. Néanmoins, j'ai réussi à obtenir une version fonctionnelle, car il ne manquait pas grand-chose, et j'ai immédiatement identifié quelques améliorations qui étaient passées inaperçues jusqu'à maintenant. Étant donné que je devais attendre le rechargement de mes jetons, c'est exactement ce que j'ai fait.",
  "The next morning the improvement session began, and after two long conversations.D0F806E5F02FCADFF975": "Le lendemain matin, la session d'amélioration a commencé, et après deux longues conversations, la fenêtre de contexte était complètement remplie et je ne pouvais même plus envoyer de messages dans le même chat, bien que mes jetons ne soient pas encore expirés. Cependant, tout ce que je voulais accomplir et obtenir de Claude était désormais disponible et je pouvais effectuer des tests dans l'un de mes projets plus importants. Après avoir confirmé et ajusté manuellement quelques morceaux de code, j'étais satisfait pour le moment et j'ai décidé que la première version publique était prête.",
  "Some trial and error with [GitHub Actions](https://github.com/github) later, I m.B1A6CFA9C8791F3B0E65": "Après quelques essais et erreurs avec [GitHub Actions](https://github.com/github), j'ai réussi à [configurer le publisher](https://code.visualstudio.com/api/working-with-extensions/publishing-extension#create-a-publisher) pour une extension VS Code. Et après deux versions correctives, j'étais assez satisfait des résultats.",
  "The Final Result": "Le Résultat Final",
  "Try out the extension yourself by clicking on the button below. There are still .53D329C6D712DEFF0967": "Essayez l'extension vous-même en cliquant sur le bouton ci-dessous. Il reste encore de nombreuses améliorations à apporter, donc si vous êtes intéressé pour aider, n'hésitez pas à contribuer sur [GitHub](https://github.com/trueberryless/terraform-variables-resolution).",
  "Install Terraform Variables Resolution": "Installer Terraform Variables Resolution",
  "Here you can see the example from [the Terraform explanation](#what-is-terraform.772358BC6F4987371F60": "Voici un exemple tiré de [l'explication de Terraform](#what-is-terraform), montrant comment cette extension ajoute visuellement les valeurs des variables dans VS Code :",
  "![Terraform Variables Resolution Example](../../../assets/terraform/terraform-va.94526691E47AD9D882F5": "Exemple de Résolution des Variables de Terraform",
  "How I Built a GitHub Profile README That Shouldn’t Exist (But It Does)": "Comment j'ai créé un README de profil GitHub qui ne devrait pas exister (mais il existe)",
  "A deep dive into the technical challenges and solutions behind my GitHub profile.8493E1B06B7E9BE16E95": "Une plongée approfondie dans les défis techniques et les solutions derrière mon README de profil GitHub, avec manipulation de SVG, automatisation et une grille dynamique Bento.",
  "Creating a standout <a class=\"gh-badge\" href=\"https://github.com/github\"><img sr.EC7EC3169C3D5076914B": "Créer un README de profil <a class=\"gh-badge\" href=\"https://github.com/github\"><img src=\"https://github.com/github.png\" alt=\"github\" />GitHub</a> remarquable ne se limite pas à ajouter quelques badges — il s'agit de repousser les limites techniques. Dans cette exploration approfondie, j'examine la manipulation de SVG au niveau inférieur, la conversion HTML en SVG, les animations intégrées et l'automatisation complète avec GitHub Actions pour créer ce que je crois être l'un des READMEs GitHub les plus avancés techniquement. D'une grille Bento dynamique qui se met à jour toutes les 5 minutes à des SVG intégrés en direct sans requêtes externes, ce projet a transformé mon profil en une vitrine vivante et auto-mise à jour de mon travail. Vous voulez savoir comment je l'ai fait ? Détaillons ensemble. 🚀",
  "Read the more formal story [here](https://trueberryless.org/work/github-profile-.5BCD9DBA0F2103014075": "Lisez l'histoire plus formelle [ici](https://trueberryless.org/work/github-profile-readme/)",
  "The Beginning: A README That Looked Like a Wikipedia Dump": "Le début : un README qui ressemblait à une page Wikipedia",
  "Every great story starts with a problem, and mine was simple: my [GitHub profile.3713BD43F2A1A91BFB7E": "Chaque grande histoire commence par un problème, et le mien était simple : le README de mon [profil GitHub](https://github.com/trueberryless) était un vrai bazar. Il était long. Il y avait trop de texte. Il débordait de badges — tellement que ça ressemblait à une collection de trophées internet. Hackathons, contributions GitHub, Astro, roadmap.sh — s’il existait un badge, je l’avais.",
  "At first, I thought this was fine. It showed everything about me, right? But one.773B7C308644FEDA7081": "Au début, je pensais que c'était bien. Ça montrait tout sur moi, non ? Mais un jour, je l’ai regardé et j’ai réalisé :",
  "This is not stylish. This is a cluttered disaster.": "Ce n'est pas stylé. C'est un désastre encombré.",
  "I needed something new. Something clean. Something visually striking. I wanted a.C82835C3D13A6981B63B": "J'avais besoin de quelque chose de nouveau. De quelque chose de propre. De quelque chose de visuellement frappant. Je voulais une **grille Bento** qui inciterait les gens à s'arrêter et à l'admirer, plutôt que de défiler dans la confusion. Un design si bien exécuté que toute personne qui le verrait voudrait instantanément le sien.",
  "That was the dream. Now I just had to make it real.": "C'était le rêve. Maintenant, je devais juste le réaliser.",
  "Phase 1: The HTML Dream (and Markdown Nightmare)": "Phase 1 : Le rêve HTML (et le cauchemar Markdown)",
  "The first step was simple: mock up my perfect profile in HTML and CSS. And let m.EEFE6C2742301B518D46": "La première étape était simple : modéliser mon profil parfait en HTML et CSS. Et laissez-moi vous dire, c’était incroyable. Il avait une mise en page parfaite, des animations fluides et juste le bon équilibre entre contenu et espace. Puis la réalité m’a rattrapé. Il fallait que cela fonctionne dans le *Markdown au format GitHub*. Pas de problème, non ? Markdown prend en charge le HTML ! Alors j'ai copié mon magnifique HTML dans mon README et j'ai enregistré.",
  "[GitHub](https://github.com/github): *Absolutely not.*": "[GitHub](https://github.com/github) : *Absolument pas.*",
  "GitHub’s Markdown [strips out a not a huge number of HTML tags, but important on.8ADCE02DB7CC7739FAD2": "Le Markdown de GitHub [supprime un certain nombre de balises HTML, mais des balises importantes](https://github.github.com/gfm/#disallowed-raw-html-extension). Pour des raisons de sécurité, bien sûr (et je respecte totalement cela, GitHub, vraiment ❤️), mais cela signifiait que mon design parfait était complètement **inutilisable**.",
  "I tried tweaking it. Replacing unsupported tags with ones that worked. Maybe I c.14452FE82B6AC0DB8958": "J'ai essayé de le modifier. De remplacer des balises non prises en charge par d'autres qui fonctionnaient. Peut-être que je pouvais en sauver une partie ? *Non*. Les limitations du Markdown rendaient ma mise en page de rêve impossible.",
  "Phase 2: The \"Just Use a Python Script\" Cope": "Phase 2 : \"Juste utiliser un script Python\" (comment survivre)",
  "When in doubt, automate. If I couldn’t get my HTML in directly, maybe I could ge.FD6C9ADF71816E0E5B49": "En cas de doute, automatisez. Si je ne pouvais pas intégrer directement mon HTML, peut-être pourrais-je générer quelque chose de dynamique avec un script ? J'ai donc monté un script Python pour récupérer mon dernier dépôt GitHub et l’insérer dans mon README. Voici ces quelques octets de code Python au hasard :",
  "This seemed like a step in the right direction. It was automated. It was functio.D20A833F97288BD3E73B": "Ça semblait être une bonne direction. C'était automatisé. C'était fonctionnel. Mais cela ne résolvait pas mon véritable problème. 😢",
  "This wasn’t about dynamic content — it was about *design*. And no amount of Pyth.8C914CE49CA59FC373EC": "Ce n'était pas une question de contenu dynamique — c'était une question de *design*. Et aucun script Python ne rendrait Markdown beau.",
  "Phase 3: \"Fine, I'll Just Use a Screenshot\" (Rock Bottom)": "Phase 3 : \"Bon, je vais juste utiliser une capture d'écran\" (fond du gouffre)",
  "At this point, I was desperate. I considered the unthinkable: *just take a scree.A573BC6FDCB7D404B86F": "À ce stade, j'étais désespéré. J'ai envisagé l'impensable : *il suffit de prendre une capture d'écran du HTML et de la mettre dans mon README en tant qu'image.* C'était une approche brutale. C'était paresseux. C'était... efficace ?",
  "For a moment, I actually thought about doing it. But I knew deep down that I wou.F11BA1015DB80A5D8D2D": "Pendant un instant, j'ai vraiment pensé à le faire. Mais je savais au fond de moi que je ne me pardonnerais jamais si je laissais cela être ma solution finale.",
  "Just for the reference, I would have used [Puppeteer](https://www.npmjs.com/pack.7C033B35BC935C314B6E": "À titre de référence, j'aurais utilisé [Puppeteer](https://www.npmjs.com/package/puppeteer) et [FFmpeg](https://www.ffmpeg.org/) — je n'ai aucune idée de ce que sont ces outils.",
  "Phase 4: Enter SVG (The Light at the End of the Tunnel)": "Phase 4 : Passons aux SVG (la lumière au bout du tunnel)",
  "I abandoned the cursed screenshot plan and looked for something more flexible.": "J'ai abandonné le plan maudit de la capture d'écran et cherché quelque chose de plus flexible.",
  "SVGs.": "Les SVG.",
  "SVGs could scale, they supported both text and images, and — most importantly — .F259141963EA4A11F694": "Les SVG sont évolutifs, prennent en charge à la fois le texte et les images, et — plus important encore — ils peuvent **intégrer** du HTML à l'intérieur.",
  "So I tried something like this:": "Alors j'ai essayé quelque chose comme ceci :",
  "Promising! This could actually work!": "Prometteur ! Cela pourrait vraiment fonctionner !",
  "Then I got busy with other things, forgot to debug it, and never returned to thi.9BEE5D08ED4C8C9B33DD": "Puis j'ai été occupé par d'autres choses, j'ai oublié de le déboguer, et je n'y suis jamais retourné.",
  "![Throw away a good idea](../../../../public/online-classes-throw-away.gif)": "Jeter une bonne idée",
  "Phase 5: SVGs Within SVGs Within SVGs (Inception Level 100)": "Phase 5 : Des SVG imbriqués dans des SVG eux-mêmes imbriqués (niveau Inception 100)",
  "When I came back to the project, I was **determined** to make it work.": "Quand je suis revenu sur le projet, j'étais **déterminé** à le faire fonctionner.",
  "I realised that if I couldn’t directly embed HTML into Markdown, I could fake it.8993D07A86C6FB209386": "J’ai réalisé que si je ne pouvais pas intégrer directement du HTML dans le Markdown, je pouvais le simuler en utilisant des SVG imbriqués. (Ceci est massivement simplifié ; le processus réel a pris des jours, qui ressemblaient à des semaines sinon des mois, mais je sais que vous ne lirez pas tout cela de toute façon, alors peu importe.)",
  "And then, after hours of research, I stumbled across a life-changing Stack Overf.B19E66FB6CDC38EB7F45": "Et puis, après des heures de recherche, je suis tombé sur une réponse révolutionnaire sur Stack Overflow :",
  "This lead me to the current solution:": "Cela m'a conduit à la solution actuelle :",
  "Convert my HTML layout to SVG.": "Convertir ma mise en page HTML en SVG.",
  "Encode all images in **Base64** (because GitHub Markdown won’t load external ima.6BA37AFF26936D15AD36": "Encoder toutes les images en **Base64** (car le Markdown de GitHub ne charge pas les images externes à l'intérieur d'un SVG avec du HTML).",
  "Inline dynamic SVGs (like my GitHub stats, Spotify status, etc.).": "Inclure des SVG dynamiques (comme mes statistiques GitHub, mon statut Spotify, etc.).",
  "Automate everything with **GitHub Actions**.": "Tout automatiser avec **GitHub Actions**.",
  "The Grand Finale: The Ultimate GitHub Profile README": "Le Grand Final : Le README de profil GitHub ultime",
  "A sleek Bento Grid layout, perfectly structured in SVG.": "Une mise en page en grille Bento élégante, parfaitement structurée en SVG.",
  "A live-updating Spotify status, inlined as an SVG.": "Un statut Spotify mis à jour en temps réel, inclus en SVG.",
  "GitHub stats, dynamically inserted via automation.": "Des statistiques GitHub, insérées dynamiquement via l'automatisation.",
  "Fully responsive, fully scalable, and fully insane to build.": "Entièrement responsive, entièrement évolutif et absolument fou à construire.",
  "It updates itself every 5 minutes, runs completely on GitHub Actions, and doesn’.D6DD34ED3B85DAE2F120": "Il se met à jour automatiquement toutes les 5 minutes, fonctionne entièrement sur GitHub Actions et ne dépend d'aucun service externe. C'est beau. C'est efficace. Et surtout, c'est techniquement absurde dans le meilleur sens du terme.",
  "Take a look at a specific example of the final results at some point back in tim.096EC0AF4A7E3D30CE29": "Jetez un œil à un exemple concret du résultat final à un certain point dans le temps.",
  "Isn't that bad compared to the [old README.md](https://github.com/trueberryless/.E3E5E0072DF705843179": "Ce n'est pas si mal comparé à l'[ancien README.md](https://github.com/trueberryless/trueberryless/blob/5dce4ad0033b00829f8ec3756827057017447a65/README.md). Et ne commentez pas pourquoi j’écoute du K-pop ! C’est mieux que ce que vous pensez, croyez-moi.",
  "Check out the live version on my GitHub [trueberryless](https://github.com/trueb.4FFADA956CF12B9EFE9F": "Consultez la version en direct sur mon GitHub [trueberryless](https://github.com/trueberryless) — si j'ai décidé de la garder... — et laissez un follow si vous y êtes déjà et avez apprécié cette lecture ! ❤️",
  "Final Thoughts: Was It Worth It?": "Pensées finales : Est-ce que ça valait le coup ?",
  "Absolutely.": "Absolument.",
  "This journey was frustrating, time-consuming, and filled with more roadblocks th.9E6BE12D4EDD580594EA": "Ce parcours fut frustrant, chronophage, et rempli de plus d'obstacles que je ne l'aurais jamais imaginé. Mais j'ai appris tellement de choses sur les SVG, les limitations du Markdown, GitHub Actions et l'automatisation en cours de route.",
  "Would I do it again? Definitely.": "Est-ce que je le referais ? Définitivement.",
  "Would I recommend it? Only if you have way too much patience. 😅": "Est-ce que je le recommanderais ? Seulement si vous avez une patience infinie. 😅",
  "But in the end, I created a [GitHub](https://github.com/github) profile README t.2B7EC6933681A24E2F33": "Mais au final, j'ai créé un README de profil [GitHub](https://github.com/github) qui *ne devrait pas exister* — mais il existe. Et je l'adore.",
  "A short history of Starlight Sidebar Topics plugins": "Une courte histoire des plugins Starlight Sidebar Topics",
  "In this blog post, I'll show you the evolution of Starlight plugins with a case .4AA6D9FADD1A6BE13985": "Dans cet article de blog, je vais vous montrer l'évolution des plugins Starlight avec une étude de cas du plugin Starlight Sidebar Topics.",
  "In this post, I'll show you the evolution of <a class=\"gh-badge\" href=\"https://g.995EB19ECCFE1867C83C": "Dans cet article, je vais vous montrer l'évolution des <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" /> Starlight</a> plugins avec une étude de cas du plugin [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar-topics). Préparez-vous à découvrir des faits impressionnants sur les personnes et le code autour de Starlight.",
  "Maybe you have heard about this cool documentation framework before. I talk abou.5A104B8E7F80C4B25128": "Peut-être avez-vous déjà entendu parler de ce framework de documentation génial. J'en parle assez souvent et je l'utilise régulièrement. Non seulement parce que je suis un contributeur actif, mais aussi parce que [Starlight](https://starlight.astro.build) m’est vraiment cher. Ses caractéristiques : simplicité et minimalisme, mais tout ce dont vous avez besoin. Sa performance : [plus rapide que 98 % des autres sites Web](https://www.websitecarbon.com/website/starlight-astro-build-getting-started/). Son accessibilité : même pas une question !",
  "The Creation": "La Création",
  "However, one thing that's objectively missing in my opinion is a granular way of.77A7287A955230B54D96": "Cependant, une chose qui manque objectivement à mon avis, c'est une manière granulaire de séparer les sujets généraux dans votre documentation. Et je ne suis pas seul avec cette opinion subjective largement acceptée. [HiDeoo](https://github.com/HiDeoo) n'est pas seulement l'un des mainteneurs les plus actifs du projet, mais également l'auteur des plugins les plus nombreux et, selon moi, les meilleurs que vous pouvez trouver pour Starlight. Ils ont également remarqué cette fonctionnalité de niche manquante concernant les sujets. C'est pourquoi ils ont décidé de créer le plugin [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar-topics) dès octobre 2024, ce qui vous permet de créer une barre latérale avec des sujets. Lisez-en plus sur les fonctionnalités du plugin dans [sa documentation](https://starlight-sidebar-topics.netlify.app/).",
  "The one thing that bothered me personally in the early days of the plugin was th.6F5F49BB9B5B06675F60": "La chose qui me gênait personnellement dans les premiers jours du plugin était la manière dont les sujets étaient affichés dans la barre latérale. Parce qu'il n’utilise pas - comme je l’imaginais - un menu déroulant pour passer d'un sujet à l'autre, mais montre au contraire toujours tous les sujets. Ce choix de conception était, comme [HiDeoo le souligne clairement](https://github.com/HiDeoo/starlight-sidebar-topics/issues/2#issuecomment-2410196392), très intentionnel et non sans raisons : tous les sujets devraient être visibles en même temps. Prouvé par les documents [Astro](https://github.com/withastro) eux-mêmes ([Chris Swithinbank](https://github.com/delucis) a implémenté la [\"barre latérale à onglets\"](https://github.com/withastro/docs/pull/9890) pour la documentation Astro v5 plus tard dans le même mois), cette approche présente de nombreux avantages par rapport à un menu déroulant. Néanmoins, j'étais toujours insatisfait de ce design, alors j’ai créé ma propre version.",
  "Copying and pasting was my strength when it came to building a new Starlight plu.860638CCB2BA61F003E9": "Copier et coller était ma force quand il s’agissait de créer un nouveau plugin Starlight pour la communauté. Et c’est ce que j’ai fait. J’ai pris le plugin Starlight Sidebar Topics comme point de départ et j’ai simplement adapté le composant `Topics.astro`, qui inclut le HTML pour afficher les sujets dans la barre latérale. Après avoir lutté un certain temps pour implémenter un menu déroulant qui soit satisfaisant et propre visuellement (désolé pour l'autosatisfaction, mais je suis fier de moi), j’ai finalement trouvé une solution dont je suis très satisfait et j’ai publié ce nouveau plugin sous le nom [Starlight Sidebar Topics Dropdown](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown) - quelle originalité.",
  "The Adaptation": "L'Adaptation",
  "You might think that this story is now over because everyone could just use the .B22BDA5C191E4AEC54CE": "Vous pourriez penser que cette histoire est maintenant terminée car tout le monde pourrait simplement utiliser la variante qu’il souhaite, tout le monde est heureux. Mais Starlight a continué et continue de s'améliorer, et environ trois mois plus tard, le 15 février, il y a eu l'ajout tant attendu de « route data » dans Starlight avec la sortie de [v0.32](https://github.com/withastro/starlight/releases/tag/@astrojs/starlight@0.32.0). Cet ajout apparemment simple a ouvert tant de possibilités, auxquelles je n’aurais jamais pensé. HiDeoo a de nouveau été la principale source d'inspiration pour les auteurs de plugins et a poussé cette nouvelle fonctionnalité à ses limites. Il leur a fallu seulement deux jours pour [adapter plus de 11 plugins à la dernière version de Starlight à l’époque](https://bsky.app/profile/hideoo.dev/post/3liffpudc5c2b), et ils ont ensuite amélioré et remanié une grande partie du code pour tirer encore plus parti de cette fonctionnalité puissante.",
  "And so comes the day when HiDeoo contacts me to tell me that the Starlight Sideb.CB4E9F542FB4DC96204E": "Et ainsi vint le jour où HiDeoo me contacte pour me dire que le plugin Starlight Sidebar Topics utilise maintenant la nouvelle fonctionnalité de données de route de Starlight. Au début, je ne comprenais pas vraiment quels avantages ces changements d’implémentation auraient, mais HiDeoo a pris le temps de m’expliquer que je pouvais maintenant transformer le plugin Starlight Sidebar Topics Dropdown en un simple composant utilisant les données de route de son plugin. Intuitivement, j’étais opposé à cette idée intelligente car cela donnait l’impression que mon seul plugin ayant une certaine popularité devenait un composant inutile. Je ne pouvais pas être plus loin de la vérité.",
  "The Union": "L'Union",
  "Eventually, I decided to refactor my plugin into a component - this refactoring .4324540ABE36305F27C5": "Finalement, j’ai décidé de refondre mon plugin en un composant - cette refonte a éliminé exactement [1210 lignes de code et ajouté 68 lignes de changelog](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown/pull/40) - et j’ai remarqué à quel point il fallait maintenant peu de code pour transformer la liste `Topics.astro` en un menu déroulant du point de vue d’un utilisateur. J’étais convaincu que c’était vraiment la bonne direction pour le ~~plugin~~ composant. Et donc, j’ai mis à jour toute la documentation - plus exactement : supprimé plus de 200 lignes de texte (ça fait du bien) - et j’ai publié la nouvelle [version 0.5](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown/releases/tag/starlight-sidebar-topics-dropdown%400.5.0).",
  "Now you might wonder how such mature plugins could still improve over time. To b.8F9AABD213A178EFB11C": "Vous vous demandez peut-être comment des plugins aussi matures pourraient encore s’améliorer avec le temps. Pour être honnête, moi-même j’ai été très surpris lorsque HiDeoo a lâché une idée brillante dans mes messages privés sur Discord. Son idée était et reste ingénieuse. Sinon, je n’y penserais même plus à ce *sujet*. Mais me voilà, en train d’écrire un texte de 800 mots juste pour vous préparer à ce qui va suivre. Roulement de tambour ! Attachez votre ceinture ! Cette déclaration de HiDeoo va vous épater :",
  "\"One could have something like the default built-in list on a desktop view, and .D9D8BC0B8C5FADE63015": "\"On pourrait avoir quelque chose comme la liste intégrée par défaut sur une vue bureau, et utiliser votre composant pour la version mobile, ou quelque chose comme ça 🧠\" — HiDeoo, 21/03/2025 09:54",
  "Profound. Timeless. Golden.": "Profond. Intemporel. En or.",
  "And that single, beautiful spark of an idea? It’s precisely what I’ll guide you .D5B772B8E2ED479D7F54": "Et cette seule et belle étincelle d’idée ? C’est précisément ce que je vais vous expliquer dans [l’article \"Starlight Topics Dropdown and List together\"](/blog/starlight-dropdown-and-list-together/).",
  "How to make your Starlight sidebar items look better": "Comment rendre les éléments de la barre latérale Starlight plus attrayants",
  "In this blog post, we'll take a look at how small changes can make a big differe.710EB546A7825319B5BD": "Dans cet article de blog, nous examinerons comment de petits changements peuvent faire une grande différence en termes d'espaces blancs, de tailles de police, de poids et de couleurs dans votre barre latérale Starlight.",
  "In this blog post, we'll take a look at how small changes can make a big differe.91CB4D1869F959776162": "Dans cet article de blog, nous examinerons comment de petits changements peuvent faire une grande différence en termes d'espaces blancs dans votre <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" />Starlight</a>.",
  "Have you ever wondered why your [Starlight][starlight] sidebar doesn't look that.1641BC1FAEE439920C90": "Vous êtes-vous déjà demandé pourquoi votre barre latérale [Starlight][starlight] n'est pas si attrayante ? Saviez-vous combien l'espace entre les éléments de votre barre latérale est inconsciemment important ? La taille de la police, le poids et les petites différences de couleur ? Dans ce guide, nous examinerons comment personnaliser l'apparence de votre barre latérale Starlight avec des étapes rapides et faciles.",
  "Prerequisites": "Prérequis",
  "First, you need to [set up your Starlight site][starlight-getting-started]. Afte.DF558576AB082588D034": "Tout d'abord, vous devez [configurer votre site Starlight][starlight-getting-started]. Ensuite, Starlight offre un [guide sur la personnalisation des styles appliqués à votre site Starlight][starlight-css], qui est la fonctionnalité que nous utiliserons dans cet article.",
  "As described in [this guide][starlight-css-custom], you need to create a `.css` .0CD83940C89F2D1185A1": "Comme décrit dans [ce guide][starlight-css-custom], vous devez créer un fichier `.css` quelque part dans votre répertoire `src/`, où vous pouvez définir vos styles CSS. N'oubliez pas d'ajouter le chemin vers ce fichier `.css` dans le tableau `customCss` de Starlight dans le fichier `astro.config.mjs` :",
  "After completing these preparation steps, you are ready to try out some nice adj.DE7E5B1DE51E76B69982": "Après avoir terminé ces étapes de préparation, vous êtes prêt à essayer quelques ajustements intéressants à la conception de la barre latérale de Starlight.",
  "Customizations": "Personnalisations",
  "There are endless different possibilities that you can play around with just wit.315492DDFA6948DAD882": "Il existe une infinité de possibilités différentes auxquelles vous pouvez jouer simplement avec votre CSS personnalisé. Je vais vous donner quelques idées que j'ai trouvées très utiles en expérimentant avec la conception de la barre latérale. Bien que certaines de ces idées puissent sembler absurdes, je vous promets que la combinaison de quelques-unes d'entre elles rendra votre barre latérale Starlight encore meilleure.",
  "One thing to note though is that in this blog post the focus lies on adjusting t.157A7D5F675513D49CA2": "Une chose à noter cependant, dans cet article, l'accent est mis sur l'ajustement du style des **éléments de niveau racine** (ceux qui n'ont pas d'enfants) dans la barre latérale.",
  "But before I do that, I'll show you how the default styling of the Starlight sid.935D4EBD7A75949003B6": "Mais avant cela, je vais vous montrer à quoi ressemble actuellement le style par défaut de la barre latérale Starlight :",
  "![Default styling of the Starlight sidebar](../../../assets/sidebar-css/no-css.p.CD83DAFB82A4B2123FA6": "Style par défaut de la barre latérale Starlight",
  "Manipulate the whitespaces between sidebar items": "Manipuler les espaces blancs entre les éléments de la barre latérale",
  "On the root level of your Starlight sidebar, there are two different types of el.44095ABCBC3AC9DE4022": "Au niveau racine de votre barre latérale Starlight, il existe deux types d'éléments différents : **pages** et **groupes**. Bien que le style par défaut soit assez correct, je trouve que les espaces blancs - c'est-à-dire la marge entre les éléments qui n'inclut aucun contenu - sont un peu trop grands, surtout entre les éléments de niveau racine. Avec cet exemple de CSS personnalisé ci-dessous, j'ai réduit la marge entre les éléments de niveau racine tout en conservant la marge entre les groupes. Les styles CSS importants sont surlignés dans le bloc de code.",
  "![Starlight sidebar where the margin between root-level items is smaller](../../.880AFEBFAC9D61C70E2C": "Barre latérale Starlight où la marge entre les éléments de niveau racine est réduite",
  "Perhaps, this will not be as useful to you because you don't use root-level page.31533AC4A173BE6AA7E5": "Peut-être que cela ne sera pas aussi utile pour vous parce que vous n'utilisez pas de pages de niveau racine dans votre barre latérale, donc cet effet ne sera pas perceptible pour vous. Mais si c'est le cas, essayez-le.",
  "Adjust the font weight of sidebar items": "Ajuster le poids de la police des éléments de la barre latérale",
  "[Imho][imho] the one thing that triggers me the most about Starlight's root-leve.BC0D0A5B6F41C0B208BF": "[À mon avis][imho], ce qui me dérange le plus avec les éléments de niveau racine de la barre latérale de Starlight, c'est leur caractère gras. C'est probablement une opinion très subjective, mais si vous me demandez, une seule page ne peut pas être aussi importante qu'un groupe entier de pages dans votre documentation. Par conséquent, j'ai rendu le poids de la police des éléments de niveau racine plus léger, comme vous pouvez le voir dans le bloc de code ci-dessous.",
  "![Starlight sidebar with lighter font weight](../../../assets/sidebar-css/font-w.7D96D24D62FE18FEF0C9": "Barre latérale Starlight avec un poids de police réduit",
  "Adjust the colour of sidebar items": "Ajuster la couleur des éléments de la barre latérale",
  "A small but subtle change: I made unselected root-level items appear dimmer in t.487CF0E6076E81E13BB4": "Un petit changement mais subtil : j'ai rendu les éléments de niveau racine non sélectionnés plus ternes dans le bloc de code ci-dessous.",
  "If you choose to use this design as well, I recommend that you only apply the se.C425BF4402932D0E21FC": "Si vous choisissez d'utiliser ce design également, je recommande de n'appliquer que la deuxième règle CSS puisque la première revient simplement à démontrer comment ajuster le style des éléments de niveau racine sélectionnés — cette règle s'applique également aux autres blocs de code dans ce blog s'ils sont marqués comme `valeur par défaut`.",
  "![Starlight sidebar with dimmer colors](../../../assets/sidebar-css/color.png)": "Barre latérale Starlight avec des couleurs plus ternes",
  "Adjust the font size of sidebar items": "Ajuster la taille de la police des éléments de la barre latérale",
  "Although I don't recommend it, you can also adjust the font size of sidebar item.5B666452173153740723": "Bien que je ne le recommande pas, vous pouvez également ajuster la taille de la police des éléments de la barre latérale. Avec cet exemple de CSS personnalisé ci-dessous, j'ai réduit la taille de la police des éléments de niveau racine.",
  "![Starlight sidebar with smaller font size](../../../assets/sidebar-css/font-siz.B88E6D3A46696C763ECA": "Barre latérale Starlight avec une taille de police réduite",
  "Recommendations": "Recommandations",
  "Summing everything up, I recommend that you apply some mix of the above customiz.01EDE8C6353CC9B29A42": "Pour résumer, je recommande d'appliquer un mélange des options de personnalisation ci-dessus, que vous pouvez facilement vérifier dans un seul fichier `.css`.",
  "Note that I also use [Cascade Layers][starlight-css-cascade-layers], supported s.26DC0EFB0948E47CFD73": "Notez que j'utilise également les [niveaux de cascade][starlight-css-cascade-layers], pris en charge depuis [Starlight 0.34.0][starlight-0-34], et je recommande de les utiliser pour spécifier l'ordre dans lequel les styles CSS sont appliqués.",
  "How to create a horizontal progress indicator for your Starlight site": "Comment créer un indicateur de progression horizontal pour votre site Starlight",
  "Learn how to create a horizontal progress indicator for your Starlight site.": "Apprenez à créer un indicateur de progression horizontal pour votre site Starlight.",
  "Learn how to create a horizontal progress indicator for your <a class=\"gh-badge\".E525FE811A5499114EFE": "Apprenez à créer un indicateur de progression horizontal pour votre <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" />Starlight</a> site.",
  "In this post, we would like to show you how [FrostyBee](https://github.com/frost.E8FB1C6C96EF64C97121": "Dans cet article, nous aimerions vous montrer comment [FrostyBee](https://github.com/frostybee) a créé un indicateur de progression horizontal et épuré pour les sites Starlight.",
  "You will need to have an existing Starlight website.": "Vous devez disposer d’un site web Starlight existant.",
  "Create the progress indicator component": "Créer le composant d'indicateur de progression",
  "Let's create a new component called `ProgressIndicator.astro` in the `src/compon.3AF2A56DBB850F8660D1": "Créons un nouveau composant appelé `ProgressIndicator.astro` dans le répertoire `src/components/`. Ce composant sera chargé de rendre l'indicateur de progression.",
  "We create a container which spans across the whole width with the progress bar `.BF53914FAF1D12F4D39C": "Nous créons un conteneur qui s'étend sur toute la largeur avec la barre de progression `<div>` à l'intérieur. La largeur de l'élément `<div>` interne est mise à jour chaque fois que l'utilisateur fait défiler la page (et lors du chargement de celle-ci) pour refléter la position de défilement actuelle.",
  "In the hidden lines is the styling which makes sure that the progress bar looks .D3205B85D528FA0A2D8A": "Dans les lignes masquées se trouve le style qui s'assure que la barre de progression ressemble à une barre de progression typique. Elle est également adaptée à Starlight car la barre est automatiquement masquée lorsque le site n’a ni barre latérale ni table des matières, mais possède un élément « hero », comme la plupart des pages de destination.",
  "One thing to point out is what the global CSS (line 45) does: It pushes the mobi.9D93B4CCEB69834E52E2": "Un point important à noter concernant le CSS global (ligne 45) : il déplace le menu déroulant de la table des matières mobile vers le bas pour créer plus d’espace blanc au niveau de la barre de progression. C'est une préférence personnelle et vous pouvez le supprimer si vous le souhaitez.",
  "Starlight Override": "Surcharge dans Starlight",
  "Now we can use this component in a [Starlight override](https://starlight.astro..BD7A14DF6609C76376D6": "Nous pouvons maintenant utiliser ce composant dans une [surcharge Starlight](https://starlight.astro.build/guides/overriding-components/). Dans ce cas, il est logique de surcharger le composant [`Header.astro`](https://starlight.astro.build/reference/overrides/#header-1) comme ceci :",
  "Do not forget to add this component override to your `astro.config.mjs` file:": "N’oubliez pas d’ajouter cette surcharge de composant à votre fichier `astro.config.mjs` :",
  "Source Code": "Code source",
  "You can find the whole project code on [GitHub](https://github.com/trueberryless.F650372F9DC07B1F43E8": "Vous pouvez trouver l'intégralité du code du projet sur [GitHub](https://github.com/trueberryless/starlight-progress-indicator) et dans cet [exemple sur Stackblitz](https://stackblitz.com/github/trueberryless/starlight-progress-indicator?file=src%2Fcomponents%2FProgressIndicator.astro).",
  "Conclusion": "Conclusion",
  "With this setup, the progress indicator will be displayed on every page (except .14DF840C82B37252652E": "Avec cette configuration, l'indicateur de progression sera affiché sur chaque page (sauf les pages de destination) de votre site Starlight. 🥳",
  "You can also check out [FrostyBee's](https://github.com/frostybee) [Starlight Sc.2885FB180F098A43BD51": "Vous pouvez également consulter le [plugin Starlight Scroll To Top de FrostyBee](https://github.com/frostybee/starlight-scroll-to-top), qui prend également en charge un [Progress Ring](https://frostybee.github.io/starlight-scroll-to-top/configuration/#showprogressring) intégré depuis la version `0.3.1`. 🙌",
  "Starlight Topics Dropdown and List together": "Dropdown et Liste des sujets Starlight ensemble",
  "Learn how to combine a desktop list and mobile dropdown for your Starlight sideb.E44A5587DB1652DE8801": "Découvrez comment combiner une liste de bureau et un menu déroulant mobile pour les sujets de votre barre latérale Starlight.",
  "Combine two <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><i.F2B401A419A027863D20": "Combinez deux plugins <a class=\"gh-badge\" href=\"https://github.com/withastro/starlight\"><img src=\"/starlight.png\" alt=\"Starlight\" />Starlight</a> Sidebar Topics pour afficher une liste de sujets sur le bureau et un menu déroulant dans la barre latérale mobile.",
  "Using the [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar.7183C62B96DBF9A43128": "En utilisant le plugin [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar-topics) avec le composant [Starlight Sidebar Topics Dropdown](https://github.com/trueberryless-org/starlight-sidebar-topics-dropdown), vous pouvez créer un site web qui affiche une liste de sujets sur le bureau et un menu déroulant sur mobile.",
  "Install the packages": "Installer les paquets",
  "First, install the `starlight-sidebar-topics` plugin and also the `starlight-sid.6A32241A1C081FF4DD1C": "Tout d'abord, installez le plugin `starlight-sidebar-topics` ainsi que le composant `starlight-sidebar-topics-dropdown` :",
  "Afterwards, follow the setup guides from [Starlight Sidebar Topics](https://star.754B56EA2499006C8169": "Ensuite, suivez les guides d'installation depuis [Starlight Sidebar Topics](https://starlight-sidebar-topics.netlify.app/docs/getting-started/#installation) et [Starlight Sidebar Topics Dropdown](https://starlight-sidebar-topics-dropdown.trueberryless.org/docs/getting-started/#installation).",
  "Modify the Sidebar component": "Modifier le composant de la barre latérale",
  "In the setup guide from the dropdown component, you have created a sidebar compo.BD6B58F9BEEFEE582749": "Dans le guide d'installation du composant déroulant, vous avez créé un composant de barre latérale qui ne rend que le menu déroulant. Désormais, vous devez modifier ce composant pour qu'il rende également la barre latérale par défaut si l'utilisateur est sur un bureau.",
  "Result": "Résultat",
  "If you follow these steps, your sidebar will look like this:": "Si vous suivez ces étapes, votre barre latérale ressemblera à ceci :",
  "![Final result with desktop view on the left and mobile view on the right](../...6745D424D50B4DE3BC95": "Résultat final avec l'affichage bureau à gauche et l'affichage mobile à droite",
  "You can find the complete source code of this guide in this [StackBlitz example].B731F1E66F12B002F90D": "Vous pouvez trouver le code source complet de ce guide dans cet [exemple StackBlitz](https://stackblitz.com/edit/withastro-starlight-qgraahmp?file=astro.config.mjs).",
  "Endless possibilities": "Possibilités infinies",
  "You could also do it the other way around (list on mobile, dropdown on desktop) .6BA6A2F32E24F0FB3A00": "Vous pourriez également faire l'inverse (liste sur mobile, menu déroulant sur le bureau) en intervertissant les propriétés `display: block` et `display: none` dans le CSS.",
  "Moreover, you could also create your own display component, which uses the route.40B5CA2AA37239989091": "De plus, vous pourriez également créer votre propre composant d'affichage, qui utilise les données de route depuis le plugin Starlight Sidebar Topics et rend les sujets d'une manière personnalisée. Cela est un peu plus avancé, mais vous trouverez plus d'informations à ce sujet dans la documentation [\"Custom Topics List\"](https://starlight-sidebar-topics.netlify.app/docs/guides/custom-topic-list/).",
  "Setting up Kubernetes with Cilium and Cloudflare": "Mise en place de Kubernetes avec Cilium et Cloudflare",
  "Today we'll take a look at how to set up a Kubernetes cluster with K3s and Ciliu.651207C3314901C11632": "Aujourd'hui, nous allons voir comment configurer un cluster Kubernetes avec K3s et Cilium.",
  "This blog posts describes the process of setting up a <a class=\"gh-badge\" href=\".E82478488BD3E7D9E2C2": "Cet article de blog décrit le processus de configuration d'un cluster <a class=\"gh-badge\" href=\"https://github.com/kubernetes\"><img src=\"https://github.com/kubernetes.png\" alt=\"Kubernetes\" />Kubernetes</a> avec <a class=\"gh-badge\" href=\"https://github.com/k3s-io\"><img src=\"https://github.com/k3s-io.png\" alt=\"k3s\" />k3s</a> et <a class=\"gh-badge\" href=\"https://github.com/cilium\"><img src=\"https://github.com/cilium.png\" alt=\"Cilium\" />Cilium</a>. Nous utilisons <a class=\"gh-badge\" href=\"https://github.com/helm\"><img src=\"https://github.com/helm.png\" alt=\"Helm\" />Helm</a> comme gestionnaire de packages et <a class=\"gh-badge\" href=\"https://github.com/cloudflare\"><img src=\"https://github.com/cloudflare.png\" alt=\"Cloudflare\" />Cloudflare</a> comme émetteur de certificats. Nous avons utilisé les astuces et conseils de Vegard S. Hagen tirés de [son article](https://blog.stonegarden.dev/articles/2024/02/bootstrapping-k3s-with-cilium/). En gros, ce blog explique comment tous les sites trueberryless.org sont déployés (ce n'est plus le cas).",
  "Working with [Docker](https://github.com/docker) Containers can be hard. However.1CC6942704DAE062A463": "Travailler avec les conteneurs [Docker](https://github.com/docker) peut être difficile. Cependant, il existe des outils qui facilitent la gestion des conteneurs, comme [Kubernetes](https://github.com/kubernetes). En fait, Kubernetes est le seul outil, à ma connaissance, qui agit comme un logiciel de gestion pour les conteneurs Docker. Kubernetes est bien intégré dans presque tous les fournisseurs de cloud, comme Google Cloud, Azure et AWS. Par conséquent, il utilise une syntaxe standardisée en `yaml`, ce qui est idéal pour les petits développeurs, car ils peuvent basculer entre « Les Trois Grands » avec peu d'effort.",
  "tl;dr": "résumé",
  "Install everything and then apply cert-manager. ez": "Installez tout, puis appliquez cert-manager. Facile.",
  "Install k3s": "Installer k3s",
  "As Hagen explains in [his article](https://blog.stonegarden.dev/articles/2024/02.D5EDD5BC9C49780444EF": "Comme Hagen l'explique dans [son article](https://blog.stonegarden.dev/articles/2024/02/bootstrapping-k3s-with-cilium/), nous voulons installer `k3s` sans configurations et avec tout désactivé. Il décrit en détail quels composants ne sont pas installés.",
  "After the installation, there should be some pods running (3). Don't be shocked .56BB9C3C1CCEDAFADEDB": "Après l'installation, quelques pods devraient être en cours d'exécution (3). Ne soyez pas choqués si les pods sont dans l'état `ContainerCreating` ou `Pending`. Cela est dû au fait que les pods ne peuvent pas communiquer entre eux parce que nous avons désactivé le CNI (`--flannel-backend=none`). Nous installerons plus tard [Cilium](https://github.com/cilium), qui remplacera le CNI Flannel.",
  "Install Helm": "Installer Helm",
  "Helm is the package manager for [Kubernetes](https://github.com/kubernetes), so .B3313537E64D4FFE6667": "Helm est le gestionnaire de packages pour [Kubernetes](https://github.com/kubernetes), vous pouvez soit l'installer directement (suivez la [documentation Helm](https://helm.sh/docs/intro/install/)), soit utiliser les composants d'Helm inclus avec Cilium. Nous avons choisi d'installer Helm directement, ce qui est facilement faisable avec cette commande :",
  "Install Cilium": "Installer Cilium",
  "[Cilium](https://github.com/cilium) is a networking and security software for Ku.F7DC9A96105A082EC9DB": "[Cilium](https://github.com/cilium) est un logiciel de mise en réseau et de sécurité pour Kubernetes. Cilium est très rapide, évolutif et sécurisé car il repose sur eBPF - une technologie révolutionnaire qui peut exécuter des programmes isolés dans le noyau Linux sans recompiler le noyau ou charger des modules noyau.",
  "We could install Cilium with Helm like shown here:": "Nous pourrions installer Cilium avec Helm comme indiqué ici :",
  "However, we wanted to install with their CLI and this is how you can do it. Firs.551EA48947BA4759E483": "Cependant, nous avons voulu l'installer avec leur CLI, et voici comment vous pouvez le faire. Tout d'abord, installez la CLI de Cilium en exécutant ce script :",
  "Then you can install Cilium with your Server IP-Address:": "Ensuite, vous pouvez installer Cilium avec l'adresse IP de votre serveur :",
  "Now we wait until Cilium says, everything is `OK` or `disabled`:": "Nous attendons maintenant que Cilium indique que tout est `OK` ou `disabled` :",
  "After a while, all pods should be `Running`.": "Au bout d'un moment, tous les pods devraient être en état `Running`.",
  "Last but not least, you can apply some resources for Cilium:": "Enfin, vous pouvez appliquer certaines ressources pour Cilium :",
  "Additionally you should upgrade the cilium config. In order to do that with the .B2C737654644F532072A": "De plus, vous devriez mettre à jour la configuration de Cilium. Pour cela, créez d'abord ce fichier dans le répertoire racine où vous souhaitez gérer le cluster k3s. Plus tard, vous pourrez également appliquer des propriétés liées à Hubble et Prometheus si vous souhaitez utiliser [Grafana](https://github.com/Grafana) ou un outil similaire (ouvrez les lignes repliées si vous souhaitez utiliser notre configuration également).",
  "Run this command to upgrade:": "Exécutez cette commande pour mettre à jour :",
  "Setup Certificate Manager with Cloudflare": "Configurer le gestionnaire de certificats avec Cloudflare",
  "In order to be able to create certificates for each subdomain, it is important t.412EB3BCACB9EA434592": "Pour pouvoir créer des certificats pour chaque sous-domaine, il est important d'appliquer un émetteur de certificats qui gère les demandes de certificats et les résout auprès d'un fournisseur. Nous avons choisi [Cloudflare](https://github.com/cloudflare) comme notre émetteur, et voici la configuration que vous devez appliquer à votre cluster Kubernetes. Pour plus d'informations, vous pouvez consulter la [documentation de cert-manager](https://cert-manager.io/docs/configuration/acme/dns01/cloudflare/).",
  "But first, we need to install the cert-manager by running the following command:.2C3AE967A1D1E33B0CFD": "Mais d'abord, nous devons installer le cert-manager en exécutant la commande suivante :",
  "You can apply a file to the [Kubernetes](https://github.com/kubernetes) cluster,.7C198D3247CB04A61DD9": "Vous pouvez appliquer un fichier au cluster [Kubernetes](https://github.com/kubernetes) en exécutant cette commande k8s (également k3s) :",
  "If you want to delete the resource in the Kubernetes cluster, the command is pre.13785BDE8535FD743BB9": "Si vous souhaitez supprimer la ressource dans le cluster Kubernetes, la commande est assez simple :",
  "As you may have spotted above, we also need a secret for the API token which aut.EED50E553247233483D4": "Comme vous l'avez peut-être remarqué ci-dessus, nous avons également besoin d'un secret pour le jeton API qui authentifie que ce générateur est autorisé à demander des certificats. Par conséquent, nous créons un secret avec un `API Token` non chiffré de Cloudflare.",
  "Nowadays we create a token by going to your [Cloudflare](https://github.com/clou.29311654A42391586C43": "De nos jours, nous créons un jeton en accédant à votre tableau de bord [Cloudflare](https://github.com/cloudflare), puis en cliquant sur votre profil et en sélectionnant l'onglet `API Tokens`. Ici, vous pouvez générer un jeton spécifique pour votre générateur ou utiliser la clé API globale (non recommandée). La solution recommandée est de créer un jeton API avec deux permissions (jeton personnalisé) :",
  "Zone - DNS - Edit": "Zone - DNS - Modifier",
  "Zone - Zone - Read": "Zone - Zone - Lecture",
  "![Cloudflare API Token](../../../assets/cloudflare/cloudflare_api_token.png)": "Jeton API Cloudflare",
  "A more detailed description about the tokens, can be found in the [Cloudflare do.1F2C806B3988F77EF2CC": "Une description plus détaillée des jetons peut être trouvée dans les [docs Cloudflare](https://developers.cloudflare.com/fundamentals/api/get-started/create-token/).",
  "After applying this secret to Kubernetes, the issuer should be ready to resolve .6908E4EC999AC0DCA147": "Après avoir appliqué ce secret à Kubernetes, le générateur devrait être prêt à résoudre quelques vilains problèmes !",
  "You can now use this issuer by applying this file which will hopefully create a .7987E8195B3DBB4AB6A9": "Vous pouvez maintenant utiliser ce générateur en appliquant ce fichier qui, espérons-le, créera un certificat :",
  "It usually takes around 90 seconds to authenticate the request once applied. You.523D684039CD86DF5B8E": "Cela prend généralement environ 90 secondes pour authentifier la demande une fois appliquée. Vous pouvez vérifier l'état actuel de la demande en exécutant cette commande kubernetes. Si cela prend plus de 2 minutes, peut-être que quelques astuces dans [#Dépannage](#no-cloudflare-certificate-approval) peuvent vous aider.",
  "The `-n` option stands for namespace.": "L'option `-n` signifie namespace.",
  "## Example app [`mutanuq`](https://mutanuq.trueberryless.org)": "Exemple d'application [`mutanuq`](https://mutanuq.trueberryless.org)",
  "Then you can use this certificate in your Ingress controller:": "Ensuite, vous pouvez utiliser ce certificat dans votre contrôleur Ingress :",
  "Setup Keel": "Configurer Keel",
  "We always wanted a clean Continuous Integration (CI) and Continuous Delivery (CD.5A7C877EE9C3CC7E2E7A": "Nous avons toujours voulu une solution propre d'Intégration Continue (CI) et de Livraison Continue (CD) pour nos sites web. Cela signifie qu'un message de commit spécifique devrait déclencher un processus automatisé via [GitHub](https://github.com/github), Docker Hub et notre serveur, qui, à la fin, met à jour le site web correspondant en environ deux minutes.",
  "Keel is a robust software tool which enables this feature for Kubernetes. We use.782AFBD621B2DB555C2D": "Keel est un outil logiciel robuste qui permet cette fonctionnalité pour Kubernetes. Nous avons utilisé Keel pour tirer de nouvelles images Docker de Docker Hub en interrogeant toutes les quelques minutes. De plus, Keel fournit un magnifique tableau de bord où vous pouvez contrôler l'interrogation également.",
  "In order to set up Keel with the admin dashboard, we created those files:": "Pour configurer Keel avec le tableau de bord d'administration, nous avons créé ces fichiers :",
  "`secret-dashboard.yaml` for the Admin Username and Password (not everyone should.BC266314D27DCB36F4CB": "`secret-dashboard.yaml` pour le nom d'utilisateur et le mot de passe administrateur (tout le monde ne devrait pas pouvoir accéder au tableau de bord)",
  "`keel.yaml` for the actual k3s configs (copied and adapted from [KeelHQ](https:/.F8A38C5FC9A4505AF62C": "`keel.yaml` pour les configurations réelles de k3s (copié et adapté de [KeelHQ](https://github.com/keel-hq/keel/blob/9f0a7160bbdc3a107ad148933a4269f30e4e479c/deployment/deployment-template.yaml))",
  "After applying both files and managing the additional certificate for `keel.true.30388E288EFFF1AD00F9": "Après avoir appliqué les deux fichiers et géré le certificat supplémentaire pour `keel.trueberryless.org`, le tableau de bord Keel fonctionne parfaitement. De plus, chaque `Deployment` Kubernetes peut opter pour un sondage Docker Hub automatisé en ajoutant quelques annotations :",
  "Celebrate with a Coffee!": "Célébrez avec un café !",
  "Congratulations, you've successfully set up [Kubernetes](https://github.com/kube.C26D3423275F0054D782": "Félicitations, vous avez réussi à configurer [Kubernetes](https://github.com/kubernetes) avec [Cilium](https://github.com/cilium) et [Cloudflare](https://github.com/cloudflare) ! Vous méritez une pause café. Profitez d'une tasse bien méritée, et si vous souhaitez partager un café virtuel avec moi, n'hésitez pas à soutenir mon travail sur [Ko-fi](https://ko-fi.com/trueberryless). Merci !",
  "Troubleshooting": "Dépannage",
  "Cilium-ingress has no External-IP": "Cilium-ingress n'a pas d'External-IP",
  "Make sure that the `ip-pool` includes the address specified by the annotations i.4E44377E5C9AC3845ED3": "Assurez-vous que le `ip-pool` inclut l'adresse spécifiée par les annotations dans le fichier `config.yaml`.",
  "Also in some cases, other ingress controllers get the annotated address before t.16FB14B27C64B47E0869": "Dans certains cas, d'autres contrôleurs d'entrée obtiennent l'adresse annotée avant que le contrôleur d'entrée de Cilium puisse y accéder, donc elle resterait en attente...",
  "If you don't deploy locally but on one of `The Big Three`, please check out some.4CF2A8E1AE1127E8E9D5": "Si vous ne déployez pas localement mais sur l'une des `Big Three`, veuillez consulter d'autres documentations sur les raisons pour lesquelles l'IP externe reste en attente. Il est principalement de leur responsabilité de vous fournir une adresse.",
  "No Cloudflare Certificate Approval": "Pas d'approbation de certificat Cloudflare",
  "There can be some problem when the certificate won't get approved by Cloudflare..21242D4E500A87FE26A2": "Il peut y avoir un problème lorsque le certificat ne reçoit pas l'approbation de Cloudflare.",
  "Wrong API token": "Jeton API incorrect",
  "First make sure that the Cloudflare API token is correct. To make 100 percent su.BE3E293E05F70A765669": "Tout d'abord, assurez-vous que le jeton API Cloudflare est correct. Pour être sûr à 100 %, créez-en un nouveau et insérez-le (non encodé en base64) dans ce fichier :",
  "Max auth failures reached": "Maximum d'échecs d'authentification atteint",
  "We once ran into the error `Error: 9109: Max auth failures reached, please check.661EAA2B42757CBB4C1D": "Nous avons rencontré une fois l'erreur `Error: 9109: Max auth failures reached, please check your Authorization header.`. Il suffit d'attendre quelques heures, de supprimer la ressource et de l'appliquer à nouveau :",
  "Hopefully, you're now good to go!": "Espérons que tout fonctionne maintenant !",
  "Setting up Continuous deployment in a GitHub repository": "Configurer le déploiement continu dans un dépôt GitHub",
  "Today we'll take a look at how to set up a GitHub repository which will be deplo.210AF277FD26683FD09E": "Aujourd'hui, nous allons voir comment configurer un dépôt GitHub qui sera déployé sur un cluster k3s via Argo CD.",
  "Today we'll take a look at how to set up a <a class=\"gh-badge\" href=\"https://git.A040D5A396CEA3FE8E47": "Aujourd'hui, nous allons voir comment configurer un <a class=\"gh-badge\" href=\"https://github.com/github\"><img src=\"https://github.com/github.png\" alt=\"github\" />GitHub</a> dépôt qui sera déployé sur un cluster k3s via Argo CD. En résumé, l'article inclura les fichiers Workflow, le Dockerfile, les manifestes (déploiement) et les dépôts <a class=\"gh-badge\" href=\"https://github.com/docker\"><img src=\"https://github.com/docker.png\" alt=\"Docker Hub\" />Docker Hub</a>. Veuillez consulter [notre blog Argo CD](./setup-argocd-for-kubernetes) car cet article sera une continuation d'un autre post.",
  "In today's post, we'll take a quick look at how to set up continuous deployment .837E00D0E73247CB97BC": "Dans le post d'aujourd'hui, nous allons examiner brièvement comment configurer un déploiement continu dans un dépôt [GitHub](https://github.com/github). Nous sommes assez sûrs que cette configuration fonctionne également pour d'autres registres Git, mais si vous en utilisez un autre, gardez à l'esprit que cet article est conçu uniquement pour GitHub.",
  "This post also assumes that you use [GitHub](https://github.com/github) Actions .5387D30E9AFCFCF33E71": "Ce post suppose également que vous utilisez [GitHub](https://github.com/github) Actions combiné avec Argo CD pour déployer vos applications sur un cluster Kubernetes. Suivez nos autres [articles sur le déploiement](/blog/tags/deployment) pour des instructions supplémentaires sur la façon de configurer ces deux technologies sur votre serveur personnel.",
  "Preparations": "Préparatifs",
  "We recommend creating a [Docker Hub](https://hub.docker.com/) account or choose .D653C06B296243188634": "Nous recommandons de créer un compte [Docker Hub](https://hub.docker.com/) ou de choisir un autre registre Docker si vous le souhaitez.",
  "Your GitHub repository must fulfil these conditions:": "Votre dépôt GitHub doit remplir ces conditions :",
  "Has a Dockerfile (ideally in the root folder)": "A un Dockerfile (idéalement dans le dossier racine)",
  "Has two GitHub Secrets ([create GitHub Secret](https://docs.github.com/en/action.5E18F567EA5B8452C4B3": "A deux Secrets GitHub ([créer un Secret GitHub](https://docs.github.com/en/actions/security-guides/using-secrets-in-github-actions#creating-secrets-for-a-repository)) :",
  "DOCKER_USERNAME: Your docker username": "DOCKER\\_USERNAME : Votre nom d'utilisateur Docker",
  "DOCKER\\_PASSWORD: Your docker password (or [access token](https://docs.docker.co.09AD66E199369AC9AC74": "DOCKER\\_PASSWORD : Votre mot de passe Docker (ou [jeton d'accès](https://docs.docker.com/security/for-developers/access-tokens/))",
  "Create workflow file(s)": "Créer un ou plusieurs fichiers de workflow",
  "GitHub Actions are special jobs in GitHub which mostly run on Linux servers and .E52CA8DEA2F2414C53E4": "Les GitHub Actions sont des tâches spécifiques sur GitHub qui fonctionnent principalement sur des serveurs Linux et peuvent être contrôlées en créant des fichiers `yaml` dans le répertoire `.github/workflows`. Ces fichiers particuliers permettent de définir les événements déclencheurs des tâches et offrent beaucoup de flexibilité. En tant qu'utilisateur régulier des GitHub Actions, je peux vous dire qu'il faut souvent réécrire vos fichiers `yaml` car les petits détails sont facilement négligés. Mais sans plus attendre, passons directement à la création d'un fichier `deployment.yaml` adapté, qui effectuera les tâches suivantes pour nous :",
  "Push a new docker image to Docker Hub (with the newest version).": "Pousser une nouvelle image Docker sur Docker Hub (avec la dernière version).",
  "Update the `manifest/deployment.yaml` file, so Argo CD gets notified about the n.745ACECEA48EBB0BD214": "Mettre à jour le fichier `manifest/deployment.yaml` pour qu'Argo CD soit informé de la nouvelle image taguée.",
  "(optional) Create a new release on GitHub, so the times of releases are document.5A45740CFC388A713228": "(optionnel) Créer une nouvelle release sur GitHub, afin que les temps de publication soient documentés où ils doivent l'être.",
  "Here you have an obsolete `docker-hub.yaml` which we used to use because it has .ACD068BBAB645A580B40": "Voici un fichier `docker-hub.yaml` obsolète que nous utilisions auparavant car il proposait de bonnes stratégies de versioning :",
  "After copying the contents of our `deployment.yaml` file and creating the new fi.BA0B84DE711F10368BA7": "Après avoir copié le contenu de notre fichier `deployment.yaml` et créé le nouveau fichier dans le dossier `.github/workflows`, vous devez effectuer quelques adaptations très **importantes** :",
  "Change the `IMAGE_NAME` to your personal Docker Hub repository. The image name c.70E854B465ED70C76952": "Modifiez le `IMAGE_NAME` pour qu'il corresponde à votre dépôt personnel sur Docker Hub. Le nom de l'image se compose de votre nom de compte et du nom du dépôt. Si vous n'êtes pas sûr de ce qu'est le nom de votre image, vous pouvez regarder l'URL du dépôt Docker Hub, il devrait y figurer quelque part.",
  "Now you should be good to go to add the keyword `deploy` into any commit message.BBFBDF3655BEA5A69ED1": "Maintenant, vous êtes prêt à ajouter le mot-clé `deploy` dans n'importe quel message de commit sur la branche principale de votre dépôt, et cela devrait automatiquement pousser une image Docker sur Docker Hub et mettre à jour le manifeste pour Argo CD.",
  "Congratulations, you've successfully set up Argo CD with k3s and [Cilium](https:.F5382A81A78FA5565691": "Félicitations, vous avez configuré Argo CD avec k3s et [Cilium](https://github.com/cilium) avec succès ! Vous méritez une pause café. Savourez une tasse bien méritée, et si vous souhaitez partager un café virtuel avec moi, n'hésitez pas à soutenir mon travail sur [Ko-fi](https://ko-fi.com/trueberryless). Merci !",
  "Setting up Argo CD in a k3s cluster": "Configuration d'Argo CD dans un cluster k3s",
  "Today we'll take a look at how to set up Argo CD in a k3s cluster.": "Aujourd'hui, nous allons examiner comment configurer Argo CD dans un cluster k3s.",
  "Continuing to improve our k3s cluster and especially the CI/CD workflow, we now .A2E0EE988FAFFFAD6A42": "Pour continuer à améliorer notre cluster k3s et surtout le flux de travail CI/CD, nous allons maintenant nous pencher sur l'outil GitOps appelé <a class=\"gh-badge\" href=\"https://github.com/argoproj\"><img src=\"https://github.com/argoproj.png\" alt=\"Argo CD\" />Argo CD</a>, et comment nous pouvons l'intégrer à notre cluster. Notre pile technologique pour le déploiement utilise ces services&#58; k3s, Helm, Cilium et après ce tutoriel, Argo CD également.",
  "Having read Vegard S. Hagen's article “[Argo CD Kustomize with Helm](https://blo.A0B58D0615DC386245A0": "Après avoir lu l'article de Vegard S. Hagen “[Argo CD Kustomize with Helm](https://blog.stonegarden.dev/articles/2023/09/argocd-kustomize-with-helm/)” et décidé que leur solution n'était pas adaptée à notre cluster, nous sommes directement passés au guide “[Getting started](https://argo-cd.readthedocs.io/en/stable/getting_started/)” par défaut d'Argo CD. Et maintenant, nous allons vous faire traverser les étapes de configuration d'[Argo CD](https://github.com/argoproj) sur [k3s](https://github.com/k3s-io) et [Cilium](https://github.com/cilium), en poursuivant à partir du chapitre “[Setup Certificate Manager with Cloudflare](/blog/setup-kubernetes-with-cilium-and-cloudflare#setup-certificate-manager-with-cloudflare)” de notre article précédent “[Setting up Kubernetes with Cilium and Cloudflare](/blog/setup-kubernetes-with-cilium-and-cloudflare)”. Dans ce même article récent, nous avons également configuré [Keel](https://github.com/keel-hq) à la fin, mais cette étape sera désormais inutile car nous utiliserons Argo CD pour obtenir le code le plus récent et le plus avancé à partir de chaque dépôt [GitHub](https://github.com/github). Bonne lecture !",
  "We assume that you followed [our other blog post](/blog/setup-kubernetes-with-ci.35443F83A3EBC402F568": "Nous supposons que vous avez suivi [notre autre article de blog](/blog/setup-kubernetes-with-cilium-and-cloudflare).",
  "Requirements": "Pré-requis",
  "Before we can start, we need to make sure we have `kubectl` installed, a kubecon.AF18D970264C891E62E6": "Avant de commencer, nous devons nous assurer que nous avons installé `kubectl`, un fichier kubeconfig (k3s enregistre ce fichier ici :",
  ") and CoreDNS (check if you have CoreDNS by running this": ") et CoreDNS (vérifiez si vous avez CoreDNS en exécutant cette commande :",
  "command).": "commande).",
  "Installation": "Installation",
  "First, let's apply all the necessary services, deployments and many other differ.3968A495D46DF328E51D": "Tout d'abord, appliquons tous les services nécessaires, les déploiements et de nombreuses autres ressources Kubernetes différentes en exécutant :",
  "Certificate": "Certificat",
  "Additionally, we'll need a certificate:": "De plus, nous aurons besoin d'un certificat :",
  "Apply this resource by running `kubectl apply -f certificate.yaml`.": "Appliquez cette ressource en exécutant `kubectl apply -f certificate.yaml`.",
  "Ingress Controller": "Contrôleur d'Ingress",
  "And we'll need a ingress controller which is managed by Cilium:": "Nous aurons également besoin d'un contrôleur d'Ingress géré par Cilium :",
  "Apply this resource by running `kubectl apply -f argocd-ingress.yaml`.": "Appliquez cette ressource en exécutant `kubectl apply -f argocd-ingress.yaml`.",
  "Deactivate TSL within Argo CD": "Désactiver TLS dans Argo CD",
  "With the certificate the connection between the client and server is secured. Ho.198C7766F41D2E4927DA": "Avec le certificat, la connexion entre le client et le serveur est sécurisée. Cependant, il existe toujours un certificat auto-signé au sein des services [Argo CD](https://github.com/argoproj), dont nous n'avons pas strictement besoin. Nous pouvons donc désactiver la sécurité du serveur Argo CD en modifiant la propriété `server.insecure`.",
  "In order to do that, we first run this command:": "Pour ce faire, exécutez d'abord cette commande :",
  "which will hopefully open a file in vim or neovim (otherwise would be cringe if .8B321BBC80D980EFA538": "ce qui ouvrira, espérons-le, un fichier dans vim ou neovim (sinon ce serait une honte si vous nous demandez, MDR). Le fichier devrait ressembler à ceci :",
  "The last two lines will probably be not there at first, but this is exactly the .00E15DF17F5D9A9B4B22": "Les deux dernières lignes ne seront probablement pas là au départ, mais c'est exactement le paramètre que nous voulons atteindre. Allez-y et ajoutez ces deux lignes (marquées ci-dessus) et enregistrez le fichier (`Esc` → `:wq` si vous êtes cool).",
  "Restart the Argo CD Server by running and waiting till the rollout is completed:.CDC77B3806BBA44885A8": "Redémarrez le serveur Argo CD en exécutant cette commande et en attendant que le déploiement soit terminé :",
  "After all those steps, we should now see the UI under [`https://argo-cd.trueberr.89BC34AD1ECDBC06B87E": "Après toutes ces étapes, nous devrions maintenant voir l'interface utilisateur sur [`https://argo-cd.trueberryless.org`](https://argo-cd.trueberryless.org) (protégé par mot de passe).",
  "![Argo CD UI Dashboard](../../../assets/argocd/argocd_ui_dashboard.png)": "Tableau de bord de l'interface utilisateur d'Argo CD",
  "The credentials of Argo CD UI consist of a user and a password. The user is alwa.BE74F043F4C1B4E5AB9E": "Les identifiants de connexion à l'interface utilisateur d'Argo CD se composent d'un utilisateur et d'un mot de passe. L'utilisateur est toujours `admin` et vous pouvez obtenir votre mot de passe en exécutant :",
  "Add manifest to repository": "Ajouter le manifest au dépôt",
  "Now in order to create a new application in [Argo CD](https://github.com/argopro.B153A0B7CA8710DB4FF2": "Pour créer une nouvelle application dans [Argo CD](https://github.com/argoproj) (via l'interface utilisateur ou l'interface CLI — nous utilisons l'interface utilisateur car nous n'avons pas configuré l'interface CLI), nous devons préparer le dépôt Git. Comme le dépôt est la seule source de vérité, c'est aussi l'endroit où nous définissons toutes les ressources Kubernetes qui devraient être créées par Argo CD.",
  "We recommend creating a new folder in the git repository called something like `.505C369206406EFB86A4": "Nous recommandons de créer un nouveau dossier dans le dépôt Git appelé quelque chose comme `manifest`. Dans ce dossier, nous allons créer quelques fichiers :",
  "`certificate.yaml`:": "`certificate.yaml` :",
  "`deployment.yaml`:": "`deployment.yaml` :",
  "`service.yaml`:": "`service.yaml` :",
  "`ingress.yaml`:": "`ingress.yaml` :",
  "These files are basically the exact same files mentioned in the [other post](/bl.A6639A930D5E316FA4EB": "Ces fichiers sont essentiellement les mêmes que ceux mentionnés dans [l'autre article](/blog/setup-kubernetes-with-cilium-and-cloudflare#example-app-mutanuq) mais séparés en quatre fichiers, car cela nous donne l'avantage de manipuler le manifest depuis [GitHub](https://github.com/github) Actions. Mais chaque chose en son temps, vous verrez comment configurer le manifest avec GitHub Actions dans le [prochain article](/blog/setup-continuous-integration-github-repository).",
  "Create new application in Argo CD UI": "Créer une nouvelle application dans l'interface utilisateur d'Argo CD",
  "You'll probably see the big `NEW APP` button in the UI of [Argo CD](https://gith.8C955D38A27D41B77691": "Vous verrez probablement le grand bouton `NEW APP` dans l'interface utilisateur d'[Argo CD](https://github.com/argoproj). Cliquez dessus et créez une nouvelle application avec les propriétés adaptées ci-dessous :",
  "Application Name: `mutanuq`": "Nom de l'application : `mutanuq`",
  "Project Name: `default`": "Nom du projet : `défaut`",
  "Sync Policy: Find out more in [this post](/blog/setup-continuous-integration-git.049A9447DEA81CE1B5DD": "Politique de synchronisation : En savoir plus dans [cet article](/blog/setup-continuous-integration-github-repository) / laissez `Manuel` pour l'instant",
  "Repository URL: `https://github.com/trueberryless-org/mutanuq`": "URL du dépôt : `https://github.com/trueberryless-org/mutanuq`",
  "Revision: `HEAD`": "Révision : `HEAD`",
  "Path: `manifest`": "Chemin : `manifest`",
  "Cluster URL: `https://kubernetes.default.svc`": "URL du cluster : `https://kubernetes.default.svc`",
  "Namespace: `mutanuq`": "Namespace : `mutanuq`",
  "Optionally — if you have [the CLI installed](https://argo-cd.readthedocs.io/en/s.4F9EF0A15884AE51DE02": "Optionnellement — si vous avez [le CLI installé](https://argo-cd.readthedocs.io/en/stable/cli_installation/) — vous pouvez exécuter cette commande pour obtenir le même résultat :",
  "Now you can hopefully see your website being deployed in the UI. This process ca.9A72C473303559E3BDC1": "Vous devriez maintenant voir votre site web en cours de déploiement dans l'interface utilisateur. Ce processus peut prendre un certain temps, car, par exemple, la demande de certificat doit être approuvée. Une application saine devrait ressembler à ceci :",
  "![Argo CD Example Application UI](../../../assets/argocd/argocd_example_applicat.DFA9617B17D15540EAA3": "Interface utilisateur d'exemple d'Argo CD",
  "Congratulations, you've successfully set up [Argo CD](https://github.com/argopro.99A2D6F9095CF50BC9D2": "Félicitations, vous avez configuré avec succès [Argo CD](https://github.com/argoproj) sur un cluster [k3s](https://github.com/k3s-io) ! Vous méritez une pause café. Savourez une tasse bien méritée et, si vous souhaitez partager un café virtuel avec moi, n'hésitez pas à soutenir mon travail sur [Ko-fi](https://ko-fi.com/trueberryless). Merci !",
  "Continuation": "Continuation",
  "Be continued for our [next blog](/blog/setup-continuous-integration-github-repos.C6E6C542B1FAA026061D": "La suite dans notre [prochain article de blog](/blog/setup-continuous-integration-github-repository), qui décrira comment configurer un dépôt [GitHub](https://github.com/github) pouvant ensuite être déployé via Argo CD.",
  "How to create a Rehype plugin that turns GitHub links into beautiful badges": "Comment créer un plugin Rehype qui transforme les liens GitHub en badges attrayants",
  "Learn how to build a simple yet delightful Rehype plugin that automatically tran.1DBFD32D56C53FC8C2C2": "Apprenez à construire un plugin Rehype simple mais captivant qui transforme automatiquement des liens de profil GitHub classiques en liens élégants en forme de badge avec des images de profil—parfait pour ajouter de la personnalité à votre blog ou à vos documents.",
  "Discover how a tiny Rehype plugin can give your GitHub links a big visual upgrad.95CD8D7DFB0C962AE484": "Découvrez comment un minuscule plugin Rehype peut donner à vos liens GitHub une mise à niveau visuelle majeure. Avec seulement quelques lignes de code, nous transformerons des liens de profil classiques en badges élégants avec avatars, inspirés par le site d'Antfu et propulsés par Astro + Starlight.",
  "Recently, I added a very little neat feature to this blog, which you might have .31ECBA06CD87D5CFEC39": "Récemment, j'ai ajouté une petite fonctionnalité sympa à ce blog, que vous avez peut-être remarquée en tant que lecteur régulier. Ce n'est rien de gigantesque, mais cela donne à chaque blog cette petite touche charmante que j'ai recherchée pendant longtemps. Je parle (ou plutôt j'écris) de tous ces badges verts avec des photos de profil que vous pouvez également voir dans ce blog.",
  "The inspiration to create them was taken from none other than [Antfu](https://gi.F44018DA56F114106E55": "L'inspiration pour les créer vient de nul autre qu'[Antfu](https://github.com/antfu) lui-même, puisqu'il affiche ces badges partout sur son site web (au moment de cette rédaction).",
  "Initially I thought they would require some long and tedious programming session.255FD9F39C231A32E556": "Au départ, je pensais qu'il faudrait une longue et fastidieuse session de programmation pour atteindre la même beauté visuelle. Cependant, après quelques sessions de Vibe Coding - comme [Andrej Karpathy a inventé le terme](https://x.com/karpathy/status/1886192184808149383) - j'ai rapidement réalisé que ces badges n'étaient qu'à un petit [plugin rehype](https://github.com/rehypejs) d'existence.",
  "This is the whole code behind the rehype plugin:": "Voici tout le code derrière le plugin rehype :",
  "Basically all this plugin does, is walking through the HTML, looking for links w.713A33AB7C816E7ADAF6": "En gros, tout ce que fait ce plugin, c'est parcourir le HTML à la recherche de liens qui font référence à un profil GitHub. Si l'un d'eux est trouvé, il ajoute une balise `<img>` avant le contenu texte avec la photo de profil de l'utilisateur ou de l'organisation GitHub. Cela est possible de manière très cohérente grâce à la fonctionnalité de GitHub qui permet d'obtenir la photo comme ressource derrière le lien du profil suivi de `.png`. Lisez-en plus à ce sujet dans [cet article génial sur `dev.to`](https://dev.to/10xlearner/how-to-get-the-profile-picture-of-a-github-account-1d82).",
  "With a little bit of additional styling it looks really cute in my opinion. Plea.3CF02F394DFC8ECF3E94": "Avec un peu de style supplémentaire, cela a un rendu vraiment mignon à mon avis. Veuillez noter que comme ceci est une page <StarlightBadgeLink />, j'utilise des variables CSS disponibles, comme dans la ligne quatre :",
  "Now to put everything together, let's say for example in an Astro site, you just.9BE9659FCADE76D6467F": "Pour tout assembler, disons, par exemple, dans un site Astro, vous devez simplement ajouter le plugin rehype à la configuration comme ceci :",
  "Read more about the injection of rehype plugins in Astro in [their configuration.D3124728AFCD14A1CEE8": "Lisez-en davantage sur l'injection des plugins rehype dans Astro dans [leur référence de configuration](https://docs.astro.build/en/reference/configuration-reference/#markdownrehypeplugins).",
  "Do not forget to add the CSS in a similar way depending on your framework - in S.8376354E6C8822949CB6": "N'oubliez pas d'ajouter le CSS de manière similaire, en fonction de votre framework - dans Starlight, vous pouvez configurer des styles CSS globaux personnalisés en suivant [ces instructions](https://docs.astro.build/en/guides/styling/#scoped-styles) - et vous pouvez également admirer vos propres liens en badge. N'hésitez pas à partager cet article avec toute personne que vous souhaitez convaincre d'utiliser ces fonctionnalités.",
  "✨ Bones point": "✨ Point bonus",
  "If you want to use such a badge for other links too, I recommend that you craft .E4245F963D0ACC5A33AD": "Si vous souhaitez utiliser un tel badge pour d'autres liens également, je vous recommande de créer un petit composant Astro comme celui-ci :",
  "Just make sure that the CSS is globally (or [scope](https://docs.astro.build/en/.4FF4BAAF51A54FE15B11": "Assurez-vous simplement que le CSS est global (ou [scopé](https://docs.astro.build/en/guides/styling/#scoped-styles) dans le composant ci-dessus) et il est prêt à être utilisé :",
  "Earworms and the message hidden within the pattern": "Les chansons obsédantes et le message caché dans le motif",
  "Some random thoughts about earworms and their message hidden within the pattern..9902F83DCFE33FCF2F42": "Quelques réflexions aléatoires sur les chansons obsédantes et leur message caché dans le motif.",
  "Yes, this title is a small nod to the excellent Netflix series \"Arcane\", but tha.13B50605E73E31D148F1": "Oui, ce titre est un petit clin d'œil à l'excellente série Netflix \"Arcane\", mais ce n'est pas le sujet de cet article.",
  "Today, I want to share some thoughts about earworms, a term that originated in G.6A8601A7B3560A913F2E": "Aujourd'hui, je souhaite partager quelques réflexions sur les chansons obsédantes, un terme qui trouve son origine en allemand (« Ohrwurm ») et qui a ensuite été adopté en anglais en tant que traduction littérale. Le sens derrière ce terme plutôt abstrait est la musique accrocheuse—*musique collante*, comme l'appelle Wikipédia. Ce phénomène se produit souvent de manière imprévisible, surtout lorsque nos pensées s'éloignent du moment présent.",
  "While many of my blog-post ideas strike on train rides, while lying in bed, or w.25AB9868BD26D2664DE1": "Bien que beaucoup de mes idées de blog se manifestent lors de trajets en train, en étant allongé au lit ou simplement en réfléchissant à la vie, l'inspiration pour cet article m'a littéralement frappé sous la douche, comme le prévoient les bonnes vieilles *pensées sous la douche*. La raison – comme vous avez peut-être deviné en lisant le sujet – était une chanson obsédante concernant une mélodie dont j'aurais juré ne pas avoir entendu parler depuis longtemps, disons 4 à 5 semaines.",
  "And this always seems to be the confusing parts about earworms: Nobody really kn.02E8F977B7963E92DD1D": "Et cela semble toujours être la partie déroutante des chansons obsédantes : personne ne sait vraiment qui décide du moment où elles apparaissent. Est-ce le cerveau qui appuie sur « lecture » lorsqu'il est légèrement engourdi ? Vous savez ce que je veux dire, ces moments où vous ne savez pas vraiment à quoi vous pensez en ce moment et où vous n'avez pas besoin de réfléchir à ce à quoi penser, vous profitez simplement du moment. Il existe une autre expression idiomatique autrichienne pour ce scénario exact : \"ins Narrenkastl schauen\", ce qui signifie quelque chose comme *regarder dans le vide*. Et je pense que c'est précisément ces moments d'absence mentale qui sont à l'origine et la raison pour laquelle ces chansons obsédantes surviennent.",
  "But this still leaves the question: Who decides what to play in someone's head w.869DDF0A56F11A495705": "Mais cela laisse toujours la question : qui décide de ce qu'il faut jouer dans la tête de quelqu'un lorsque cela se produit ? Qui est le DJ ? Selon mon expérience, j'ai remarqué un schéma récurrent, surtout si vous venez d'écouter de la musique dans la dernière demi-heure. Mon cerveau, au moins, aime répéter des morceaux de la **pénultième chanson** entendue, en d'autres termes la chanson qui a été jouée avant la dernière. Cette théorie fonctionne encore mieux si la dernière chanson a été mise en pause au milieu ou simplement pas exactement à la fin.",
  "The exact reason for that is completely unknown to me, but if I had to guess, I .A798D76B65D60FBFC400": "La raison exacte de cela m'est complètement inconnue, mais si je devais deviner, je dirais que les rythmes de la chanson terminée (la pénultième) résonnent encore quelque part dans votre esprit, puisque la chanson elle-même était peut-être de ces chansons du type « je-diminue-mon-volume-pour-mettre-fin-à-ma-durée », ce qui n'est pas mon type préféré de fin musicale, mais encourage le cerveau à continuer.",
  "At least that's what I think. I would be very interested if you have experienced.2A5110405B0386450071": "Du moins, c'est ce que je crois. Je serais très intéressé de savoir si vous avez vécu des schémas similaires, alors n'hésitez pas à écrire votre propre article de blog à ce sujet ou à simplement partager celui-ci avec des amis afin que vous puissiez en discuter avec eux !",
  "However, one thing that's objectively missing in my opinion is a granular way of.DBB9BD2B7C991AECF1AF": "Cependant, une chose qui manque objectivement à mon avis est une manière granulaire de séparer les sujets larges dans votre documentation. Et je ne suis pas seul avec cette opinion subjectivement acceptée de manière générale. [HiDeoo](https://github.com/HiDeoo) n'est pas seulement l'un des mainteneurs les plus actifs du projet, mais aussi l'auteur des plus nombreux, et selon moi, des meilleurs plugins que vous pouvez trouver pour Starlight. Et ils ont également remarqué cette fonctionnalité de niche manquante concernant les sujets. C’est pourquoi ils ont décidé de créer le plugin [Starlight Sidebar Topics](https://github.com/hideoo/starlight-sidebar-topics) dès le début, en octobre 2024, qui vous permet de créer une barre latérale avec des sujets. Lisez-en davantage sur les fonctionnalités du plugin dans [sa documentation](https://starlight-sidebar-topics.trueberryless.org/).\n",
  "Afterwards, follow the setup guides from [Starlight Sidebar Topics](https://star.D6EC61B940DA777E2BEB": "Ensuite, suivez les guides d'installation de [Starlight Sidebar Topics](https://starlight-sidebar-topics.trueberryless.org/docs/getting-started/#installation) et de [Starlight Sidebar Topics Dropdown](https://starlight-sidebar-topics-dropdown.trueberryless.org/docs/getting-started/#installation).",
  "Moreover, you could also create your own display component, which uses the route.7237A9BCDFBA80A2B459": "De plus, vous pourriez également créer votre propre composant d'affichage, qui utilise les données de route du plugin Starlight Sidebar Topics et rend les sujets de manière personnalisée. Cela est un peu plus avancé, mais vous pouvez trouver plus d'informations à ce sujet dans la documentation [\"Custom Topics List\"](https://starlight-sidebar-topics.trueberryless.org/docs/guides/custom-topic-list/).",
  "Stop Outsourcing Your Soul to AI": "Arrêtez d'externaliser votre âme à l'IA",
  "Reflections on AI overuse, its cognitive and social downsides, and a proposed mo.A89AED1EE3DE3D0BCC9B": "Réflexions sur la surutilisation de l'IA, ses effets négatifs cognitifs et sociaux, et un modèle proposé pour utiliser l'IA sans éroder la créativité et la communication humaines.",
  "It has been more than two and a half years since the release of ChatGPT. The 30<.25CE9B6E0E88F7C05662": "Cela fait plus de deux ans et demi depuis la sortie de ChatGPT. Le 30<sup>ème</sup> novembre 2022 a marqué le début d'une nouvelle ère. Le début de l'IA. De nos jours, de nombreuses professions et personnes dans leur vie privée, en particulier dans le secteur des technologies de l'information, l'utilisent quotidiennement. Et nous ne savons même pas où nous en sommes sur le cycle des attentes de Gartner ou si l'IA s'améliorera en suivant la \"Loi des rendements accélérés\" de Kurzweil.",
  "The trend is still rising, but at the same time I have noticed a slight but stea.4471FBD85DD8F244947F": "La tendance est toujours en hausse, mais en même temps, j'ai remarqué une légère mais constante dégradation des connaissances humaines, car les gens délèguent de plus en plus le travail créatif à l'IA. Par conséquent, j'ai décidé d'écrire un petit article de blog pour partager mes réflexions, en essayant de décourager la surutilisation de l'intelligence artificielle qui pourrait ruiner nos capacités cognitives. Et bien que je sache que très peu de personnes liront ceci, cela ne m'empêche pas d'essayer. Sinon, j'aurais peut-être raté mon occasion d'aider l'avenir de l'humanité.",
  "**Disclaimer**: This whole blog post is created from my observations of developm.6E39A6FC36B46BF133B0": "**Avertissement** : Ce billet de blog est entièrement basé sur mes observations concernant les évolutions des changements sociaux, avec une attention particulière aux façons d'utiliser l'intelligence artificielle selon mon interprétation, et est donc très subjectif. Je n'ai pas consulté d'études qui pourraient soutenir ou contredire mon opinion.",
  "How people tend to use AI": "Comment les gens ont tendance à utiliser l'IA",
  "AI is awesome. I do not want to question this statement. It helped and still hel.1B73784A0B66F1C26560": "L'IA est incroyable. Je ne veux pas remettre en question cette affirmation. Elle m'a aidé et m'aide encore à améliorer mon flux de travail, à acquérir de nouvelles connaissances, à explorer de nouveaux horizons et à découvrir de nouvelles technologies. Pour les personnes qui ne s'intéressent pas au fonctionnement de l'IA, de tels outils intelligents ressemblent à de la magie. En conséquence, j'aime voir leurs yeux briller et leurs bouches s'ouvrir lorsque je leur explique que tout ce sur quoi l'IA est basée, c'est la probabilité. Quel mot est le plus susceptible d'être le suivant, en fonction des propriétés et des émotions dans un espace virtuel hautement dimensionnel. [Mais c'est un autre sujet.](https://www.youtube.com/watch?v=LPZh9BOjkQs)",
  "What I would like to focus on is how people have come to use AI, especially over.0645ED8C57D4B143BECD": "Ce sur quoi je souhaite me concentrer, c'est sur la façon dont les gens ont fini par utiliser l'IA, en particulier au cours des derniers mois - voire des dernières années. Comme notre cerveau est paresseux par défaut, nous avons tendance à externaliser davantage de travail à l'IA au fur et à mesure que nous nous concentrons moins sur une tâche spécifique. En d'autres termes, si vous ne mettez pas la plupart de votre engagement dans votre projet actuel, vous êtes probablement sur le point de simplement le transmettre à une IA. Une autre raison potentielle de sous-traiter le travail au monde de l'IA est l'ignorance des technologies sous-jacentes, ce qui rend difficile pour vous de trouver vos propres solutions.",
  "I am by no means a scientist, but I think that watching AI doing your work - bec.9C73DF2EC8CE97A8882E": "Je ne suis en aucun cas un scientifique, mais je pense que regarder une IA faire votre travail - parce que, en raison de votre incompétence, le résultat que vous produisez ne correspond pas à votre vision - vous donne tellement de dopamine que votre cerveau veut le faire plus souvent. De plus, l'être humain, en tant que figure sociale, cherche toujours à être connecté à quelqu'un, et interagir avec l'IA satisfait ces besoins. Ce comportement est typique de notre cerveau et se produit également lorsque nous regardons les réseaux sociaux ou consommons du contenu explicite. Il est profondément enraciné dans notre cortex cérébral, et toute l'industrie du jeu et les secteurs du divertissement en profitent sans scrupules pour optimiser leurs gains.",
  "I noticed this trend myself, as you can clearly see from [some of my posts where.6F67065684689D74728B": "J'ai moi-même remarqué cette tendance, comme vous pouvez le voir clairement dans [certains de mes articles où j'ai avoué avoir utilisé l'IA](/blog/authors/artificial-intelligence/) pour m'aider à les écrire. Mais je pense que ce n'est pas une honte. Tout créateur de contenu qui utilise l'IA devrait expérimenter de première main les écueils de la création de contenu directement pour le spectateur ou le lecteur, afin de réaliser à quel point il sait peu sur le sujet par la suite. Cela lui permettra d'apprendre de son erreur et d'être conscient de la facilité avec laquelle la paresse peut vous entraîner dans un chemin si méprisable. Seuls les excellents parmi nous se sont toujours efforcés de créer du contenu fait main.",
  "Negative side effects": "Effets négatifs",
  "I pointed out the main drawbacks of using AI too extensively that I observed. I .5A4212FD0B6A0413D8EA": "J'ai souligné les principaux inconvénients que j'ai observés dans une utilisation excessive de l'IA. Je vais maintenant vous donner deux raisons secondaires que j'ai remarquées chez moi, pour lesquelles vous ne devriez pas utiliser l'IA pour un travail expressif.",
  "Communication decline": "Déclin de la communication",
  "While watching a promotion video from \"The Browser Company™\" (see the last link .72C7B7D43BFCB10D0126": "En regardant une vidéo promotionnelle de \"The Browser Company™\" (voir le dernier lien dans la [section des ressources ci-dessous](#resources-with-better-evidence)), j'ai remarqué que les visions peuvent être très éloignées de nos jours. Je constate cette tendance non seulement dans le navigateur Dia, mais dans de nombreux aspects différents de la technologie et de nos vies. Un côté de la tendance veut intégrer l'IA partout où c'est possible, élargissant notre dépendance à celle-ci. Un exemple est l'utilisation de l'IA pour composer et écrire des messages à nos amis proches et collègues parce que cela nous rend plus efficaces. Je crois que cela nous rend juste stupides à long terme.",
  "If people do not train their brains for coming up with words for communication, .0E50F4E2AEC63CCFA8CD": "Si les gens ne forment pas leur cerveau à trouver des mots pour communiquer, à construire des phrases utiles et un sens pouvant être compris par d'autres êtres humains, notre fondation même de l'interaction les uns avec les autres est brisée et nous reviendrions au niveau de *Homo habilis* - la dernière espèce qui, probablement, n'a pas utilisé un langage verbal pleinement développé. Voyez, j'ai utilisé l'IA pour m'aider à rechercher ce petit bout d'information, mais j'ai choisi mes mots consciemment pour m'exprimer. De cette façon, non seulement j'ai appris quelque chose de nouveau, mais je peux maintenant également m'en souvenir. Une capacité que vous n'aurez jamais en externalisant l'écriture à l'IA.",
  "Loneliness": "Solitude",
  "Being alone on a mental level is in my opinion one of the most underrated modern.DF4685B2DE4270080DF1": "Être seul sur un plan mental est, à mon avis, l'un des dangers modernes les plus sous-estimés de la société. Le côté ironique de cela, c'est que si tout le monde est seul, nous avons tous cela en commun, ce qui fait que nous ne sommes pas seuls avec la solitude de chacun. Mais mes pensées dérivent à nouveau vers d'autres océans.",
  "AI strongly encourages us to be alone. It ~~acts~~ was intentionally trained to .CBE7FABA8A468DBE0C14": "L'IA nous encourage fortement à être seuls. Elle ~~agit~~ a été intentionnellement entraînée à agir comme un parfait ami, collègue ou quel que soit le terme que vous voulez employer. Récemment, j'ai remarqué que les réponses de ChatGPT incluent explicitement mon nom, ce qui est très étrange à plusieurs niveaux si vous voulez mon avis. On pourrait dire qu'il s'agit d'un doxxing artificiel privé, ce qui, bien sûr, est un oxymore en soi, car le doxxing, par définition, est public. Néanmoins, plus vous utilisez l'IA, plus *souvent* vous voulez utiliser l'IA. En particulier après l'introduction des modes vocaux de l'IA, cette tendance a continué à augmenter comme si le lendemain n'existait pas. Félicitations, ClosedAI, vous venez de réinventer l'addiction.",
  "In worst case scenarios, this can leads people to fear talking with other people.DE0F55D85004B91A5977": "Dans les pires scénarios, cela peut amener les gens à craindre de parler avec d'autres personnes. À abandonner des amitiés. À se retirer de la société. De telles habitudes sont des problèmes graves et devraient être examinées par un médecin ou un psychologue.",
  "Proposal of AI usage layer model": "Proposition de modèle de couche d'utilisation de l'IA",
  "Proposing a global solution for all people of such a problem is impossible. Sinc.10DA331D742128D1E376": "Proposer une solution globale pour tous face à un tel problème est impossible. Puisque chaque individu a ses propres expériences avec l'IA, ses propres pensées et sentiments, qu'il soit optimiste ou pessimiste, je ne peux pas parler pour tout le monde. En fait, je pense que je peux seulement parler pour moi-même, apprendre et partager mes propres façons de gérer et de limiter mon utilisation de l'IA, et espérer que ces expériences puissent également vous aider.",
  "My ideal experiences with AI - the optimal golden way between the overuse of AI .7279A13F58BE82D3A45D": "Mes expériences idéales avec l'IA - le juste milieu optimal entre la surutilisation de l'IA accompagnée de l'érosion cognitive et le fait de laisser la mode passer à côté de vous sans en tirer aucun avantage - consistent à utiliser l'IA [si et seulement si](https://en.wikipedia.org/wiki/If_and_only_if) vous, et seulement vous, en tirez des avantages. En d'autres termes, contrôlez votre utilisation et limitez-la de manière extrême, où seul vous-même devriez jamais entrer en contact avec le contenu produit par l'IA. Une telle limitation a de nombreuses conséquences, voici quelques exemples pour mieux illustrer et souligner ce que je veux dire :",
  "Use AI for personal learning sessions: If you initially want to dive into a new,.DE3EFB49A432DEF98DFD": "Utilisez l'IA pour des sessions d'apprentissage personnelles : Si vous souhaitez initialement plonger dans un nouveau sujet complètement inconnu, l'IA peut vous donner des aperçus généraux et vous montrer des connexions avec d'autres parties du savoir et des usages dans le monde réel. Bien que cela ne signifie pas nécessairement que vous apprendrez plus vite ou plus efficacement, cela aide à faire le premier pas et à se lancer.",
  "Use AI for stupid and repetitive workloads and ask for help if you are certain t.ABC71EA43B6FE421530F": "Utilisez l'IA pour des tâches stupides et répétitives et demandez de l'aide si vous êtes certain que le problème ou la tâche a déjà été résolu des milliers de fois par d'autres. Les modèles linguistiques actuels sont formés sur des données existantes, ce qui signifie qu'ils sont censés être performants pour résoudre des problèmes déjà résolus, non pas pour réinventer la roue, mais pour suggérer d'utiliser l'instrument rond existant.",
  "Do not use AI to express yourself to other people. Think about what meaning you .68CA5EC714F05E5EC131": "N'utilisez pas l'IA pour vous exprimer auprès des autres. Réfléchissez à ce que vous voulez transmettre, aux connaissances que vous souhaitez partager et exprimez vos pensées avec vos propres mots. Cela vous aide énormément à renforcer vos idées, à mieux vous souvenir de ce que vous avez appris et à vous sentir beaucoup mieux.",
  "Do not use AI to generate complex and creative work. Nowadays, there are hundred.572F9E5BBC126B708CF7": "N'utilisez pas l'IA pour générer des travaux complexes et créatifs. De nos jours, il existe des centaines - probablement des milliers - d'outils qui vous aident à créer de l'art, de la musique, du code, des designs, des plans, etc., grâce à l'IA ou entièrement avec elle. Bien que cela puisse donner l'impression que vous êtes plus productif, cela vous rend simplement plus ignorant à mesure que vous revenez souvent à ces méthodes, au lieu de faire ce que vous aimez par vous-même. Il est tout à fait acceptable de dire que des petites parties du travail peuvent être externalisées à l'IA, principalement des tâches répétitives qui prennent seulement plus de temps à faire manuellement. Les œuvres créatives et originales, cependant, devraient rester humaines et réalisées avec amour. Si vous n'aimez pas ce que vous faites du tout, cela peut être un signal qu'il serait peut-être temps d'arrêter entièrement cette activité.",
  "Do not fall for all the shiny AI stuff out there. Tools like [Lovable](https://l.730DE3F722D5456EC235": "Ne vous laissez pas séduire par tout le battage autour des outils d'IA. Des outils comme [Lovable](https://lovable.dev), [GitHub Copilot](https://github.com/features/copilot), [Cursor](https://cursor.com/en), [ChatGPT Voice](https://openai.com/index/chatgpt-can-now-see-hear-and-speak/) et le nouveau venu : [GPT-5](https://academy.openai.com/public/resources/intro-gpt-5), pour n'en citer que quelques-uns, ne cherchent pas vraiment à vous aider. Ils veulent soit vos données directement, soit contrôler votre flux de travail afin que vous ne puissiez plus y échapper une fois habitué à leur utilisation. Malheureusement, les gens s'habituent à l'IA de manière fascinante et rapide.",
  "In short, what I mean is that AI should be used for brainstorming and helping ea.7E4914372E95A248FB12": "En bref, ce que je veux dire, c'est que l'IA devrait être utilisée pour réfléchir et aider chaque individu à créer un produit final - à ne pas confondre avec l'IA créant le produit final -, mais pas pour communiquer avec d'autres personnes ni pour les résultats finaux eux-mêmes (par exemple, la création d'images, l'écriture de blogs, les publications sur les réseaux sociaux, la communication dans les chats, les discours de motivation, les essais, etc.). À mon avis, le cerveau humain ne peut évoluer et apprendre que par ses propres erreurs et expériences. Et vous ne pouvez jamais apprendre de vos erreurs lorsqu'elles ont en réalité été générées par l'IA.",
  "AI has a place in ideation, but expressive work should remain human.": "L'IA a sa place dans l'idéation, mais le travail expressif devrait rester humain.",
  "The Paradigm": "Le Paradigme",
  "I recently discovered a software design pattern called the \"Onion Architecture\"..1A7DACE78A504AB231FA": "J'ai récemment découvert un modèle de conception de logiciels appelé \"Onion Architecture\" (architecture en couches). Pour faire simple, le principe clé de cette architecture est sa division en couches, où chaque couche n'est connectée qu'à ses deux voisines (les couches parentes et enfants, mais pas les sœurs).",
  "To transfer this paradigm into the current context, you can imagine the AI as a .5C827B59D0E80CEDD730": "Pour transposer ce paradigme dans le contexte actuel, vous pouvez imaginer l'IA comme un outil mis à votre disposition, qui est déconnecté de toutes les autres parties en étant uniquement entouré par votre cerveau. Seul votre cerveau peut accéder, manipuler, créer et modifier les couches extérieures - dans cet exemple, écrire des blogs, créer du contenu, communiquer avec les gens via des chats ou des discours, ou vous exprimer avec de l'art ou des designs.",
  "Here you can see an image that represents my idea of a limited, but ideal usage .FC6C0DF5BEEB877D3C9A": "Voici une image qui représente mon idée d'un usage limité mais idéal de l'IA :",
  "![Cognitive Erosion Paradigm: Layered, green circles with \"AI\" in the centre, su.960BB2813D5D36A6E62A": "Paradigme d'Érosion Cognitive : Cercles concentriques verts, avec \"IA\" au centre, entourés par le \"Cerveau\", lui-même entouré par plusieurs segments circulaires étiquetés \"Design\", \"Blog\", \"Chats\", \"Art\", \"Contenu\" et \"Discours\" dans le sens des aiguilles d'une montre.",
  "If such an architectural approach and the paradigm in this context are optimal o.F0EEC9F2B664B2C7C023": "Si une approche architecturale comme celle-ci et le paradigme dans ce contexte sont optimaux ou juste subjectifs, cela peut être critiqué dans les commentaires ci-dessous.",
  "As I said in the beginning, this blog post is very opinionated and aims to just .944F71E911107ACEF8FC": "Comme je l'ai dit au début, ce billet de blog est très subjectif et vise simplement à partager mon expérience avec tout le monde, afin que vous puissiez également apprendre de mes erreurs, optimiser votre propre utilisation de l'IA et mieux la contrôler. En fin de compte, vous pouvez faire ce que vous voulez, mais soyez conscient(e) de la dégradation de votre cerveau lorsque vous tombez dans le piège d'une surutilisation.",
  "Also one thing to note: It took me several months to write this blog post, refin.DCE5417F165917B5411C": "Une chose à noter également : Il m'a fallu plusieurs mois pour écrire cet article, le peaufiner et parfois repartir de zéro. Aucun blog n'est parfait, comme vous l'avez sans doute remarqué avec celui-ci. Il y a probablement quelques erreurs grammaticales ici et là, des phrases qui, en réalité, ne font pas sens, mais cela fait partie de l'humanité. De plus, il y a très probablement beaucoup d'opinions fortes dans ce billet où vous seriez totalement contre et en désaccord complet avec moi (j'ai hâte de lire vos commentaires exprimant votre indignation), mais cela me rend unique. Mon cerveau, mes pensées, mon opinion.",
  "\"errare humanum est\"": "\"errare humanum est\"",
  "Resources with better evidence": "Ressources avec de meilleures preuves",
  "If you are interested in articles which are based on more scientific studies or .951C297E7674ED83CB82": "Si vous êtes intéressé(e) par des articles basés sur des études ou approches plus scientifiques, n'hésitez pas à en lire quelques-uns ou tous. Ils ne sont pas classés dans un ordre particulier, alors commencez au milieu et progressez vers le haut ou vers le bas. 😊",
  "AI coding tools make developers slower but they think they're faster, study find.7985A3C197B7C985AEA3": "Les outils de codage IA rendent les développeurs plus lents même s'ils pensent être plus rapides, selon une étude",
  "Companies That Tried to Save Money With AI Are Now Spending a Fortune Hiring Peo.AFFFD5071F8FB5C78BE9": "Les entreprises qui ont essayé de faire des économies avec l'IA dépensent désormais une fortune pour réparer ses erreurs",
  "Linus Torvalds reckons AI is ‘90% marketing and 10% reality’": "Linus Torvalds estime que l'IA est '90 % marketing et 10 % réalité'",
  "The AI Girlfriend situation is SAD (YouTube.com)": "La situation des \"petites amies IA\" est TRISTE (YouTube.com)",
  "Will AI make you stupid?": "L'IA va-t-elle vous rendre stupide ?",
  "AI isn't making us more productive. It's making us cognitively bankrupt. (X.com).D1B0FEDE875E93283AD0": "L'IA ne nous rend pas plus productifs. Elle nous rend cognitivement ruinés. (X.com)",
  "Being Addicted To Generative AI": "Être accro à l'intelligence artificielle générative",
  "Yet Another Study Finds That AI Is Making Us Dumb": "Encore une autre étude montre que l'IA nous rend stupides",
  "Is AI making us smarter Or dumber?… Or artificially smarter? (AI symbiotic crisi.3143888590C5284B32CA": "L'IA nous rend-elle plus intelligents, plus stupides... ou artificiellement plus intelligents ? (crise symbiotique IA)",
  "The most powerful ways to \"hack\" our new Dia browser (YouTube.com)": "Les moyens les plus puissants de \"hacker\" notre nouveau navigateur Dia (YouTube.com)",
  "Happy reading!": "Bonne lecture !",
  "Accelerating translations with continuous integration": "Accélérer les traductions avec l'intégration continue",
  "The story of how my journey of contributions to action-continuous-translation st.539B68E34D18B54F07FE": "L'histoire de la façon dont mon parcours de contributions à action-continuous-translation a commencé.",
  "<p>I have been working in OSS on <a class=\"gh-badge\" href=\"https://github.com/gi.8F9A527414094F26EF41": "<p>Je travaille dans les communautés de logiciels libres (<span lang=\"en\">OSS</span>) sur <a class=\"gh-badge\" href=\"https://github.com/github\"><img src=\"https://github.com/github.png\" alt=\"github\" />GitHub</a> depuis plus d'un an maintenant et, bien que je pensais avoir trouvé tout ce à quoi je voulais contribuer, j'ai récemment découvert le projet personnel de <a class=\"gh-badge\" href=\"https://github.com/pelikhan\"><img src=\"https://github.com/pelikhan.png\" alt=\"pelikhan\" />Peli</a>, <a href=\"https://github.com/pelikhan/action-continuous-translation\">action-continuous-translation</a>. Je suis très heureux d'avoir commencé à y apporter des contributions régulières et de faire désormais partie de cette petite communauté.</p>",
  "For the last year, I have been working a lot in various Open Source Communities .D0EE1E8417F371E1353F": "Au cours de l'année passée, j'ai beaucoup travaillé dans diverses communautés de logiciels libres sur GitHub pendant mon temps libre et j'ai apprécié ces contributions, qui sont en quelque sorte relaxantes, car elles me permettent d'acquérir de nouvelles connaissances quotidiennement.",
  "After some time contributing I also got to know how kind and welcoming communiti.6B14A5E726DED7FDE5C1": "Après un certain temps de contribution, j'ai également appris à quel point les communautés derrière ces projets sont bienveillantes et accueillantes. Ces personnes ont toutes une chose en commun avec vous : elles veulent créer de grandes choses pendant leurs loisirs. Surtout, la communauté [Astro](https://github.com/withastro) est celle dans laquelle j'ai pris le plus de plaisir à être, car elle est à la fois la plus gratifiante et la plus conviviale. Toutes les communautés n'arrivent pas à atteindre un tel statut parmi les projets OSS.",
  "Recently, I discovered another evolving project founded by [pelikhan](https://gi.90E9DCA5FB8FA470B7FE": "Récemment, j'ai découvert un autre projet en évolution fondé par [pelikhan](https://github.com/pelikhan), qui vise à traduire automatiquement toute votre documentation, vos blogs ou vos sites marchands chaque fois qu'un changement survient grâce à l'aide de l'IA. Bien qu'un peu sceptique au début, la lecture approfondie du README.md de ce projet m'a captivé.",
  "The approach of strictly guiding AI into only translating little chunks - mostly.EFA08DBC1CAAB5CE6D3C": "L'approche consistant à guider strictement l'IA pour ne traduire que de petits morceaux - principalement des phrases ou des paragraphes avec des instructions perfectionnistes - m'a fait penser que cela pourrait vraiment fonctionner. J'ai donc essayé cela sur mon propre projet, mon blog. Et à ma grande surprise, ces traductions étaient bien meilleures que ce que j'avais imaginé. Bien sûr, on remarque que cela a été traduit par l'IA - le travail fait main ne sera, espérons-le, jamais entièrement remplacé - mais si vous mentionnez honnêtement que vous utilisez l'IA dans une note en marge, cela rend le contenu bien plus accessible aux gens que l'absence de traduction.",
  "So I took a closer look at the actual code of the project. After noticing some l.04C2097BA41406300A39": "J'ai donc examiné de plus près le code réel du projet. Après avoir remarqué quelques petites incohérences, des espaces pour des améliorations, et des fonctionnalités manquantes mais très intéressantes ici et là, j'ai commencé à y contribuer également. Après tout, avec un an de contributions dans de plus grands projets, les <span lang=\"en\">PRs</span> n'étaient pas une nouveauté pour moi.",
  "You have to know that this was a Friday evening - almost night in my timezone - .F07D43687D090B7997ED": "Il faut savoir que c'était un vendredi soir - presque nuit dans mon fuseau horaire - et que [Peli](https://github.com/pelikhan) était également en ligne, enchaînant les commits sur le projet. J'ai rapidement remarqué qu'à l'inverse des autres projets auxquels je participe, Peli ne perdait pas de temps à fusionner les <span lang=\"en\">PRs</span>. Ce fut très gratifiant ce soir-là car je n'ai cessé de contribuer jusqu'à une heure du matin, Peli fusionnant plus vite que je ne pouvais améliorer les fonctionnalités, les documents et les corrections. Un autre aspect qui a été génial est que, puisque c'était un jeune projet, Peli n'a pas hésité à simplement fusionner, tester localement, puis pousser de petites corrections que j'avais manquées.",
  "Fast-forward three days and I am now an official contributor to the project, mak.3479DA18B6C4E8D9A8EE": "Trois jours plus tard, me voici maintenant contributeur officiel du projet, le rendant chaque jour meilleur, principalement en me concentrant sur la documentation et le support pour mon projet de cœur : Starlight - comme vous l'avez peut-être déjà deviné à partir de [mes blogs](/blog/tags/starlight/).",
  "Peli and I have our virtual productivity sessions between 4pm and 8pm UTC, exten.51E309B378285EAEEA84": "Peli et moi organisons nos sessions de productivité virtuelles entre 16 h et 20 h UTC, avec des extensions pendant les week-ends. Donc, si vous souhaitez nous rejoindre en tant que pionnier du projet ou si cela a suscité votre intérêt pour l'utiliser, n'hésitez pas à le consulter sur [GitHub](https://github.com/github) : [https://github.com/pelikhan/action-continuous-translation](https://github.com/pelikhan/action-continuous-translation)",
  "Designing a No-Account, No-Database Approach to Time Tracking": "Concevoir une approche de suivi du temps sans compte et sans base de données",
  "A private time-tracking app storing all data in your browser — no accounts, no d.F138A1009E69F5985E79": "Une application de suivi du temps privée stockant toutes les données dans votre navigateur — pas de comptes, pas de base de données, juste un suivi simple.",
  "True Tracker is a minimalist time-tracking app built with Next.js that keeps all.83D3C3B8B44C4975D8DD": "True Tracker est une application minimaliste de suivi du temps construite avec Next.js qui garde toutes les données dans votre navigateur — pas de comptes, pas de base de données, juste une confidentialité et une simplicité totales.",
  "The summer of 2024 marked the start of an exciting new chapter for me as a devel.4693500D69418D01C04B": "L'été 2024 a marqué le début d'un nouveau chapitre passionnant pour moi en tant que développeur. Jusqu'à ce moment-là, j'avais principalement travaillé avec Angular, un framework que j'appréciais pour son approche structurée et opinée. Mais j'ai toujours été curieux de découvrir React : cela semblait plus léger, plus flexible, et juste… différent. Lorsque je suis tombé sur Next.js, un framework de [Vercel](https://github.com/vercel) basé sur React qui offrait des fonctionnalités comme le rendu côté serveur et un accent mis sur les performances, j'ai su qu'il était temps d'explorer quelque chose de nouveau.",
  "At the same time, I'd been frustrated for ages with session tracking tools like .03C6C9A3C18CFB3FDCD1": "En même temps, j'étais frustré depuis des années par les outils de suivi de sessions comme Toggl. Bien qu'ils soient théoriquement excellents, leurs meilleures fonctionnalités semblaient toujours enfermées derrière des paywalls premium. Comme tout développeur à un moment donné, je me suis dit, *« Pourquoi ne pas simplement créer le mien ? »* C'est pratiquement un rite de passage — chaque programmeur doit au moins une fois dans sa carrière créer une application de tâches ou un tracker. Et ainsi, True Tracker est né.",
  "True Tracker wouldn't just be any tracker, though. I wanted to do something diff.A78A97DDBF776E5A3623": "True Tracker n'était pas un tracker comme les autres, cependant. Je voulais faire quelque chose de différent. Pour commencer, je voulais le garder simple : les utilisateurs pouvaient ajouter des projets, les diviser en tâches, et suivre leur temps en sessions. Aucun surplus, aucune fonctionnalité inutile. Mais voici la particularité — True Tracker enregistrerait tout dans le stockage local. Pas de comptes, pas de synchronisation avec le cloud, et surtout, personne (même pas moi) n'aurait accès à vos données. C'est votre tracker, et vos données restent les vôtres.",
  "Of course, transitioning from Angular to Next.js wasn't without its challenges. .42B63477ABA3012B4AFB": "Bien sûr, passer d'Angular à Next.js n'a pas été sans défis. Si je devais donner un seul conseil à quiconque apprend un nouveau framework, ce serait celui-ci : *Lisez la documentation.* Sérieusement, ne la sautez pas. Je ne l'ai pas fait, et cela a conduit au chaos. Next.js était récemment passé au routeur d'application, mais je m'étais obstinément lancé dans la construction avec le routeur de pages. Il s'avère que cela a causé une montagne de problèmes lorsque l'application ne voulait pas se construire correctement parce qu'il n'y avait pas de répertoire `app`. J'ai dû garder un fichier `.gitkeep` vide dans le dossier pour que Git ne le supprime pas et ne casse rien à nouveau. Pas mon moment de gloire.",
  "After two weeks of nonstop coding, debugging, and running into what felt like ev.6C07E411C9E65C40E90F": "Après deux semaines de codage intensif, de débogage, et d'affrontement avec ce qui semblait être toutes les erreurs imaginables, True Tracker a enfin fonctionné. Je me souviens de cette première exécution réussie — j'avais l'impression de crier *« C'est vivant ! »* dans ma tête.",
  "The project also wasn't without its jokes. A friend, after seeing the app's bran.4E6FB3382F951646087C": "Le projet n'était pas non plus sans ses blagues. Un ami, après avoir vu le branding de l'application, a plaisanté : « Donc... le \"true\" dans True Tracker ? C'est un peu exagéré, même pour l'image. C'est *trop de vérité !* » Ils n'avaient pas tort, mais je l'ai assumé. Après tout, si vous allez marquer quelque chose, autant y aller à fond.",
  "True Tracker became my first-ever Next.js project—a simple but unique app for tr.252C96FD81AA9227820E": "True Tracker est devenu mon tout premier projet Next.js — une application simple mais unique pour suivre le temps sans aucune contrainte. Elle est maintenant en ligne à l'adresse [https://true-tracker.trueberryless.org](https://true-tracker.trueberryless.org/).",
  "The journey taught me more than just how to use Next.js. It taught me about push.4577627813AA93D48F0F": "Le voyage m'a appris plus que simplement comment utiliser Next.js. Il m'a appris à surmonter les défis, à passer d'un framework à un autre, et à embrasser les particularités qui rendent chaque projet unique. True Tracker n'est pas juste une application ; c'est une étape importante — une petite preuve que même les petites idées peuvent avoir un grand impact.",
  "Designing a Kafka-Based Pipeline and Interactive Graph for Energy Anomaly Detect.6E40C602D9518B54F990": "Conception d’un pipeline basé sur Kafka et d’un graphique interactif pour la détection des anomalies énergétiques",
  "A SOA solution with Siemens AG to analyze power grid anomalies, featuring a Kafk.7FC6E382F6C39EFB4296": "Une solution SOA avec Siemens AG pour analyser les anomalies du réseau électrique, comprenant un pipeline Kafka, PostgreSQL, une API GraphQL et un tableau de bord Angular pour la visualisation.",
  "For our diploma thesis with Siemens AG, we built a service-oriented solution to .E03A3AD551F1B141D274": "Dans le cadre de notre thèse avec Siemens AG, nous avons développé une solution orientée services pour détecter les anomalies du réseau électrique — comprenant un pipeline Kafka, PostgreSQL, une API GraphQL et un tableau de bord Angular avec des tableaux et un graphique interactif pour une visualisation en temps réel.",
  "During my fifth year at HTL Krems (2023/24), every student was required to compl.33C68E23474119532BF0": "Au cours de ma cinquième année à la HTL Krems (2023/24), chaque étudiant devait réaliser une thèse de diplôme — un projet d’envergure divisé en deux parties principales : théorique et pratique. Travaillant en binôme, nous devions produire un document théorique d’environ 100 pages dans lequel nous présentions, analysions et expliquions notre sujet choisi.",
  "The theoretical part was organized into three sections. The first involved gathe.383BAC1FDBC3A2145A6D": "La partie théorique était organisée en trois sections. La première consistait à recueillir et résumer les connaissances existantes issues de sources fiables comme des livres et des thèses précédentes. La deuxième se concentrait sur les idées et conclusions tirées de notre prototype — une solution logicielle que nous avons développée pour la partie pratique. Enfin, la troisième section combinait ces deux parties, offrant une comparaison critique et une réflexion sur ce que nous avions appris à travers l’ensemble du projet.",
  "The practical aspect required us to design and implement a solution, either soft.9F57571ADA22C3F461BC": "L’aspect pratique exigeait de concevoir et de mettre en œuvre une solution, soit logicielle, soit matérielle, pour résoudre un problème réel. Mon coéquipier, Clemens Schlipfinger, et moi avons décidé de nous concentrer exclusivement sur le logiciel pour garantir la fiabilité. Le matériel peut introduire des problèmes imprévisibles, tandis que le logiciel — surtout lorsqu’il est déployé dans des conteneurs Docker robustes — offre un environnement cohérent qui fonctionne sans problème partout.",
  "What made our project particularly exciting was our partnership with Siemens AG,.E3DFFF62A58AA54FFAF4": "Ce qui rendait notre projet particulièrement excitant, c’était notre partenariat avec Siemens AG, une entreprise multinationale renommée spécialisée dans l’énergie, l’automatisation et la digitalisation. Cette collaboration était rare parmi nos pairs et ajoutait une dimension professionnelle à notre travail. Siemens nous a confié la mission de développer une solution logicielle orientée services pour analyser les anomalies du réseau électrique européen.",
  "The system we built comprised several components, each designed to handle a spec.66064ADCDD1375BE0F9A": "Le système que nous avons construit comprenait plusieurs composants, chacun conçu pour remplir une fonction spécifique. Au cœur du système se trouvait une application Kafka responsable de l’ingestion des données — des rapports d’anomalies du réseau électrique que nous appelions Findings. Ces rapports détaillaient les défaillances et irrégularités dans le réseau électrique complexe européen, composé de millions de composants interconnectés comme des transistors, des interrupteurs et des générateurs. Kafka transmettait les anomalies les plus récentes à une base de données PostgreSQL, qui était ensuite rendue accessible via une API GraphQL. Cette API offrait des fonctionnalités complètes comme la pagination, le filtrage et le requêtage pour assurer une intégration fluide avec notre frontend basé sur Angular.",
  "The frontend was designed as a user-friendly dashboard with three key sections:": "Le frontend a été conçu comme un tableau de bord convivial avec trois sections clés :",
  "Anomalies Table – A searchable, paginated, and filterable table for quick naviga.530B334CB3F183450BCF": "Table des anomalies – Un tableau consultable, paginé et filtrable pour naviguer rapidement parmi les anomalies.",
  "Graph View – A dynamic visualisation of anomaly data, making it easier to pinpoi.FA55A622C6F84DDFA484": "Vue Graphique – Une visualisation dynamique des données d’anomalies, facilitant l’identification de la source d’un problème dans le réseau vaste et complexe.",
  "Overall Dashboard – Key metrics and insights for quick, actionable overviews.": "Tableau de bord global – Des indicateurs clés et des aperçus pour une vue d’ensemble rapide et exploitable.",
  "Clemens and I divided our responsibilities evenly. Clemens handled the backend s.57A227B299EB92B6AC25": "Clemens et moi avons réparti les responsabilités de manière équitable. Clemens s’est occupé des systèmes backend, y compris Kafka, PostgreSQL et l’API GraphQL, garantissant un pipeline de données fiable et efficace. De mon côté, j’ai pris le rôle de chef de projet, coordonnant la communication avec Siemens tout en développant le frontend et en assurant l’intégration fluide des différents composants. Cette collaboration nous a permis de tirer parti de nos points forts et de maintenir une charge de travail équilibrée.",
  "Our final product not only met Siemens' requirements but also demonstrated the p.3DFD3D918F5BEBCA8D06": "Notre produit final répondait non seulement aux exigences de Siemens, mais démontrait également la puissance d’une architecture orientée services (SOA) bien conçue dans la résolution de problèmes complexes et réels. C’était extrêmement gratifiant de voir notre logiciel fonctionner de manière fiable et fournir des informations exploitables pour remédier aux anomalies du réseau électrique.",
  "For more details about our work, feel free to explore our thesis [here](https://.404251D1094C50B2114B": "Pour plus de détails sur notre travail, n’hésitez pas à consulter notre thèse [ici](https://trueberryless.org/thesis.pdf) 📜 ou à lire notre cours vidéo [ici](https://videos.trueberryless.org/videos/thesis/) 🎥 (tous deux disponibles uniquement en allemand).",
  "![Terraform Variables Resolution Example](../../../assets/blog/terraform-variabl.112614E03BD3DF5C3717": "Exemple de Résolution des Variables Terraform",
  "How I Built a GitHub Profile README That Shouldn't Exist (But It Does)": "Comment j'ai créé un README de profil GitHub qui ne devrait pas exister (mais qui le fait)",
  "Creating a standout <a class=\"gh-badge\" href=\"https://github.com/github\"><img sr.2311B04CBE33507503C4": "Créer un README de profil <a class=\"gh-badge\" href=\"https://github.com/github\"><img src=\"https://github.com/github.png\" alt=\"github\" />GitHub</a> remarquable ne consiste pas seulement à ajouter quelques badges — il s'agit de repousser les limites techniques. Dans cette plongée approfondie, j'explore la manipulation de SVG au niveau bas, la conversion de HTML en SVG, les animations intégrées, et l'automatisation complète avec les GitHub Actions pour construire ce que je crois être l'un des README GitHub les plus techniquement avancés. D'une grille Bento dynamique qui se met à jour toutes les 5 minutes à l'intégration de SVG en direct sans requêtes externes, ce projet a transformé mon profil en une vitrine vivante et auto-mise à jour de mon travail. Vous voulez savoir comment j'ai fait ? Décortiquons cela. 🚀",
  "Read the more formal story [here](/blog/github-profile-readme/)": "Lisez l'histoire plus formelle [ici](/blog/github-profile-readme/)",
  "GitHub's Markdown [strips out a not a huge number of HTML tags, but important on.205FA73346A246681FB2": "Le Markdown de GitHub [supprime un certain nombre d'étiquettes HTML, mais des étiquettes importantes](https://github.github.com/gfm/#disallowed-raw-html-extension). Des raisons de sécurité, bien sûr (et je respecte totalement cela, GitHub, vraiment ❤️), mais cela signifiait que mon design parfait était complètement **inutilisable**.",
  "I tried tweaking it. Replacing unsupported tags with ones that worked. Maybe I c.9C1A1617434D20136447": "J'ai essayé de l'ajuster. De remplacer les étiquettes non prises en charge par celles qui fonctionnaient. Peut-être que je pouvais en sauver une partie ? *Non*. Les limitations du Markdown signifiaient que ma mise en page idéale était impossible.",
  "When in doubt, automate. If I couldn't get my HTML in directly, maybe I could ge.1858A8B032C310D0855B": "En cas de doute, automatisez. Si je ne pouvais pas insérer directement mon HTML, peut-être que je pouvais générer quelque chose de dynamique avec un script ? Alors j'ai bricolé un script Python pour récupérer mon dernier dépôt GitHub et l'insérer dans mon README. Je laisse juste ces octets aléatoires que certains appelleraient du code Python ici :",
  "This seemed like a step in the right direction. It was automated. It was functio.C4E6DC32E9331691DF3A": "Cela semblait être un pas dans la bonne direction. C'était automatisé. C'était fonctionnel. Mais cela ne résolvait pas mon problème principal. 😢",
  "This wasn't about dynamic content — it was about *design*. And no amount of Pyth.DA93C57EF8343BE1D312": "Il ne s'agissait pas de contenu dynamique — il s'agissait de *design*. Et aucun script Python ne rendrait le Markdown beau.",
  "![Throw away a good idea](../../../assets/blog/technically-impressive-github-pro.03B551FCEE5B8C4D1AE7": "Jeter une bonne idée",
  "I realised that if I couldn't directly embed HTML into Markdown, I could fake it.9ED2A1ECED976015FF4F": "Je me suis rendu compte que si je ne pouvais pas intégrer directement du HTML dans le Markdown, je pouvais feindre en utilisant des SVG imbriqués. (au fait, ceci est massivement simplifié ; le processus réel a pris des jours qui semblaient être des semaines, voire des mois, mais je sais que vous ne liriez tout de même rien de tout cela alors peu importe.)",
  "Encode all images in **Base64** (because GitHub Markdown won't load external ima.E9111278458075460675": "Encoder toutes les images en **Base64** (parce que le Markdown de GitHub ne chargera pas les images externes à l'intérieur d'un SVG contenant du HTML).",
  "It updates itself every 5 minutes, runs completely on GitHub Actions, and doesn'.83A1BE6CD135F68513B3": "Il se met à jour toutes les 5 minutes, fonctionne entièrement avec GitHub Actions, et ne dépend d'aucun service externe. C'est magnifique. C'est efficace. Et surtout, c'est techniquement absurde dans le meilleur des cas.",
  "Isn't that bad compared to the [old README.md](https://github.com/trueberryless/.6E17F52CECF11CDBE670": "Ce n'est pas si mal comparé à l'[ancien README.md](https://github.com/trueberryless/trueberryless/blob/5dce4ad0033b00829f8ec3756827057017447a65/README.md). Et ne commentez pas pourquoi j'écoute de la K-pop ! C'est mieux que vous ne le pensez, faites-moi confiance.",
  "But in the end, I created a [GitHub](https://github.com/github) profile README t.B8AC0FFCEFB516E68262": "Mais au final, j'ai créé un README de profil [GitHub](https://github.com/github) qui *ne devrait pas exister* — mais il existe. Et je l'adore.",
  "![Default styling of the Starlight sidebar](../../../assets/blog/starlight-sideb.0331D38A07873367F480": "Style par défaut de la barre latérale Starlight",
  "![Starlight sidebar where the margin between root-level items is smaller](../../.89CA79CF269489CCFFC6": "Barre latérale Starlight où la marge entre les éléments de niveau racine est plus petite",
  "![Starlight sidebar with lighter font weight](../../../assets/blog/starlight-sid.4E8DAA65B21751F8D390": "Barre latérale Starlight avec un poids de police plus léger",
  "![Starlight sidebar with dimmer colors](../../../assets/blog/starlight-sidebar-w.BD6139B97F87359FF661": "Barre latérale Starlight avec des couleurs plus ternes",
  "![Starlight sidebar with smaller font size](../../../assets/blog/starlight-sideb.951F34B3CACD02E0A935": "Barre latérale Starlight avec une taille de police plus petite",
  "![Final result with desktop view on the left and mobile view on the right](../...FD8F8FAFE2FBDBE76329": "Résultat final avec vue bureau à gauche et vue mobile à droite",
  "A Stylish Way to Give Credit in Starlight Projects": "Une façon élégante de rendre hommage dans les projets Starlight",
  "Inspired by the Starlight credit in Astro docs, I made a customizable plugin tha.6909F2E2BE5CAB2C314C": "Inspiré par le crédit Starlight dans la documentation Astro, j'ai créé un plugin personnalisable qui lie vers Starlight, Astro et le Starlight Blog, avec un support multilingue.",
  "Starlight Cooler Credit is a customizable plugin that gives stylish, multilingua.4FCC5DBB2DC131D33CAC": "Starlight Cooler Credit est un plugin personnalisable qui offre des liens de crédit élégants et multilingues vers Starlight, Astro et le Starlight Blog—transformant une petite idée en une collaboration mondiale.",
  "It all started when I noticed the credit link to [Starlight](https://starlight.a.E3176BDD24D595103F8B": "Tout a commencé lorsque j'ai remarqué le lien de crédit vers [Starlight](https://starlight.astro.build) dans la [documentation Astro](https://docs.astro.build). Positionné au bas de la table des matières, il était simple mais élégant, et j'aimais la manière subtile de reconnaître l'auteur du projet. Lorsque Starlight a introduit sa propre option de crédit, je l'ai activée dans tous mes projets. C'était discret, petit et placé au bas de chaque page—sympathique, mais facile à manquer.",
  "That’s when I thought, *What if others want a cooler credit option, like the one.A4A2F8A54AB64409161B": "C'est alors que je me suis dit, *Et si d'autres voulaient une option de crédit plus cool, comme celle de la documentation Astro ?* Alors, je me suis mis à créer un plugin. Au départ, c'était juste un projet amusant pour faire des liens vers Starlight et Astro d'une manière plus visible. J'ai commencé avec deux préréglages—un pour Starlight et un pour Astro—et j'ai partagé mon travail sur le Discord d'Astro.",
  "That’s where things took off. [One awesome Astro maintainer](https://www.rainsbe.B87402A9E163AA44FD52": "C'est là que tout a changé. [Un mainteneur extraordinaire d'Astro](https://www.rainsberger.ca/) a suggéré, *\"Pourquoi ne pas ajouter un lien vers le Starlight Blog également ?\"* et j'ai pensé, *Quelle idée géniale !* J'ai ajouté le blog comme troisième préréglage, et soudainement, le plugin est devenu bien plus que ce que j'avais prévu.",
  "But I wasn’t done yet. It bugged me that the credits were always in English, so .2030C81E5E275567F632": "Mais je n'avais pas encore fini. Ça m'agaçait que les crédits soient toujours en anglais, alors j'ai décidé de les faire traduire automatiquement en fonction des langues prises en charge par Starlight. C'est là que la vraie aventure a commencé. J'ai sollicité la communauté pour m'aider à traduire le plugin dans différentes langues. La réponse a été incroyable ! Des personnes du monde entier ont proposé leur aide, et ce qui avait commencé comme un projet solo s'est transformé en une collaboration mondiale. En chemin, j'ai fait de nouvelles rencontres et appris énormément grâce à tous ceux qui ont participé. Maintenant, le plugin prend en charge une dizaine de langues, et de nouvelles traductions continuent d'arriver.",
  "What started as a simple idea turned into something I’m really proud of: **Starl.95365D5202F9DED635D6": "Ce qui a commencé comme une idée simple est devenu quelque chose dont je suis vraiment fier : **Starlight Cooler Credit**. Ce n'est pas juste un plugin—c'est une façon de rendre hommage avec style, personnalisation et une touche de travail d'équipe mondial.",
  "If you’re curious, you can check it out at [starlight-cooler-credit.trueberryles.6ABA7C0A45AE4104F8C3": "Si vous êtes curieux, vous pouvez le découvrir sur [starlight-cooler-credit.trueberryless.org](https://starlight-cooler-credit.trueberryless.org/). Essayez-le—je pense que vous l'aimerez autant que moi !",
  "![Cloudflare API Token](../../../assets/blog/setup-kubernetes-with-cilium-and-cl.03ECE300FA8789879B29": "Jeton API Cloudflare",
  "Organising School Life: The Journey Behind Mutanuq": "Organiser la vie scolaire : le parcours derrière Mutanuq",
  "A fast, Markdown-powered website that organises school content, simplifies learn.C76D3D9450130FF80C83": "Un site web rapide, propulsé par Markdown, qui organise le contenu scolaire, simplifie l'apprentissage et soutient la croissance éducative.",
  "Mutanuq is a fast, Markdown-powered website I built to organize school content, .8D9E316ADD5966467825": "Mutanuq est un site web rapide propulsé par Markdown que j'ai conçu pour organiser le contenu scolaire, rationaliser l'étude et créer une ressource fiable pour mes camarades de classe et moi-même.",
  "In my second year at HTL Krems, 2021, I embarked on a project that combined two .4F2292C7BC6324244DF9": "Lors de ma deuxième année à HTL Krems, en 2021, j'ai entrepris un projet qui combinait deux choses qui m'ont toujours passionné : créer mon propre site web et trouver de meilleures façons d'organiser l'immense flux de matériel scolaire. Comme beaucoup d'étudiants, mes notes étaient éparpillées entre OneNote, des fichiers Word, des feuilles Excel, Google Drive, et même des outils comme [Witeboard](https://witeboard.com/). Ce chaos était écrasant, rendant difficile de se concentrer sur un apprentissage efficace.",
  "Driven by the vision of streamlining this process—not just for me, but also for .767678E51699FE7BA56A": "Animé par la vision de simplifier ce processus—non seulement pour moi, mais aussi pour mes camarades de classe—j'ai décidé de créer une plateforme centralisée pour résumer le contenu scolaire. Mon objectif était double : simplifier l'étude et inspirer la motivation parmi mes pairs.",
  "At that time, I wasn’t aware of frameworks that could make building documentatio.46FC3F67CBB578E4C0C2": "À cette époque, je ne connaissais pas de cadres qui pourraient faciliter la création de sites web de style documentation. Au lieu de cela, je me suis appuyé sur du simple HTML, CSS et JavaScript pour concevoir les premières versions de ce que j'appelais *Schneider IT*. Bien que j'adorais travailler dessus, mes premières tentatives étaient maladroites : générer dynamiquement la table des matières et la barre latérale avec mon propre code JavaScript entraînait des temps de chargement douloureusement lents. Il fallait 10 secondes ou plus pour que tout s'affiche !",
  "Despite the setbacks, I kept iterating. By 2023, I had created and discarded abo.4C51D8C17C02D0DB4703": "Malgré les revers, j'ai continué à itérer. En 2023, j'avais créé et abandonné environ 10 versions du site, cherchant toujours un design plus épuré et un système de gestion plus efficace. Le potentiel du site était clair pour moi, mais sa convivialité n'était pas encore au rendez-vous.",
  "That’s when I stumbled upon [Starlight](https://starlight.astro.build/), a power.2C6631782B77735B3205": "C'est à ce moment-là que je suis tombé sur [Starlight](https://starlight.astro.build/), un cadre puissant et incroyable créé par [Chris Swithinbank (@delucis)](https://github.com/delucis) pour créer des sites web rapides propulsés par Markdown. Découvrir Starlight a été un tournant—cela m'a permis de combiner deux choses qui me passionnent : créer des sites web et utiliser Markdown pour sa simplicité et son élégance.",
  "With the transition to Starlight, Schneider IT evolved into *Mutanuq*. The new n.99A51B0573CAAE76AA7D": "Avec la transition vers Starlight, Schneider IT est devenu *Mutanuq*. Le nouveau nom marquait un nouveau départ et reflétait le site web épuré et modernisé qu'il était devenu. J'ai tout réécrit, optimisé les performances du site et concentré mes efforts sur la création de contenu spécifiquement adapté aux besoins de mes camarades de classe, en particulier pour les tests à venir.",
  "The transformation paid off. Friends began using the website regularly and gave .0C49D62224878320182A": "La transformation a porté ses fruits. Mes amis ont commencé à utiliser le site régulièrement et à donner des retours enthousiastes comme : *\"Frérot, ce site est vraiment génial !\"* Mutanuq n'était pas seulement un outil pour les examens—il est devenu une ressource de confiance pour mes pairs et une archive personnelle pour toutes les connaissances que je voulais préserver au-delà de l'école.",
  "Thanks to Starlight, managing and expanding Mutanuq became effortless, and the p.DA9EDB995FD28655BD1F": "Grâce à Starlight, gérer et développer Mutanuq est devenu un jeu d'enfant, et le projet a évolué en quelque chose que je suis fier de maintenir même aujourd'hui. Ce qui avait commencé comme *Schneider IT*—une petite idée pour organiser mes notes—s'est épanoui en *Mutanuq*, une plateforme qui simplifie l'apprentissage pour les autres tout en préservant des connaissances précieuses pour mon moi futur.",
  "Designing a Profile That Works Within GitHub's Rules": "Concevoir un profil qui fonctionne dans les règles de GitHub",
  "How I Built a GitHub Profile README That Shouldn't Exist But It Does": "Comment j’ai conçu un README de profil GitHub qui ne devrait pas exister, mais qui existe",
  "Every great project starts with a realization of a problem. My GitHub profile RE.481577399AECDF28BE26": "Tout grand projet commence par la prise de conscience d’un problème. Mon README de profil GitHub était en désordre, rempli d’une quantité excessive d’informations, trop de badges, et un contenu accablant qui manquait de style et de structure. Il contenait des réalisations de hackathon, des graphiques de contributions GitHub, divers badges techniques, et bien plus, ce qui le rendait visuellement peu attrayant et difficile à naviguer. Au début, je pensais que c'était une manière efficace de me présenter, mais avec le temps, il est devenu clair que l'information était plus accablante qu'informative. Je voulais quelque chose de nouveau, une approche plus raffinée et visuellement attrayante pour présenter mon profil, et l’idée d’implémenter une grille « bento » m’est venue à l’esprit. L’objectif était de créer une mise en page qui soit non seulement fonctionnelle, mais également esthétiquement impressionnante et structurée.",
  "The first step was designing an ideal layout using HTML and CSS. The result was .6D5E560BE64C73324B74": "La première étape consistait à concevoir une mise en page idéale en utilisant HTML et CSS. Le résultat était prometteur, une conception structurée et visuellement agréable qui transmettait efficacement les informations prévues. Cependant, l’implémentation directe de ceci dans mon README de profil GitHub n’était pas simple. Le Markdown propre à GitHub impose des limitations strictes sur les éléments HTML pris en charge en raison des contraintes de sécurité. De nombreuses balises HTML essentielles étaient limitées, rendant impossible l'intégration de la conception telle qu'elle avait été envisagée. Comprendre ces limitations signifiait repenser complètement l’approche.",
  "Faced with these restrictions, I considered alternative ways to dynamically gene.2567BD537B285ECB001A": "Confronté à ces restrictions, j’ai envisagé des moyens alternatifs pour générer et présenter dynamiquement le contenu. Une approche consistait à automatiser les mises à jour du contenu à l’aide d’un script Python pour récupérer mon dernier dépôt GitHub et l’insérer dynamiquement dans le README. Le script accédait à l’API GitHub, récupérait le dépôt mis à jour le plus récemment, et modifiait le README en conséquence. Bien que cela ait été une expérimentation intéressante d’automatisation, cela ne résolvait pas le problème central, qui était la nécessité d’un design structuré et visuellement attrayant.",
  "Considering alternative approaches, I briefly entertained the idea of taking a s.780BAADFF3D433749DDA": "Envisageant des approches alternatives, j’ai brièvement envisagé l’idée de prendre une capture d’écran de la mise en page HTML conçue et de l’intégrer comme une image statique dans le README. Bien que cela aurait visuellement résolu le problème, cela semblait être une solution peu élégante qui manquait de flexibilité et de réactivité. Avançant, j’ai cherché une méthode qui permettait à la fois la structure et l’adaptabilité tout en maintenant les mises à jour dynamiques du contenu.",
  "SVGs emerged as a potential solution. They support scalability, maintain visual .0193206311AC8FC941A3": "Les SVGs se sont révélés être une solution potentielle. Ils assurent l’évolutivité, maintiennent une clarté visuelle sur différentes résolutions, et permettent l’intégration de texte et d’autres éléments. Une première expérimentation impliquait l’intégration de HTML dans un SVG en utilisant la balise `foreignObject`. Bien que conceptuellement prometteuse, la mise en œuvre s'est avérée complexe et a été mise de côté temporairement. En revenant au problème plus tard, une approche plus structurée était nécessaire.",
  "The final approach involved using a composite SVG structure. The solution consis.F542E5E0B858565590BE": "L’approche finale consistait à utiliser une structure SVG composite. La solution se composait de plusieurs éléments clés : convertir la mise en page HTML originale en une représentation SVG, encoder les images en Base64 pour garantir leur chargement correct, intégrer des éléments dynamiques tels que des statistiques GitHub et des mises à jour du statut Spotify sous forme de SVG inline, et automatiser les mises à jour via GitHub Actions. En utilisant ces techniques, la mise en page en grille « bento » est devenue entièrement fonctionnelle, capable de se mettre à jour automatiquement tout en conservant une apparence propre et structurée, respectant les contraintes du Markdown propre à GitHub.",
  "A critical turning point was the discovery of a Stack Overflow post detailing a .BFAFB816D1969BB990B1": "Un point tournant critique a été la découverte d’un post sur Stack Overflow détaillant une méthode pour convertir HTML en SVG de manière efficace et efficiente. Cette méthode fournissait un moyen structuré de générer les éléments SVG nécessaires tout en préservant le design prévu. En combinant cela avec l’encodage Base64 pour les images et les GitHub Actions pour l’automatisation, cela a permis d’obtenir une solution complète répondant à toutes les exigences initiales.",
  "The final implementation consists of a refined and visually striking GitHub prof.C95E5BCA4CC5C610AAF2": "La mise en œuvre finale consiste en un README de profil GitHub raffiné et visuellement remarquable qui intègre des mises à jour dynamiques tout en conservant une structure élégante. Il présente les informations clairement sans surcharge inutile et est entièrement automatisé, se mettant à jour toutes les cinq minutes sans intervention manuelle. Le projet a nécessité des recherches importantes et des expérimentations avec les SVGs, les GitHub Actions, et les limitations du Markdown. Le processus a demandé de la persévérance et de la résolution de problèmes pour travailler dans les contraintes de la plateforme tout en obtenant un résultat techniquement impressionnant. Le résultat est un README de profil GitHub qui équilibre efficacement design, automatisation et fonctionnalité dans les limitations de la plateforme.",
  "If you're now inspired to create a stunning GitHub profile README yourself, read.BC2C5ED3BDEE87A869B8": "Si vous êtes maintenant inspiré pour créer vous-même un README de profil GitHub impressionnant, lisez mon [article de blog technique et amusant](/blog/technically-impressive-github-profile-readme/) ou consultez directement mon dépôt [github.com/trueberryless/trueberryless](https://github.com/trueberryless/trueberryless/tree/7519c6f50094bdfd6fb47f610e6638ac8efdd6ad). Et si vous trouvez mon travail utile, pensez à lui donner un ⭐ et à me suivre sur GitHub à [trueberryless](https://github.com/trueberryless)! 🚀",
  "![Cognitive Erosion Paradigm: Layered, green circles with \"AI\" in the centre, su.38D1FAC9088D0BD4738E": "Paradigme d'Érosion Cognitive : Couches concentriques vertes avec \"IA\" au centre, entourées par \"Cerveau\", qui est lui-même entouré de plusieurs segments circulaires étiquetés \"Design\", \"Blog\", \"Chats\", \"Art\", \"Contenu\" et \"Discours\" dans le sens des aiguilles d'une montre.",
  "From Balloons to Binary: A 20th Birthday Packed with Clues": "Des ballons à la binaire : un 20ème anniversaire rempli d'énigmes",
  "This is the story of creating a true art masterpiece.": "Ceci est l'histoire de la création d'un véritable chef-d'œuvre artistique.",
  "This year, I turned 20 - and instead of simply lighting candles and inflating ba.CEC0F0AD03DAEF815274": "Cette année, j'ai eu 20 ans - et au lieu de simplement allumer des bougies et gonfler des ballons, je voulais célébrer de manière plus créative et personnelle. L'idée ? Cacher le nombre 20 sous autant de formes surprenantes, astucieuses et dissimulées que possible dans un salon décoré - puis tout capturer dans une seule photo. Que ce soit à travers des énigmes mathématiques ou des clins d'œil visuels, la pièce s'est transformée en une devinette joyeuse pleine de détails ludiques.",
  "I Turned 20 - And Turned It Into a Puzzle": "J'ai eu 20 ans - Et j'en ai fait une énigme",
  "The final result wasn't just a festive setting, but a carefully designed puzzle .B767471D3FEF6C98BD69": "Le résultat final n'était pas simplement un décor festif, mais une énigme soigneusement élaborée, remplie de sens, d'humour et de clins d'œil subtils à des choses que j'aime. Certains indices sont faciles à repérer, d'autres sont profondément cachés ou nécessitent une interprétation créative - mais maintenant que le défi a été lancé, il est temps de révéler les secrets.",
  "Altogether, the number 20 (or variations of it) appears **73 times** throughout .913452A34E0ADB471EF0": "Dans l'ensemble, le nombre 20 (ou ses variations) apparaît **73 fois** sur l'image. Cela inclut 14 occurrences du nombre littéral “20” caché sous des formes astucieuses comme des codes-barres, des QR codes et des valeurs hexadécimales, ainsi que six moments où des objets apparaissent en quantités exactes de vingt. On compte aussi 32 apparitions de “20” imprimées sur des ballons d'anniversaire éparpillés dans la pièce - bien qu'environ la moitié ne soient pas visibles dans l'image - et cinq références supplémentaires reflétant de façon créative mon anniversaire via des nombres comme 2025 ou 2005.",
  "Roughly 40 of these clues are clearly visible and solvable from the photo alone..900B0E49D675342ADE28": "Environ 40 de ces indices sont clairement visibles et résolvables uniquement à partir de la photo. Les autres nécessitent une réflexion latérale ou de l'imagination pour les découvrir - surtout ceux qui se cachent juste au-delà du cadre en deux dimensions de l'image.",
  "How the “20” Was Hidden": "Comment le \"20\" a été caché",
  "Many of the 20s are woven directly into the decor. There's a bright 20 km/h road.DF20030D8A7B9E4CCCF0": "Beaucoup de \"20\" sont intégrés directement dans la décoration. Il y a un panneau de signalisation indiquant 20 km/h, de grands ballons en aluminium en forme des chiffres 2 et 0, et une immense bannière “Joyeux 20ème Anniversaire” accrochée à la fenêtre. Un “gâteau” d'anniversaire fait de 20 rouleaux de papier toilette trône fièrement près du centre, entouré d'éléments décoratifs comme des horloges, des fruits, des chocolats Ferrero Rocher, des bougies de fête et des pièces de jeux - tous groupés intentionnellement par quantités de 20.",
  "Then come the mathematical twists: two QR codes subtly lead to the number 20. Th.631C4BD85BA49B72C4E1": "Puis viennent les astuces mathématiques : deux QR codes mènent subtilement au nombre 20. Il y a une bande en code Morse, un code binaire (10100) et une couleur représentée en hexadécimal qui se convertit en 20 en base<sub>10</sub>. Un code-barres cache visuellement le nombre, tandis qu'une main de cartes à jouer (As, Valet, Dame, Roi) s'additionne intelligemment pour atteindre 20. Une paire de dominos, aussi, somme le nombre magique. Même une part de gâteau sur le canapé - précisément 20% du tout - poursuit le thème.",
  "Some of the trickiest clues are tucked into logic puzzles. For example, the appl.3E1D246EA1E47E0643AB": "Certains des indices les plus complexes sont cachés dans des énigmes logiques. Par exemple, les pommes et les poires sur l'étagère murale en bois ressemblent à des 1 et des 0, et si elles sont décodées correctement, elles épellent \"Fe\" - un clin d'œil subtil à mon prénom, Félix. Les dés sur la table sont orientés de manière à ce que vous puissiez déduire les faces cachées du dessus, qui, une fois additionnées, donnent 20.[^1] Et le casse-tête le plus difficile : un paquet de mikados dont la valeur totale visible des pointes est de 110 - ce qui, interprété en base<sub>4</sub>, équivaut exactement à 20 en décimal. Une véritable énigme dans l'énigme !",
  "Fun fact: The tops of the dice should add up to 20, but in the final picture, th.1AD6690ECD087653EA2B": "Fait amusant : Les faces supérieures des dés devraient totaliser 20, mais sur la photo finale, elles n'atteignent que 12. Cela s'explique par le fait que les cinq dés n'ont pas été fabriqués selon la même disposition — deux suivent une numérotation dans le sens horaire et trois dans le sens antihoraire, comme expliqué [ici sur Wikipédia](https://en.wikipedia.org/wiki/Dice#Arrangement). 😂",
  "A few clues also fall under the “pop culture knowledge” category. There's a ment.AB39B4A99B41F7978013": "Quelques indices relèvent également de la “culture pop”. On mentionne Rihanna, qui, comme moi, est née le 20 février. Un petit hommage à Hans Zimmer et Christopher Nolan fait référence à leur collaboration de 2005 sur Batman Begins - l'année de ma naissance.",
  "A Snapshot of My Musical Taste": "Un aperçu de mes goûts musicaux",
  "While not directly part of the 20-themed puzzle, there's a musical layer hidden .E75B2EA910ADE079A758": "Bien qu'il ne fasse pas directement partie de l'énigme autour du chiffre 20, il y a une couche musicale cachée dans l'image qui reflète quelque chose de profondément personnel : mon amour pour la musique. Dans le coin supérieur gauche, huit pochettes d'albums carrées sont disposées avec soin, chacune présentant un code Spotify pointant vers l'un de mes morceaux préférés de tous les temps. Légèrement décalée à droite, la neuvième pochette représente une playlist rassemblant toutes ces chansons - une petite bande-son de mon univers.",
  "Each song on that list has earned its place not just for how it sounds, but for .64FF10782E65A696CFEC": "Chaque chanson sur cette liste a gagné sa place non seulement par son son, mais aussi pour les histoires, souvenirs et émotions qu'elle porte. Et surtout, pour les artistes incroyables qui les ont créées.",
  "It starts with *Molossus* from Batman Begins, a powerful, rising track that intr.0B2CCAEA825C10332861": "Cela commence avec *Molossus* de Batman Begins, un morceau puissant et exaltant qui m'a fait découvrir l'étonnant mélange de films et de musique grâce au travail de Hans Zimmer et Christopher Nolan - l'un de mes duos réalisateur-compositeur préférés. Le film est sorti en 2005, l'année de ma naissance, et bien que The Dark Knight soit mon préféré, Molossus restera toujours un morceau emblématique.",
  "Next is *9-bit Expedition* from the Fastfall soundtrack, composed by Lifeformed..60068D27CC86091CE517": "Ensuite, c'est *9-bit Expedition* de la bande originale de Fastfall, composée par Lifeformed. Leur style calme et inspiré par le chiptune touche un point sensible auquel je reviens sans cesse. J'admire tellement leur travail que j’ai utilisé leurs morceaux dans des niveaux personnalisés de Celeste que j'ai créés - non seulement parce qu'ils conviennent, mais parce que leur musique représente quelque chose pour moi.",
  "And then there's *Resurrections* from Celeste - a game I've easily spent 200-300.94D4BAA5C193535ECDD8": "Et puis, il y a *Resurrections* de Celeste - un jeu auquel j'ai facilement consacré 200-300 heures. La vraie magie de son ambiance, c'est Lena Raine, dont la musique atteint vos émotions et en extrait quelque chose de brut et magnifique. Ses compositions ne sont pas juste des arrière-plans - elles sont l'expérience. Je la considère sincèrement comme l'une des compositrices les plus inspirantes que j'aie jamais écoutées, et son travail sur Celeste est un chef-d'œuvre que j'admirerai toujours.",
  "Also in the mix is *22:12 - Until the End of Time* by Danger, from the Haven sou.72EAD217688685BCB963": "Aussi dans le mélange : *22:12 - Until the End of Time* par Danger, de la bande-son de Haven. Je n'ai même pas joué au jeu - la musique à elle seule m'a captivé. C'est cinématographique, émotionnel et complètement immersif. Danger a absolument réussi, créant un monde sonore dans lequel je pourrais me perdre pendant des heures.",
  "*Annihilate* from Across the Spider-Verse is another standout. I love both movie.9437FFA646F4451D9745": "*Annihilate* tiré de Across the Spider-Verse est un autre favori. J'adore les deux films de la série, et ce morceau capture parfaitement l'énergie, le style et l'émotion de l'histoire de Miles. C'est une explosion sonore qui ne vieillit jamais.",
  "From a totally different genre comes *ROTTWEiLER* by TJ\\_beastboy, a German rapp.B95612C092ABF85A718D": "D'un genre complètement différent vient *ROTTWEiLER* de TJ_beastboy, un rappeur allemand qui, pour moi, est à un niveau complètement différent. Il mélange des vibrations chill et une intensité entraînante d'une manière qui semble fraîche et authentique. Sa musique a toujours quelque chose d'unique à exprimer, et je pense honnêtement qu'il est l'un des meilleurs artistes actuels.",
  "Another track I couldn't leave out is *747* from Tenet - another mind-bending No.89615FC31E49EF7EA4BB": "Une autre piste que je ne pouvais pas omettre est *747* de Tenet - un autre film de Nolan aux scénarios alambiqués, avec une bande sonore signée Ludwig Göransson. L'énergie, le rythme et la structure de cette pièce frappent fort. C'est facilement l'une de mes bandes-son de film préférées de tous les temps, et Göransson continue de prouver qu'il est un génie en matière de musique de cinéma.",
  "Last but far from least: *MORE* by K/DA - my most-played song ever. It's high-en.12164785491B9D2DAF37": "Enfin, mais loin d'être des moindres : *MORE* de K/DA - ma chanson la plus écoutée. Elle est énergique, polie, confiante et simplement ultra fun. La K-pop en général est bien trop sous-estimée, et ce morceau est la preuve que les frontières de genre n'ont pas d'importance quand une chanson fonctionne à tous les niveaux.",
  "These songs - and the brilliant minds behind them - aren't just background music.E5DA08D529E76E42DBB3": "Ces chansons - et les esprits brillants derrière elles - ne sont pas juste de la musique d'ambiance. Elles font partie de mon monde créatif, de mon paysage émotionnel, et de la bande-son de tout ce que j'aime faire.",
  "Stats for Nerds": "Statistiques pour les Nerds",
  "For those who enjoy data and structure, here's a little summary of all 20s in th.B3CE0613F24C05B8FFE5": "Pour ceux qui apprécient les données et la structure, voici un petit résumé de tous les \"20\" dans l'image :",
  "Category": "Catégorie",
  "Count": "Nombre",
  "Total hidden instances": "Instances cachées totales",
  "73x": "73x",
  "Clearly visible and solvable": "Clair et résoluble",
  "\\~40x": "\\~40x",
  "Written \"20\"": "\"20\" écrit",
  "14x": "14x",
  "Groups of 20 identical items": "Groupes de 20 objets identiques",
  "6x": "6x",
  "Birthday balloons printed with \"20\"": "Ballons d'anniversaire imprimés avec \"20\"",
  "32x": "32x",
  "Creative variations (e.g., 2025, 2005)": "Variations créatives (ex. : 2025, 2005)",
  "5x": "5x",
  "Puzzle Solutions": "Solutions des énigmes",
  "Code Type": "Type de Code",
  "Representation": "Représentation",
  "QR Codes": "Codes QR",
  "Bar Code": "Code-barres",
  "20\\. February": "20. février",
  "Binary Code": "Code binaire",
  "Today is February 20th, 2025": "Aujourd'hui, c'est le 20 février 2025",
  "Base": "Base",
  "Code": "64",
  "My birthday is February 20th, 2005": "Mon anniversaire est le 20 février 2005",
  "Hex Code (Color Codes)": "Code Hexadécimal (codes couleurs)",
  "twenty": "vingt",
  "Morse Code": "Code Morse",
  "20\\. FEBRUARY 2005": "20. FÉVRIER 2005",
  "Playing Cards": "Cartes à jouer",
  "King (4) + Queen (3) + Jack (2) + Ace (11) = 20": "Roi (4) + Reine (3) + Valet (2) + As (11) = 20",
  "Domino": "Domino",
  "(0|2) + (3|3) + (4|0) + (2|1) + (1|0) + (2|2) = 20": "(0|2) + (3|3) + (4|0) + (2|1) + (1|0) + (2|2) = 20",
  "Apples (0) and Pears (1)": "Pommes (0) et Poires (1)",
  "Binary Code: Fe": "Code binaire : Fe",
  "Mikado Sticks Value": "Valeur des bâtons Mikado",
  "110 (base": "110 (base",
  ") = 20 (base": "4) = 20 (base",
  "Dice top sides": "10)",
  "It was a joy to turn this celebration into a personal challenge and to see frien.C633AD0611AAAC49C2DA": "3 + 2 + 1 + 1 + 5 = 12",
  "How to fully autogenerate Starlight sidebars (without losing control)": "Comment générer automatiquement des barres latérales Starlight sans perdre le contrôle",
  "Learn two Starlight techniques to autogenerate large sidebars while keeping clea.20BC1955A37AA7859B18": "Découvrez deux techniques de Starlight pour générer automatiquement de grandes barres latérales tout en conservant des URL et des intitulés propres.",
  "Have you ever wanted to simplify sidebar generation in your Starlight project? H.2D5E37D5439F17736C27": "Avez-vous déjà voulu simplifier la génération de barres latérales dans votre projet Starlight ? Avez-vous essayé de générer automatiquement l'intégralité de la barre latérale pour découvrir qu'elle ne vous permet pas de personnaliser la structure selon vos besoins ?",
  "This post demonstrates two Starlight features that make fully autogenerated side.BDF2E65CF1AF47E9F83B": "Cet article démontre deux fonctionnalités de Starlight qui rendent les barres latérales entièrement générées automatiquement flexibles et réduisent la maintenance.",
  "Use case": "Cas d'utilisation",
  "In medium to large Starlight projects, the problem arises that the manual creati.11763E0A14C36D449179": "Dans des projets Starlight de taille moyenne à grande, la création et la maintenance manuelles de la [configuration de la barre latérale Starlight](https://starlight.astro.build/reference/configuration/#sidebar) deviennent une tâche fastidieuse et chronophage.",
  "In the past, Starlight didn't provide the right primitives for this, and the rec.48BF051900AF52DB446D": "Par le passé, Starlight ne fournissait pas les primitives adéquates pour cela, et l'approche recommandée consistait à déplacer d'un niveau inférieur la génération automatique de la configuration de la barre latérale — afin que seuls les dossiers sans sous-dossiers imbriqués soient générés automatiquement. Cependant, avec l'introduction de [Route Data](https://starlight.astro.build/guides/route-data/) et du plus récent [`generateId()` hook de `docsLoader`](https://starlight.astro.build/reference/configuration/#generateid), ces scénarios peuvent désormais être résolus beaucoup plus facilement et efficacement.",
  "Solving the ordering issue": "Résolution du problème d’ordre",
  "A common problem always was: \"How can I customise the order of sidebar folders i.AE2CA0CC5AC2560DCF3C": "Un problème fréquent était toujours : \"Comment puis-je personnaliser l'ordre des dossiers de la barre latérale si je génère automatiquement la barre latérale ?\" D'anciennes problématiques comme [#1223](https://github.com/withastro/starlight/issues/1223) suggèrent une solution inspirée de [Nuxt Content](https://content.nuxt.com) où chaque segment de l'intégralité du chemin peut être [préfixé avec des nombres et des points](https://v2.content.nuxt.com/usage/content-directory#ordering) pour déterminer un ordre numérique au niveau du fichier. Un exemple pour un tel projet pourrait ressembler à ceci :",
  "src/content/docs/nested-folder": "src/content/docs/dossier-imbriqué",
  "1.frameworks": "1.frameworks",
  "1.vue.md": "1.vue.md",
  "2.nuxt.md": "2.nuxt.md",
  "2.examples": "2.examples",
  "1.vercel.md": "1.vercel.md",
  "2.netlify.md": "2.netlify.md",
  "If you want to use this approach in Starlight, it doesn't work out-of-the-box, b.1799E45D5D83874DE15D": "Si vous souhaitez utiliser cette approche dans Starlight, cela ne fonctionne pas immédiatement, mais avec une configuration simple, vous pouvez y parvenir.",
  "Starlight [0.35.0](https://github.com/withastro/starlight/releases/tag/%40astroj.5B25A8356D4B9CE00F94": "Starlight [0.35.0](https://github.com/withastro/starlight/releases/tag/%40astrojs%2Fstarlight%400.35.0) a introduit une fonction de rappel que vous pouvez passer à `docsLoader()` et qui peut manipuler l'identifiant (URL) de la page générée. En divisant l'entrée par `\"/\"` et en supprimant tout nombre + point au niveau des segments, vous disposez maintenant de la même fonctionnalité dans Starlight :",
  "The URL to access the pages now changes e.g., from `/nested-folder/1.frameworks/.6941CF02484C8DCB2B28": "L'URL pour accéder aux pages change maintenant par exemple, de `/nested-folder/1.frameworks/1.vue` à `/nested-folder/frameworks/vue`.",
  "However, the folder names in the sidebar still include the `1.` prefixes. So let.0CAEBB02FF8EEAA7C1F1": "Cependant, les noms des dossiers dans la barre latérale incluent encore les préfixes `1.`. Alors, résolvons également la manipulation de la barre latérale :",
  "Solving the sidebar folder naming issue": "Résolution du problème de nommage des dossiers dans la barre latérale",
  "Starlight [0.32.0](https://github.com/withastro/starlight/releases/tag/%40astroj.7F6BC940CC96F2ABA63D": "Starlight [0.32.0](https://github.com/withastro/starlight/releases/tag/%40astrojs%2Fstarlight%400.32.0) a introduit [Route Data](https://starlight.astro.build/guides/route-data/), que nous pouvons maintenant utiliser pour manipuler les noms des dossiers dans la barre latérale afin de",
  "remove any leading number + dot from the folder name and": "supprimer tout numéro et point en début de nom de dossier, et",
  "apply \"Title Case\" so they don't look completely lowercase": "appliquer la \"Title Case\" afin qu'ils ne soient pas entièrement en minuscules",
  "Internationalisation (i18n)": "Internationalisation (i18n)",
  "Note that [internationalisation (i18n) of folder names](https://starlight.astro..78D4931CBD055B889B4B": "Notez que [l'internationalisation (i18n) des noms de dossiers](https://starlight.astro.build/guides/sidebar/#internationalization) est une fonctionnalité manquante avec une telle configuration, car il n'y a actuellement aucun endroit pour définir des traductions de noms de dossiers ; ils sont simplement convertis en \"Title Case\". Implémenter une logique pour charger dynamiquement les traductions pourrait impliquer de lire le [champ `locale` à partir des données de route](https://starlight.astro.build/reference/route-data/#locale) et de définir les traductions dans des fichiers `json`. Sinon, [utilisez le plugin de HiDeoo](#using-hideoos-plugin), qui [prend en charge l'i18n](https://starlight-auto-sidebar.netlify.app/guides/i18n/).",
  "Don't forget to add the `routeData.ts` file to your `astro.config.mjs`:": "N'oubliez pas d'ajouter le fichier `routeData.ts` à votre fichier `astro.config.mjs` :",
  "Of course you can adjust the code to your needs (e.g., remove the \"Title Case\" t.8EE143244F5E89BEFCE4": "Bien sûr, vous pouvez ajuster le code à vos besoins (par exemple, supprimer la transformation \"Title Case\" si vos noms de fichiers sont déjà correctement écrits).",
  "Using HiDeoo's plugin": "Utilisation du plugin de HiDeoo",
  "If you want to autogenerate your whole sidebar and still have the flexibility to.AB216A94695F22CEA149": "Si vous souhaitez générer automatiquement toute votre barre latérale et conserver la flexibilité nécessaire pour personnaliser tout ce que vous voulez, [HiDeoo](https://github.com/HiDeoo) a également créé un plugin dédié pour de tels cas d'utilisation : [Starlight Auto Sidebar](https://starlight-auto-sidebar.netlify.app).",
  "Especially those two features got mentioned in this article:": "En particulier, ces deux fonctionnalités ont été mentionnées dans cet article :",
  "Controlling the [order](https://starlight-auto-sidebar.netlify.app/metadata/#ord.08329D63645DA7FDB0F2": "Controllant [l'ordre](https://starlight-auto-sidebar.netlify.app/metadata/#order) des répertoires individuels",
  "Adapting the [displayed label](https://starlight-auto-sidebar.netlify.app/metada.41A180D1D992072397D3": "Adaptant [l'intitulé affiché](https://starlight-auto-sidebar.netlify.app/metadata/#label) des dossiers individuels",
  "However, if you want to automate the whole generation without having to specify .AA2463868A43906766FA": "Cependant, si vous souhaitez automatiser entièrement la génération sans devoir spécifier manuellement les intitulés et l'ordre pour chaque répertoire, coder la solution vous-même (avec quelques lignes directrices de ce blog) est la solution préférée et recommandée.",
  "If you want to check out the code presented in this blog, feel free to visit the.9F7F074B6E1A29450183": "Si vous souhaitez consulter le code présenté dans cet article, n'hésitez pas à visiter le [StackBlitz](https://stackblitz.com/github/trueberryless/starlight-autogenerate-whole-sidebar?file=src%2Fcontent.config.ts) ou le code source dans le [dépôt GitHub](https://github.com/trueberryless/starlight-autogenerate-whole-sidebar).",
  "You might think that this story is now over because everyone could just use the .C9618FDEC9BA9ED17D35": "Vous pourriez penser que cette histoire est maintenant terminée, car tout le monde pourrait simplement utiliser la variante qu'il souhaite, et tout le monde est heureux. Mais Starlight a continué et continue de s'améliorer, et environ trois mois plus tard, le 15 février, presque comme un [cadeau d'anniversaire](/blog/20th-birthday/) pour moi, l'ajout tant attendu des données de route dans Starlight est arrivé avec la sortie de la version [v0.32](https://github.com/withastro/starlight/releases/tag/@astrojs/starlight@0.32.0). Cet ajout apparemment mineur a ouvert tant de possibilités, que je n'avais moi-même jamais envisagées. Une fois de plus, HiDeoo a été la principale source d'inspiration pour les auteurs de plugins et a poussé cette nouvelle fonctionnalité à ses limites. Il leur a fallu seulement deux jours pour [adapter plus de 11 plugins à la dernière version de Starlight à l'époque](https://bsky.app/profile/hideoo.dev/post/3liffpudc5c2b) et ils ont ensuite amélioré et refactorisé une grande partie du code pour tirer encore plus parti de cette puissante fonctionnalité.",
  "Deactivate TLS within Argo CD": "Désactiver TLS dans Argo CD"
}